{"id":46388,"date":"2019-09-23T00:00:00","date_gmt":"2019-09-23T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/09\/data-shows-road-rage-on-the-rise\/"},"modified":"2021-05-24T09:08:37","modified_gmt":"2021-05-24T13:08:37","slug":"data-shows-road-rage-on-the-rise","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/09\/data-shows-road-rage-on-the-rise\/","title":{"rendered":"Data shows road rage on the rise"},"content":{"rendered":"<p>According to statistics published by the National Highway Traffic Safety Administration, the number of car accident fatalities connected to aggressive driving is on a steep rise. The figure spiked almost 500% over the ten years between 2006 and 2015, from 80 fatalities to 467. Drivers in Ohio may already be aware of the increased prevalence of road rage, and there are things they can do to make motor vehicle travel safer.<\/p>\n<p>Drivers can begin by monitoring and minimizing their own levels of stress wherever possible. This might mean getting more sleep or reducing the number of pre-commute morning decisions by, for example, getting meals ready and setting out clothes for work the night before. Being courteous to other drivers can also help reduce the risk of <a href=\"https:\/\/edition.cnn.com\/2019\/09\/10\/health\/road-rage-survival-tips-wellness\/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">road rage<\/a>; giving the other driver the right of way can avoid anger issues according to a AAA director of safety advocacy and research.<\/p>\n<p>The AAA Foundation for Traffic Safety reported that almost 80% of drivers polled said they&#8217;d expressed serious anger at least once in the previous year. Of the respondents, 51% said they had tailgated another driver on purpose, 47% said they had yelled at other drivers, 45% said they had honked at other cars out of annoyance or anger and 33% said they had made obscene gestures to another driver. Twelve percent admitted to cutting off other drivers on purpose.<\/p>\n<p>Drivers who let their anger or frustration get the best of them on the road can cause serious car accidents, leading to injuries or fatalities. In cases where a person is injured due to the actions of another driver, he or she may have claims for damages to be paid by insurance companies or at-fault parties. <a href=\"\/auto-accident-injuries\/car-accidents\/\">Columbus, Ohio, auto accident injuries compensation attorneys<\/a> may be able to help in such cases by gathering evidence in support of the claims or negotiating with insurers on the client&#8217;s behalf.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to statistics published by the National Highway Traffic Safety Administration, the number of car accident fatalities connected to aggressive driving is on a steep rise. The figure spiked almost 500% over the ten years between 2006 and 2015, from 80 fatalities to 467. Drivers in Ohio may already be aware of the increased prevalence of road rage, and there&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46388"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46388"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46388\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46388"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46388"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46388"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}