{"id":46382,"date":"2019-09-04T00:00:00","date_gmt":"2019-09-04T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/09\/innovation-important-in-treatment-of-rare-cancers\/"},"modified":"2021-05-24T09:22:10","modified_gmt":"2021-05-24T13:22:10","slug":"innovation-important-in-treatment-of-rare-cancers","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/09\/innovation-important-in-treatment-of-rare-cancers\/","title":{"rendered":"Innovation important in treatment of rare cancers"},"content":{"rendered":"<p>Rare cancers present unique difficulties for medical professionals, but that does not mean they can&#8217;t be properly treated. Medical malpractice law holds doctors and other health care professionals in Ohio to a professional standard of care. With rare cancers, there may be an increased risk of misdiagnosis, limited treatment options and a limited number of specialists available. Most of the data about especially rare types of cancer comes from individual case studies because there are not enough patients for larger group studies or clinical trials.<\/p>\n<p>One growing trend in the treatment of rare cancers is to focus on the mutations that the cancers come from rather than the part of the body in which they originate. Several drugs have been approved to treat mismatch repair deficiency cancers in which the tumor has problems making repairs to itself once it has been damaged. A rare muscle tumor cancer, rhabdomyosarcoma, and a rare pancreatic cancer, acinar cell sarcoma, are both mismatch repair deficiency cancers as are a number of more prevalent prostate, colorectal, bladder and breast cancers.<\/p>\n<p>The <a href=\"https:\/\/www.curetoday.com\/publications\/cure\/2019\/rare-cancers-2019\/studying-rare-diseases-is-difficult-but-innovation-drives-results\" target=\"_blank\" rel=\"noopener noreferrer\">treatment of rare cancers<\/a> is also dependent on smaller biotech companies, which are more likely to develop niche drugs. The Food and Drug Administration provides incentives for pharmaceutical companies to develop drugs that are likely to be effective for smaller patient populations. Proper medical treatment of rare diseases in many cases requires a knowledge of uncommon drugs.<\/p>\n<p>People in California who have suffered initial misdiagnosis or other medical errors may be entitled to compensation. Damages may include pain and suffering, medical expenses and lost wages. A lawyer who practices medical malpractice law might be able to help injured parties by gathering medical evidence or interviewing witnesses to build a case for trial. <a href=\"\/medical-malpractice\/\">Columbus, Ohio, medical malpractice injury lawyers<\/a> might be able to secure expert testimony via deposition or negotiate settlement with at-fault parties and their malpractice insurance companies. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rare cancers present unique difficulties for medical professionals, but that does not mean they can&#8217;t be properly treated. Medical malpractice law holds doctors and other health care professionals in Ohio to a professional standard of care. With rare cancers, there may be an increased risk of misdiagnosis, limited treatment options and a limited number of specialists available. Most of the&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46382"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46382"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46382\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46382"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46382"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46382"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}