{"id":46400,"date":"2019-08-12T00:00:00","date_gmt":"2019-08-12T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/08\/medical-mistakes-can-be-dangerous-in-vasculitis-cases\/"},"modified":"2021-05-24T09:22:35","modified_gmt":"2021-05-24T13:22:35","slug":"medical-mistakes-can-be-dangerous-in-vasculitis-cases","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/08\/medical-mistakes-can-be-dangerous-in-vasculitis-cases\/","title":{"rendered":"Medical mistakes can be dangerous in vasculitis cases"},"content":{"rendered":"<p>When people in Ohio go to a doctor for their painful symptoms, they expect to receive a correct diagnosis. Vasculitis is one condition that can be dangerous. The inflammation of blood vessels can destroy arteries and veins, and the disorder can be painful and serious, leading to damage to the heart, lungs, kidneys and other major organs. Therefore, many physicians want to begin treatment as quickly as possible when vasculitis is diagnosed in order to prevent further damage. However, quick treatment can lead to major problems when a misdiagnosis is involved. <\/p>\n<p>Experts warn that there are other disorders that can be commonly mistaken for vasculitis due to certain common symptoms. However, the main treatment for vasculitis, beginning with high doses of corticosteroids, can make these other illnesses even more dangerous. For example, vasculitis can accompany cases of rheumatoid arthritis. However, the symptoms of endocarditis can also resemble many of the same symptoms. One patient was started on a steroids regime before all of her lab results were in. As a result of this <a href=\"https:\/\/www.healio.com\/rheumatology\/vasculitis-and-giant-cell-arteritis\/news\/online\/%7Bbcac47b3-3146-4f95-b937-f7de416ac423%7D\/high-suspicion-critical-to-avoid-misdiagnosis-of-vasculitis-mimics-treatment-errors\" target=\"_blank\" rel=\"noopener noreferrer\">misdiagnosis<\/a>, she suffered a stroke and permanent disabilities without receiving effective treatment for her actual disorder. <\/p>\n<p>There are a number of causes of vasculitis. It can develop along with some types of cancer, rheumatic diseases and auto-immune disorders and infections like varicella or hepatitis C. However, vasculitis can also result from some side effects of both prescribed and recreational drugs. The correct treatment can vary depending on the cause of the disorder, and the wrong treatment can be harmful. <\/p>\n<p>Medical errors can lead to seriously damaged health and lifelong disabilities. People who are suffering as a result of a doctor error can work with <a href=\"\/medical-malpractice\/\">Columbus, Ohio, medical malpractice injury lawyers<\/a> to pursue compensation for their pain and suffering, lost wages, medical bills and other damages. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>When people in Ohio go to a doctor for their painful symptoms, they expect to receive a correct diagnosis. Vasculitis is one condition that can be dangerous. The inflammation of blood vessels can destroy arteries and veins, and the disorder can be painful and serious, leading to damage to the heart, lungs, kidneys and other major organs. Therefore, many physicians&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46400"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46400"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46400\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46400"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46400"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46400"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}