{"id":46409,"date":"2019-08-20T00:00:00","date_gmt":"2019-08-20T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/08\/common-injuries-suffered-by-children-in-car-accidents\/"},"modified":"2021-05-24T09:09:21","modified_gmt":"2021-05-24T13:09:21","slug":"common-injuries-suffered-by-children-in-car-accidents","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/08\/common-injuries-suffered-by-children-in-car-accidents\/","title":{"rendered":"Common injuries suffered by children in car accidents"},"content":{"rendered":"<p>Children are not yet fully developed, and, therefore, they can be more vulnerable to serious injuries in a car accident. The National Highway Traffic Safety Administration (NHTSA) found that in 2015, over 178,000 children were injured and over 1,000 children died in car accidents across the United States. Seventy-three percent of children who are killed by cars are passengers in a vehicle.<\/p>\n<p>If your child has recently been injured in a car accident, it is, of course, important that you put your emotional energy toward ensuring that they make a full recovery. After they have been medically treated for their injuries, you may want to look into the possibility of seeking financial damages if you believe that another driver was at fault. The following are some of the most common injuries suffered by children in car accidents that result in a claim for damages.<\/p>\n<p><strong>Whiplash injuries<\/strong><\/p>\n<p>Whiplash is one of the most common types of injuries that result from car accidents. While whiplash can be a minor injury that simply causes a mild stiffness in the neck for a short amount of time, whiplash <a href=\"https:\/\/injury.findlaw.com\/car-accidents\/whiplash-related-injuries.html\" target=\"_blank\" rel=\"noopener noreferrer\">can also lead to serious issues<\/a>. Whiplash can potentially result in chronic pain, and it may even require surgery.<\/p>\n<p><strong>Other soft-tissue injuries<\/strong><\/p>\n<p>Car accidents can also commonly lead to other soft-tissue injuries for children. This may include damages to ligaments, muscle strains and bruises.<\/p>\n<p><strong>Head and back injuries<\/strong><\/p>\n<p>Head and back injuries can be extremely serious for any person involved in a car accident, but they are particularly troublesome for children. Damage to the spinal cord can occur, which can affect an injured person&#8217;s ability to move their limbs. Concussions and traumatic brain injuries can, unfortunately, lead to life-long cognitive issues, especially when the brain is damaged while it is still developing.<\/p>\n<p><strong>Taking action to gain back damages<\/strong><\/p>\n<p>No child ever deserves to suffer in a car accident. This is why it is so important for action to be taken so that the responsible person can be held to justice. If you are successful in claiming damages in Ohio, you may be <a href=\"\/catastrophic-injuries-fatalities\/\">able to gain compensation<\/a> for medical bills as well as for the pain and suffering that the accident caused you and your child.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Children are not yet fully developed, and, therefore, they can be more vulnerable to serious injuries in a car accident. The National Highway Traffic Safety Administration (NHTSA) found that in 2015, over 178,000 children were injured and over 1,000 children died in car accidents across the United States. Seventy-three percent of children who are killed by cars are passengers in&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46409"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46409"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46409\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46409"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46409"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46409"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}