{"id":46415,"date":"2019-07-09T00:00:00","date_gmt":"2019-07-09T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/07\/your-baby-may-be-suffering-due-to-midwife-negligence\/"},"modified":"2021-05-06T15:12:51","modified_gmt":"2021-05-06T20:12:51","slug":"your-baby-may-be-suffering-due-to-midwife-negligence","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/07\/your-baby-may-be-suffering-due-to-midwife-negligence\/","title":{"rendered":"Your baby may be suffering due to midwife negligence"},"content":{"rendered":"<p>As a new mother, you will want to protect your child from harm at all costs. If you have already noticed that your baby is not developing or progressing as they should, you will want to know why, so that their issues can be dealt with as quickly as possible. One of the most common causes of delayed physical and mental development among young children is, sadly, preventable birth injuries.<\/p>\n<p>Birth injuries count as any type of injury that occurs during the process of delivering a child. In most cases of birth injuries, the baby was completely healthy in the womb. Complications arising during delivery can cause the child to suffer from life-altering injuries, and, in many cases, these situations occur due to midwife negligence. It is important that you understand the common reasons why birth injuries occur, and how midwife negligence can play a role.<\/p>\n<p><strong>The most common types of birth injuries<\/strong><\/p>\n<p>Long labors carry a high risk of complications. This is why medical professionals often opt to carry out a Caesarean section when the labor is taking too long. Labors over 18 hours can cause pressure on the child&#8217;s brain and can cause their blood pressure to become too high.<\/p>\n<p>Oxygen deprivation is another risk factor for babies. If infants are being deprived of oxygen during the labor, they may suffer from learning difficulties for the rest of their lives.<\/p>\n<p>The way that medical professionals react to emergencies and complications is key to birth injury prevention. Sadly, sometimes poor decisions are made that are in favor of convenience rather than the safety of the mother and child. These cases are often taken to court, and, when successful, damages can be claimed.<\/p>\n<p><strong>Recognizing midwife negligence<\/strong><\/p>\n<p>If you believe that the way your midwife acted during your labor led to birth injuries, you may be able to take legal action. If you can show that your midwife <a href=\"https:\/\/injury.findlaw.com\/medical-malpractice\/birth-injury-faq.html\" target=\"_blank\" rel=\"noopener noreferrer\">acted without your best interests in mind<\/a>, and if you can show that their behavior led to damages, you have a good chance of being successful.<\/p>\n<p>It is important that you do not tolerate <a href=\"\/medical-malpractice\/birth-injuries\/\">unprofessional behavior by medical providers<\/a>. By taking action to assert your rights, you may be preventing others from suffering in the same way.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As a new mother, you will want to protect your child from harm at all costs. If you have already noticed that your baby is not developing or progressing as they should, you will want to know why, so that their issues can be dealt with as quickly as possible. One of the most common causes of delayed physical and&hellip;<\/p>\n","protected":false},"author":696,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[23],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46415"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/696"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46415"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46415\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46415"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46415"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46415"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}