{"id":46427,"date":"2019-07-19T00:00:00","date_gmt":"2019-07-19T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/07\/diagnostic-errors-behind-one-third-of-fatal-malpractice-cases\/"},"modified":"2021-05-24T09:23:00","modified_gmt":"2021-05-24T13:23:00","slug":"diagnostic-errors-behind-one-third-of-fatal-malpractice-cases","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/07\/diagnostic-errors-behind-one-third-of-fatal-malpractice-cases\/","title":{"rendered":"Diagnostic errors behind one third of fatal malpractice cases"},"content":{"rendered":"<p>Some 12 million people in Ohio and across the U.S. suffer as a result of a diagnostic error in a primary care setting. Now, researchers at the Johns Hopkins University School of Medicine have found that misdiagnoses and delayed diagnoses are behind one in three malpractice claims involving a serious disability or death. Therefore, they are the leading reason behind serious medical errors.<\/p>\n<p>For their study, researchers analyzed 55,000 malpractice claims in the national Comparative Benchmarking System. The majority (74.1%) of those involving a serious diagnostic error were linked to one of three major conditions: <a href=\"https:\/\/www.fiercehealthcare.com\/hospitals-health-systems\/jhu-1-3-misdiagnoses-results-serious-injury-or-death\" target=\"_blank\" rel=\"noopener noreferrer\">cancer, vascular events and infection<\/a>.<\/p>\n<p>Specifically, the most commonly misdiagnosed conditions were lung cancer, stroke and sepsis. In emergency departments and inpatient settings, there were more severe cases of vascular events and infections being misdiagnosed. In non-ED settings, researchers found more cases of cancer misdiagnoses with serious consequences.<\/p>\n<p>Failures in clinical judgment accounted for 85% of these inaccurate diagnoses. General care physicians were implicated in over half of the cases. Surgeons, diagnostic service providers and medical specialists almost evenly split the responsibility for the remaining cases. Researchers are hopeful that knowing what conditions frequently lead to severe cases of misdiagnosis will facilitate system-wide improvements.<\/p>\n<p>An individual who has been injured because their condition was misdiagnosed or diagnosed too late may want to seek compensation for their medical expenses, lost wages and other losses. This is where a <a href=\"\/medical-malpractice\/\">medical malpractice injury lawyer<\/a> may come in handy. Many personal injury lawyers have a network of third parties, including medical professionals and investigators, who can assist with cases. Lawyers, for their part, may handle negotiations if the other side is willing to settle out of court. As a last resort, they may litigate.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Some 12 million people in Ohio and across the U.S. suffer as a result of a diagnostic error in a primary care setting. Now, researchers at the Johns Hopkins University School of Medicine have found that misdiagnoses and delayed diagnoses are behind one in three malpractice claims involving a serious disability or death. Therefore, they are the leading reason behind&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46427"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46427"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46427\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46427"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46427"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46427"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}