{"id":46433,"date":"2019-06-22T00:00:00","date_gmt":"2019-06-22T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/06\/your-childs-broken-bone-from-a-crash-can-cause-lasting-issues\/"},"modified":"2021-05-24T09:09:58","modified_gmt":"2021-05-24T13:09:58","slug":"your-childs-broken-bone-from-a-crash-can-cause-lasting-issues","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/06\/your-childs-broken-bone-from-a-crash-can-cause-lasting-issues\/","title":{"rendered":"Your child&#8217;s broken bone from a crash can cause lasting issues"},"content":{"rendered":"<p>Thousands of people in Ohio get into car crashes each year. The majority of those collisions involve mild or moderate injuries to the people in the vehicles. Usually, those injuries only require short-term medical care. Other times, the consequences of injuries from crashes can be more profound and lasting.<\/p>\n<p>An injury that may initially seem relatively minor can prove to be more serious than you might expect. Sometimes, this is because of delayed onset symptoms, which are common with conditions like traumatic brain injuries. Other times, an injury that seems simple to treat can have more lasting consequences than the average injury of that type.<\/p>\n<p>Broken bones are a perfect example of this phenomenon. Although the majority of broken bones can easily get set by a doctor, allowing for the body to heal itself, that doesn&#8217;t always work. There are circumstances in which broken bones can become a more serious and persistent medical issue. That is of particular concern when young children fracture bones <a href=\"\/auto-accident-injuries\/car-accidents\/\">during car crashes<\/a>.<\/p>\n<p><strong>Young children and even teenagers still need to grow<\/strong><\/p>\n<p>It takes quite some time for the human body to go through childhood and adolescence into maturity. In part, this is because of how complicated human neurology is. This slow growth process means that the human body continues to grow and develop for roughly two decades after birth. Part of how the body grows is through the actions of specialized tissue known as growth plates.<\/p>\n<p><a href=\"https:\/\/www.mayoclinic.org\/diseases-conditions\/growth-plate-fractures\/symptoms-causes\/syc-20351979\" target=\"_blank\" rel=\"noopener noreferrer\">Growth plate tissue<\/a> on the ends of bones play a critical role in the anatomical process of maturation and development. When a child or teenager breaks a bone, it can cause damage to the growth plate. That, in turn, can cause developmental problems, such as irregular growth or a complete cessation of growth.<\/p>\n<p>There is medical treatment available to help children who have damaged growth plates, but, typically, it will require expensive and ongoing medical intervention as your child gets older. Paying for that care could be more difficult than you think.<\/p>\n<p><strong>Growth plate injuries probably require significant medical care<\/strong><\/p>\n<p>With the right resources, your child can still have a fully functional and healthy adulthood after a growth plate injury as a child or teenager. However, you will need to commit to ongoing care, which can prove to be time-consuming and expensive.<\/p>\n<p>Your private health insurance or government insurance like Medicaid may not cover the care of your child&#8217;s needs because of the injury resulting from a car crash. Your family shouldn&#8217;t need to absorb the expenses caused by a negligent driver. Sitting down to talk with an attorney who understands Ohio civil litigation can help you plan for ways to get the compensation your family needs.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Thousands of people in Ohio get into car crashes each year. The majority of those collisions involve mild or moderate injuries to the people in the vehicles. Usually, those injuries only require short-term medical care. Other times, the consequences of injuries from crashes can be more profound and lasting. An injury that may initially seem relatively minor can prove to&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46433"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46433"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46433\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46433"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46433"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46433"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}