{"id":46442,"date":"2019-06-07T00:00:00","date_gmt":"2019-06-07T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/06\/is-an-opioid-overdose-case-medical-malpractice-or-wrongful-death\/"},"modified":"2021-05-06T15:14:57","modified_gmt":"2021-05-06T20:14:57","slug":"is-an-opioid-overdose-case-medical-malpractice-or-wrongful-death","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/06\/is-an-opioid-overdose-case-medical-malpractice-or-wrongful-death\/","title":{"rendered":"Is an opioid overdose case medical malpractice or wrongful death?"},"content":{"rendered":"<p>Many people feel surprised when they learn that their loved one had an opioid addiction. Most people who struggle with an addiction take great pains to hide it from the people whom they love the most. That can leave you with more questions than answers after the unexpected and tragic loss of someone you love due to an opioid overdose.<\/p>\n<p>In that scenario, you may find yourself wanting to take legal action against the people involved in supplying your loved one with deadly drugs. You may find yourself wondering whether the best strategy involves filing a medical malpractice lawsuit against a doctor or perhaps seeking <a href=\"\/blog\/2017\/09\/how-to-deal-with-the-wrongful-death-of-a-loved-one\/\">compensation for a wrongful death<\/a>.<\/p>\n<p>The truth is that the circumstances of the Ohio accidental overdose and how your loved one obtained the medication will play a role in what legal action you can take.<\/p>\n<p><strong>Was the medicine prescribed directly to your loved one by a doctor?<\/strong><\/p>\n<p>The first and most important question you need to answer is whether your loved one had opioid medication prescribed to them by a doctor or whether they were buying it illegally from a third party, such as a drug dealer.<\/p>\n<p>If a doctor was the one who provided the prescription, you should then look at the circumstances under which the prescription was provided. Did your loved one have a history of seeking medication? Was the prescription the result of an accident or surgery? How many pills did the doctor distribute at once?<\/p>\n<p>That last question, as well as how many refills a doctor authorizes and how often they follow up with the patient, can play a major role in whether there was medical malpractice or negligence involved in an overdose.<\/p>\n<p><strong>Illegal pill sales may lead to a wrongful death case<\/strong><\/p>\n<p>When people have too many pills that they don&#8217;t need, they might sell them to other people. In fact, some people go so far as to intentionally steal medication from others in order to sell it illegally to third parties. If you can find who sold the medication to your loved one, you may be able to pursue a wrongful death lawsuit against them.<\/p>\n<p><a href=\"http:\/\/codes.ohio.gov\/orc\/2125\" target=\"_blank\" rel=\"noopener noreferrer\">Under Ohio law<\/a>, a wrongful death involves negligence or a wrongful act. The illegal sale of narcotic pain medication certainly qualifies as a wrongful act. In other words, you likely have grounds for a civil suit even if law enforcement never prosecuted the person who supplied your loved one.<\/p>\n<p>It can be hard to decide what your next step should be after the sudden and tragic overdose death of a loved one. You should explore all of your options by sitting down with an experienced Ohio personal injury attorney. They can guide you toward holding the right people accountable for the tragedy your family has experienced.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many people feel surprised when they learn that their loved one had an opioid addiction. Most people who struggle with an addiction take great pains to hide it from the people whom they love the most. That can leave you with more questions than answers after the unexpected and tragic loss of someone you love due to an opioid overdose.&hellip;<\/p>\n","protected":false},"author":696,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31,38],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46442"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/696"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46442"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46442\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46442"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46442"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46442"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}