{"id":46457,"date":"2019-05-23T00:00:00","date_gmt":"2019-05-23T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/05\/spinal-cord-injuries-can-produce-serious-life-changes\/"},"modified":"2021-05-06T15:15:35","modified_gmt":"2021-05-06T20:15:35","slug":"spinal-cord-injuries-can-produce-serious-life-changes","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/05\/spinal-cord-injuries-can-produce-serious-life-changes\/","title":{"rendered":"Spinal cord injuries can produce serious life changes"},"content":{"rendered":"<p>Being in a car wreck, especially one that occurs at high speeds or that involves a semitruck, can lead to devastating injuries. The violent impact of these crashes can damage the spinal cord, which may cause life-threatening effects.<\/p>\n<p>Unfortunately, a <a href=\"https:\/\/www.christopherreeve.org\/living-with-paralysis\/health\/causes-of-paralysis\/spinal-cord-injury\" target=\"_blank\" rel=\"noopener noreferrer\">spinal cord injury<\/a> isn&#8217;t one that you can always heal from. There are a lot of factors that go into whether recovery is possible. It is imperative that each patient learns about the factors in their case so they can make informed decisions about necessary care.<\/p>\n<p><strong>Injury location <\/strong><\/p>\n<p>The location of the injury has a significant impact on what parts of the body are affected. The areas that are affected are always lower than the location of the injury. This means that an injury to the neck can affect the upper limbs, lower limbs and abdomen. An injury to the lower back wouldn&#8217;t impact the upper limbs, but it would affect the lower limbs.<\/p>\n<p>Injuries to the neck are particularly problematic. When the injury is at the C3 level or higher, there is a chance that the person will be dependent upon a ventilator. They won&#8217;t be able to use their arms or legs, so mobility can be a concern.<\/p>\n<p><strong>Severity of the injury<\/strong><\/p>\n<p>The severity of a spinal cord injury is classified into two types – complete and incomplete. In a complete injury, the person has no feeling in the area below the injury. They also don&#8217;t have any function in it. In an incomplete injury, they have limited sensation or function.<\/p>\n<p>Typically, incomplete injuries are associated with greater recovery than complete injuries. It can take a lot of time for progress to be made; however, patients usually start to see limited progress in the initial days and weeks after the accident as inflammation begins to abate.<\/p>\n<p><strong>Life after the injury<\/strong><\/p>\n<p>A <a href=\"\/catastrophic-injuries-fatalities\/spinal-cord-injuries\/\">patient who has a spinal cord injury<\/a> that produces life-long results will need a lot of care and other assistance in the future. This can be costly, so they have to think about ways to minimize those expenses. For some, the answer is to file a personal injury claim that allows them to seek compensation from the driver in Ohio who struck them. They will have to estimate an appropriate sum for damages. They need to be able to cover past medical bills and future ones, so determining the amount to seek can be complex.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Being in a car wreck, especially one that occurs at high speeds or that involves a semitruck, can lead to devastating injuries. The violent impact of these crashes can damage the spinal cord, which may cause life-threatening effects. Unfortunately, a spinal cord injury isn&#8217;t one that you can always heal from. There are a lot of factors that go into&hellip;<\/p>\n","protected":false},"author":696,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[23],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46457"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/696"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46457"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46457\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46457"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46457"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46457"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}