{"id":46469,"date":"2019-05-08T00:00:00","date_gmt":"2019-05-08T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/05\/doctors-can-make-serious-mistakes-with-prescription-medicine\/"},"modified":"2021-05-24T09:24:18","modified_gmt":"2021-05-24T13:24:18","slug":"doctors-can-make-serious-mistakes-with-prescription-medicine","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/05\/doctors-can-make-serious-mistakes-with-prescription-medicine\/","title":{"rendered":"Doctors can make serious mistakes with prescription medicine"},"content":{"rendered":"<p>There are a plethora of options for medications that can treat just about every physical condition patients suffer from in the United States. Modern patients are very lucky to have access to advancements made in medications and treatments that can improve their chance of recovery from a serious medical condition and their overall quality of life.<\/p>\n<p>However, prescription medications don&#8217;t work miracles. They can cause reactions in some patients. They can also interact with other compounds in a dangerous way. You probably trust your doctor when they recommend a medication as part of the treatment. Unfortunately, doctors can and do make mistakes about what is best for the people in their care.<\/p>\n<p>Prescribing or administering the wrong medication, as well as failing to properly monitor a patient taking a new drug, could cause serious issues for the patient.<\/p>\n<p><strong>Doctors may overlook risk factors for a drug<\/strong><\/p>\n<p>There are many risk factors that can impact how well a medication works for a given patient and how safe it is for that person to take. Everything from a family history of certain diseases to allergies or supplements the patient takes could affect how their body responds to the medication and how effective the treatment is.<\/p>\n<p>Unfortunately, most doctors feel pressed for time. They often rush through interactions with patients. In fact, they may <a href=\"https:\/\/www.forbes.com\/sites\/brucelee\/2018\/07\/22\/how-long-you-can-talk-before-your-doctor-interrupts-you\/#25fa57251443\" target=\"_blank\" rel=\"noopener noreferrer\">not even really listen to you<\/a> when you try to explain your experience. Failing to listen as you try to give them information or not properly checking your <a href=\"\/blog\/2018\/12\/why-medical-record-errors-occur-and-why-they-may-not-be-remedied\/\">chart or digital records<\/a> could mean prescribing a drug that interacts with your existing medication regimen.<\/p>\n<p>That could put you at risk, particularly if they dispense medication on-site instead of sending you to a third-party pharmacist that will likely ask you about any other medication you take.<\/p>\n<p><strong>Proper monitoring is critical in the first days of taking a drug<\/strong><\/p>\n<p>There are rigorous testing processes in place to protect consumers from injuries that might result from prescription medications. However, every person&#8217;s body is unique and may respond differently to a drug than most other people.<\/p>\n<p>Because doctors have no way of knowing how your body will handle a drug, it is very important that they properly monitor you. Doctors should follow up with you as you take the medication to ensure it works as they intended. Careful monitoring can also catch signs of an allergic reaction or other medical problem that could result from certain drugs.<\/p>\n<p><strong>Doctors that fail to take prescription drugs seriously do their patients a disservice<\/strong><\/p>\n<p>Medications, even those that are trusted and commonly used, are not miracle panaceas that work the same way for every situation. Doctors should make every effort to ensure that a drug is safe and fulfilling its intended purpose for a patient.<\/p>\n<p>If your doctor made a mistake while prescribing or administering a drug to you, you may have rights and options under Ohio medical malpractice laws. Sitting down with an attorney is often a good first step after you get injured by a prescription medication.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are a plethora of options for medications that can treat just about every physical condition patients suffer from in the United States. Modern patients are very lucky to have access to advancements made in medications and treatments that can improve their chance of recovery from a serious medical condition and their overall quality of life. However, prescription medications don&#8217;t&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46469"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46469"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46469\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46469"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46469"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46469"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}