{"id":46460,"date":"2019-05-28T00:00:00","date_gmt":"2019-05-28T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/05\/research-seeks-to-reduce-prescription-errors\/"},"modified":"2021-05-24T09:23:51","modified_gmt":"2021-05-24T13:23:51","slug":"research-seeks-to-reduce-prescription-errors","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/05\/research-seeks-to-reduce-prescription-errors\/","title":{"rendered":"Research seeks to reduce prescription errors"},"content":{"rendered":"<p>When patients go to an Ohio hospital or visit the doctor, they may expect to receive relief from the conditions that have been troubling them. However, medication errors pose a serious threat to patient safety. They are also some of the most common types of medical errors experienced by patients. However, the creation of a standard training regimen could help to reduce these types of prescription errors and the side effects that can follow. <\/p>\n<p>According to research conducted by physician assistant students with the University of Kentucky Markey Cancer Center, patient medication interviews can help to standardize the information available about the type of medicines taken by patients. Researchers also noted that technicians who deal with medical records do not necessarily receive training on reconciling lists of medications. They may also be unsure of how to handle patient medications in electronic medical records. In many cases, patients do not recall the names or dosages of their prescribed medicines, so the accuracy of these records can be particularly important to avoid <a href=\"https:\/\/www.clinicaladvisor.com\/home\/meeting-coverage\/aapa-2019-annual-meeting\/medication-reconciliation-training-improves-medication-list-accuracy\/\" target=\"_blank\" rel=\"noopener noreferrer\">medical mistakes<\/a>. <\/p>\n<p>After studying different types of patient interviews, researchers noted that a number of technicians did not ask patients at all about their medications or changes in the recent period. The researchers urged that all patient visits be accompanied by a thorough medication review by a technician. This would include an interview about each medication, including how long the patient has been taking it and any changes in the dosage. They also encouraged further study to determine whether these interviews reduced prescription errors. <\/p>\n<p>Prescription medications can carry serious side effects as well as severe interactions with other drugs. Patients may suffer severe, long-term harm as a result of a doctor error or an incorrect prescription. An attorney could help a possible victim of medical malpractice determine whether they could <a href=\"\/medical-malpractice\/\">pursue compensation<\/a> for their damages. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>When patients go to an Ohio hospital or visit the doctor, they may expect to receive relief from the conditions that have been troubling them. However, medication errors pose a serious threat to patient safety. They are also some of the most common types of medical errors experienced by patients. However, the creation of a standard training regimen could help&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46460"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46460"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46460\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46460"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46460"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46460"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}