{"id":46502,"date":"2019-03-07T00:00:00","date_gmt":"2019-03-07T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/03\/broken-bones-in-young-children-can-do-more-damage-than-you-think\/"},"modified":"2021-05-06T15:19:34","modified_gmt":"2021-05-06T20:19:34","slug":"broken-bones-in-young-children-can-do-more-damage-than-you-think","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/03\/broken-bones-in-young-children-can-do-more-damage-than-you-think\/","title":{"rendered":"Broken bones in young children can do more damage than you think"},"content":{"rendered":"<p>Modern medicine is exceptionally good at treating traumatic injuries. Everything from bullet holes to broken bones can now receive much better care than in centuries or even decades past. Because of how much improvement there has been in trauma care, far too many people tend to have a flippant attitude toward fractures.<\/p>\n<p>Fracture is a more technical term for a broken bone. There are many kinds of fractures, and some of them are more serious than others. While children tend to heal quickly, broken bones are a unique kind of injury in small children. They can actually cause significant issues that persist for a long time.<\/p>\n<p>Any parent whose child wound up with a broken bone should monitor the situation closely and take steps to ensure that their child receives the care they need to completely heal.<\/p>\n<p><strong>Compound fractures can require surgery and intensive care<\/strong><\/p>\n<p>A simple fracture is what most people think of when they imagine a broken bone. It involves a clean break to the bone, which snaps into two pieces. Doctors can then align the broken parts of the bone, place the limb or extremity in a cast and allow the body to heal itself.<\/p>\n<p>Many broken bones are actually far more complicated than a simple fracture. The bone may break in multiple places, making it difficult or impossible to set without surgical intervention. In some cases, the bone can break so severely that parts of it get destroyed.<\/p>\n<p>Medical care such as reinforcement via metal rods implanted in the broken bone may be necessary. Patients who are young when this happens will likely require a number of reparative surgeries over the years as their body continues to grow and develop.<\/p>\n<p><strong>Broken bones in children can also impact the growth plate<\/strong><\/p>\n<p>The reason that children keep on growing is that they have growth plates in the bones that tell the body it isn&#8217;t yet at its full potential. When a child experiences a compound fracture, or even a simple fracture, the end result could be <a href=\"https:\/\/www.mayoclinic.org\/diseases-conditions\/growth-plate-fractures\/symptoms-causes\/syc-20351979\" target=\"_blank\" rel=\"noopener noreferrer\">damage to the growth plate<\/a>.This can have a long-term impact on how well the child&#8217;s body continues to develop.<\/p>\n<p>Extreme medical intervention may be necessary, especially if the child is an infant or very young when the growth plate winds up damaged. The medical care involved in such treatment is clearly going to be prohibitively expensive for many families.<\/p>\n<p>If your child was injured on someone else&#8217;s property or as a result of a <a href=\"\/auto-accident-injuries\/\">catastrophic accident in a motor vehicle,<\/a> you may be in an actionable position. Consult with an experienced personal injury attorney who can help you determine if you have the right to seek compensation for your child&#8217;s injuries.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Modern medicine is exceptionally good at treating traumatic injuries. Everything from bullet holes to broken bones can now receive much better care than in centuries or even decades past. Because of how much improvement there has been in trauma care, far too many people tend to have a flippant attitude toward fractures. Fracture is a more technical term for a&hellip;<\/p>\n","protected":false},"author":696,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[23],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46502"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/696"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46502"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46502\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46502"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46502"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46502"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}