{"id":46511,"date":"2019-02-05T00:00:00","date_gmt":"2019-02-05T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/02\/when-is-birth-trauma-a-type-of-medical-malpractice\/"},"modified":"2021-03-26T14:03:22","modified_gmt":"2021-03-26T19:03:22","slug":"when-is-birth-trauma-a-type-of-medical-malpractice","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/02\/when-is-birth-trauma-a-type-of-medical-malpractice\/","title":{"rendered":"When is birth trauma a type of medical malpractice?"},"content":{"rendered":"<p>Most births in the United States are routine procedures, where both the child and mother are healthy without experiencing complications. However, some situations increase the likelihood of a traumatic birth. A traumatic birth can lead to injuries to the baby. The baby may experience broken bones, bruising or swelling of the scalp. Oxygen deprivation, in particular, can lead to very severe issues for the infant, and can cause seizures, blindness or learning difficulties.<\/p>\n<p>If your child has suffered as a result of birth trauma in Ohio, you may have reason to believe that the complications occurred due to medical negligence. If this is the case, you may be able to take action and make a successful legal claim against the hospital or the medical professional.<\/p>\n<p><strong>What are common instances of medical negligence relating to birth injuries?<\/strong><\/p>\n<p>The actions of a medical professional in response to a birth complication can unnecessarily lead to a birth trauma, and this usually constitutes medical negligence. For example, if a baby has an abnormality detected by a medical professional but this information is not passed on to the mother or to the appropriate doctors, the birth may be carried out without complete information, and complications can arise.<\/p>\n<p>Additionally, a poorly performed hysterectomy can lead to an unintended pregnancy with complications. If medical malpractice was the cause of the unsuccessful hysterectomy, action can be taken against the surgeon who performed it.<\/p>\n<p>Another common cause of birth trauma is the <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4460260\/\" target=\"_blank\" rel=\"noopener noreferrer\">failure to schedule or perform<\/a> a cesarean section. A cesarean section is one of the most successful ways of avoiding potential birth complications that arise from issues such as the baby being in the breach position. If a doctor does not schedule a cesarean section and complications arise that lead to preventable birth trauma, you may be able to hold the doctor liable.<\/p>\n<p>It is important that you understand the way in which decisions were made when you were giving birth to your child, and how the complications could have been prevented. You should take action to <a href=\"\/medical-malpractice\/\">learn more about medical malpractice<\/a> if you believe it was present when you were giving birth.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Most births in the United States are routine procedures, where both the child and mother are healthy without experiencing complications. However, some situations increase the likelihood of a traumatic birth. A traumatic birth can lead to injuries to the baby. The baby may experience broken bones, bruising or swelling of the scalp. Oxygen deprivation, in particular, can lead to very&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46511"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46511"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46511\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46511"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46511"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46511"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}