{"id":46535,"date":"2019-01-31T00:00:00","date_gmt":"2019-01-31T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/01\/study-finds-stress-causes-mistakes-in-operating-room\/"},"modified":"2021-05-24T09:25:37","modified_gmt":"2021-05-24T13:25:37","slug":"study-finds-stress-causes-mistakes-in-operating-room","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/01\/study-finds-stress-causes-mistakes-in-operating-room\/","title":{"rendered":"Study finds stress causes mistakes in operating room"},"content":{"rendered":"<p>Ohio surgeons might be more likely to make mistakes in the operating room if they are under stress. A study from Columbia University found that 66 percent more errors were made by surgeons who showed signs of short-term stress.<\/p>\n<p>One researcher measured a surgeon&#8217;s stress by having him wear a shirt designed to gather physiological information on athletes during workouts. The researcher was able to gauge the <a href=\"https:\/\/www.healthcarefinancenews.com\/news\/surgeons-under-stress-make-more-mistakes-operating-room-study-finds\" target=\"_blank\" rel=\"noopener noreferrer\">electrical impulses<\/a> that cause heartbeats, calculate time between heartbeats and determine whether the surgeon was stressed at any given moment. The researcher also recorded the surgery on video, and information on the surgeon&#8217;s heart was synced with the video to determine the relationship between the stressful incident and the mistake observed. Examples of incidents that induced short-term stress were negative thoughts or loud noises. The result could be mistakes that resulted in burns, bleeding or tissue damage.<\/p>\n<p>The researcher reported surprise at how many distractions were in the operating room. These included alarms on machines, conversations or people entering the room. An estimated 250,000-440,000 deaths occur each year because of medical errors, and reducing stress and distraction in the operating room could bring those numbers down.<\/p>\n<p>While major surgical errors such as wrong-site surgery or leaving instruments behind in patients often get the most attention, there are many other types of medical errors that may occur. For example, giving a person the wrong dosage or the wrong medication is not uncommon. Mistakes like these could result in a serious setback for a person&#8217;s recovery even when they are not fatal. Patients who believe they have suffered medical malpractice might want to consult <a href=\"\/medical-malpractice\/\">Columbus, Ohio medical malpractice injury lawyers<\/a>. The patient may be eligible for compensation if the error is the result of malpractice. There might be an out-of-court settlement, or the case might go to trial.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ohio surgeons might be more likely to make mistakes in the operating room if they are under stress. A study from Columbia University found that 66 percent more errors were made by surgeons who showed signs of short-term stress. One researcher measured a surgeon&#8217;s stress by having him wear a shirt designed to gather physiological information on athletes during workouts.&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46535"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46535"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46535\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46535"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46535"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46535"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}