{"id":46544,"date":"2019-01-08T00:00:00","date_gmt":"2019-01-08T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2019\/01\/5-steps-after-a-car-accident\/"},"modified":"2021-03-26T14:04:51","modified_gmt":"2021-03-26T19:04:51","slug":"5-steps-after-a-car-accident","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2019\/01\/5-steps-after-a-car-accident\/","title":{"rendered":"5 steps after a car accident"},"content":{"rendered":"<p>Imagine a semitruck slams into the back of your compact Honda while you are stopped at a red light. Even though your vehicle bounces forward into the intersection, you are lucky to survive the collision without any life-threatening injuries. However, you do need to go to the hospital for a strained neck and a broken wrist.<\/p>\n<p>Since the accident was the fault of the semitruck driver, you probably have a viable claim for damages you can make in court. To preserve your legal rights, and increase the chances of success in your personal injury action, it&#8217;s important that you follow these <a href=\"https:\/\/injury.findlaw.com\/car-accidents\/after-a-car-accident-first-steps.html\" target=\"_blank\" rel=\"noopener noreferrer\">five steps immediately after the crash<\/a>:<\/p>\n<p><strong>Remain at the crash site:<\/strong> It&#8217;s illegal to leave the scene of a serious car accident. Not only that, but you will want to ensure that police arrive to document what happened in the crash and make a fault determination. The information in the police report may help to support your personal injury case.<\/p>\n<p><strong>Make sure everyone is okay:<\/strong> Check yourself for injuries, check your passengers and check the other drivers, passengers and anyone else involved in the collision. If you&#8217;re able, tend to them in any way you can. If someone is unconscious or is complaining of serious back or neck pain, let the paramedics take care of moving him or her &#8212; unless some hazard is putting the person&#8217;s life in jeopardy.<\/p>\n<p><strong>Call 911:<\/strong> Call for emergency assistance if people are seriously hurt. Otherwise, simply contact the police and wait at the scene until they arrive. Write down the name and badge numbers of all the officers who come to investigate the crash.<\/p>\n<p><strong>Trade information: <\/strong>Get the names and contact information of everyone who was involved in or witnessed the accident and ask to look at their IDs. Also, collect the license plate numbers and insurance information for any drivers.<\/p>\n<p><strong>Take copious notes and pictures:<\/strong> Ask witnesses and others what they saw in the crash and take notes on what they say, as well as recording their contact information. Take pictures of the crash site, your injuries and the vehicles.<\/p>\n<p>Of course, if you&#8217;re seriously hurt, you might not be able to do any of these things after an auto collision. Your first priority is to get the medical care you need, then tend to the rest. Once you&#8217;re feeling better, you may want to begin the process of reviewing whether you can <a href=\"\/auto-accident-injuries\/\">pursue financial damages in court after your car crash<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Imagine a semitruck slams into the back of your compact Honda while you are stopped at a red light. Even though your vehicle bounces forward into the intersection, you are lucky to survive the collision without any life-threatening injuries. However, you do need to go to the hospital for a strained neck and a broken wrist. Since the accident was&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46544"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46544"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46544\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46544"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46544"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46544"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}