{"id":46759,"date":"2018-11-08T00:00:00","date_gmt":"2018-11-08T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/11\/motor-vehicle-collisions-remain-a-leading-cause-of-child-death\/"},"modified":"2021-03-26T14:08:35","modified_gmt":"2021-03-26T19:08:35","slug":"motor-vehicle-collisions-remain-a-leading-cause-of-child-death","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/11\/motor-vehicle-collisions-remain-a-leading-cause-of-child-death\/","title":{"rendered":"Motor vehicle collisions remain a leading cause of child death"},"content":{"rendered":"<p>As a loving parent, you probably do everything you can to give your children a safe environment and the skills and resources they need for a healthy and happy future. Unfortunately, no matter how much you love your children, it is impossible to completely shield them from the dangers of the world.<\/p>\n<p>Riding in a vehicle is a perfect example. The average American takes several car trips every day, usually arriving at the intended destination without issue. However, for a tiny fraction of individuals, the daily commute can end in tragedy.<\/p>\n<p>Children are particularly susceptible to injuries in motor vehicle collisions. In fact, car crashes remain <a href=\"https:\/\/www.cdc.gov\/injury\/images\/lc-charts\/leading_causes_of_death_age_group_2016_1056w814h.gif\" target=\"_blank\" rel=\"noopener noreferrer\">one of the top causes of death<\/a> for children under the age of 18.<\/p>\n<p><strong>Focus on safety when your kids are in the car<\/strong><\/p>\n<p>Once your children reach a certain age, they likely have strong opinions about where they sit in the vehicle and how they entertain themselves during your travels. You must be careful, as a parent, not to let your desire to minimize the stress of travel to create a dangerous situation for your family. Your children must absolutely be in appropriate restraints.<\/p>\n<p>Infants and newborns should be in specialized car seats, and older children should be in booster seats. Until your child is either 12 years old or 4&#8217;9&#8243; tall, they must remain in the boosters.<\/p>\n<p>No matter how annoyed your child may be with the booster seat, that annoyance is infinitely preferable to serious injuries or death due to a child bring improperly restrained in the back seat of the vehicle.<\/p>\n<p><strong>When another driver endangers your family, you can hold them accountable<\/strong><\/p>\n<p>One of the most frightening realizations any driver can have is that their own safety is dependent on the behaviors of other people on the road. Far too many drivers make questionable decisions before they get behind the wheel. Whether it is choosing to drive exhausted or after having a few beers, the decision impacts everyone who shares the road with that individual.<\/p>\n<p>If your children suffered injuries or died as a result of a car crash caused by another driver, you may have the legal right to hold that individual accountable for the losses they have caused you. Injuries to children are often very expensive, as a trauma as simple as a broken bone can impact development and health for many years.<\/p>\n<p>Your family should not have to bear a financial burden because someone else made a terrible decision. If you wonder about your right to collect compensation after a crash that hurt your children, it may be time to talk with someone who has more understanding of the Ohio personal injury and wrongful death statutes <a href=\"\/auto-accident-injuries\/car-accidents\/\">regarding car accidents<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As a loving parent, you probably do everything you can to give your children a safe environment and the skills and resources they need for a healthy and happy future. Unfortunately, no matter how much you love your children, it is impossible to completely shield them from the dangers of the world. Riding in a vehicle is a perfect example.&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46759"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46759"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46759\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46759"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46759"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46759"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}