{"id":46762,"date":"2018-11-02T00:00:00","date_gmt":"2018-11-02T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/11\/many-pediatric-brain-tumors-could-be-misdiagnosed\/"},"modified":"2021-05-24T09:27:07","modified_gmt":"2021-05-24T13:27:07","slug":"many-pediatric-brain-tumors-could-be-misdiagnosed","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/11\/many-pediatric-brain-tumors-could-be-misdiagnosed\/","title":{"rendered":"Many pediatric brain tumors could be misdiagnosed"},"content":{"rendered":"<p>When parents and their children in Ohio receive a diagnosis of pediatric brain cancer, the future can be frightening. Because treatment is so critical to saving children&#8217;s lives and preventing the disease from advancing, a correct diagnosis is essential. However, scientific advances have revealed that many childhood brain cancer diagnoses are actually incorrect. One kind of tumor is frequently identified as another, and the differences are not detectable without newer, specialized tests that examine the molecular profiles of cancerous tumors.<\/p>\n<p>Researchers urged pediatric cancer specialists to adopt the newer testing protocols, called DNA methylation profiling, in order to avoid <a href=\"https:\/\/www.fredhutch.org\/en\/news\/center-news\/2018\/10\/pediatric-brain-cancer-misdiagnosis.html\" target=\"_blank\" rel=\"noopener noreferrer\">misdiagnosis<\/a> and provide correct treatment. They also recommended that family members insist on this type of testing for children with pediatric brain cancer. The tumors in question, called CNS-PNETs, have traditionally been diagnosed based on where they are found in the brain and the appearance of their cells under a microscope. However, when a molecular profile was created, tumors that looked identical under microscopic examination were revealed to be entirely different types of brain cancer.<\/p>\n<p>The tests were carried out on pediatric brain cancer patients participating in a clinical trial at worldwide institutions. Of 31 patients who had been diagnosed with CNS-PNETs, 22 were found to have other types of cancer. Some had supraterritorial embryonal tumors, which means they had a far better chance of survival. However, 18 were found to have glioblastomas, severely aggressive tumors which are often swiftly fatal.<\/p>\n<p>When doctors fail to diagnose cancer or provide a misdiagnosis, the consequences can be devastating. Patients may receive incorrect or damaging treatment, and their health prognosis may be significantly worsened due to disease progress. Patients who have suffered due to a medical error may consult with <a href=\"\/medical-malpractice\/\">Columbus, Ohio, medical malpractice injury lawyers<\/a> about the potential to take legal action and seek compensation for their damages.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When parents and their children in Ohio receive a diagnosis of pediatric brain cancer, the future can be frightening. Because treatment is so critical to saving children&#8217;s lives and preventing the disease from advancing, a correct diagnosis is essential. However, scientific advances have revealed that many childhood brain cancer diagnoses are actually incorrect. One kind of tumor is frequently identified&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46762"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46762"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46762\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46762"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46762"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46762"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}