{"id":46777,"date":"2018-10-02T00:00:00","date_gmt":"2018-10-02T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/10\/lbd-can-look-like-other-common-medical-conditions\/"},"modified":"2021-05-24T09:27:33","modified_gmt":"2021-05-24T13:27:33","slug":"lbd-can-look-like-other-common-medical-conditions","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/10\/lbd-can-look-like-other-common-medical-conditions\/","title":{"rendered":"LBD can look like other common medical conditions"},"content":{"rendered":"<p>Doctors in Ohio and around the country may have a hard time diagnosing Lewy body dementia (LBD). However, it is important that an accurate diagnosis be made as soon as possible. This is because an early diagnosis may allow for treatment that could provide a patient with a greater quality of life for a longer period of time. It may also provide a greater quality of life for those who are tasked with caring for LBD patients.<\/p>\n<p>In some cases, individuals who have LBD will be diagnosed with either Alzheimer&#8217;s disease or with Parkinson&#8217;s disease. However, LBD is different than Alzheimer&#8217;s disease because symptoms may include varying levels of cognitive ability as well as REM sleep disorders. Those who initially present with a movement disorder will typically develop symptoms in line with a diagnosis of dementia with Lewy bodies (DLB). It is possible that an individual will first present with symptoms consistent with DLB.<\/p>\n<p>Those who have high blood pressure or who smoke may develop a condition called vasular dementia. It may result in problems managing emotions or in managing financial aspects of their lives. Frontotemporal dementia (FTD) may result in apathy and a lack of personal hygiene. Furthermore, those who have this condition may not even be aware that they are experiencing changes in their personality or behavior.<\/p>\n<p>Patients in Columbus, Ohio, who have had their conditions misdiagnosed may be victims of medical malpractice. This may result in permanent injury or other problems that erode their quality of life. Doctor statements or patient treatment charts may be used to show that an diagnostic error rose to the level of medical malpractice. This may entitle a patient to compensation for medical bills and lost wages incurred because of the error.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Doctors in Ohio and around the country may have a hard time diagnosing Lewy body dementia (LBD). However, it is important that an accurate diagnosis be made as soon as possible. This is because an early diagnosis may allow for treatment that could provide a patient with a greater quality of life for a longer period of time. It may&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46777"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46777"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46777\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46777"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46777"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46777"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}