{"id":46783,"date":"2018-10-16T00:00:00","date_gmt":"2018-10-16T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/10\/ecri-pinpoints-10-health-tech-hazards\/"},"modified":"2021-05-24T09:27:20","modified_gmt":"2021-05-24T13:27:20","slug":"ecri-pinpoints-10-health-tech-hazards","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/10\/ecri-pinpoints-10-health-tech-hazards\/","title":{"rendered":"ECRI pinpoints 10 health tech hazards"},"content":{"rendered":"<p>The ECRI Institute has released its 2019 Top 10 Health Technology Hazards report, which ranks the hazards according to the priority they should receive. Medical professionals in addition to Ohio residents about to undergo surgery or another procedure will want to see whether any of these hazards might affect them personally. Topping the list of threats is hackers who target health care systems&#8217; remote access feature.<\/p>\n<p>According to the report, these <a href=\"https:\/\/www.healthleadersmedia.com\/clinical-care\/hackers-mattresses-sponges-top-ecri-health-tech-hazards-list\" target=\"_blank\" rel=\"noopener noreferrer\">cybersecurity attacks<\/a> can render devices or systems inoperable as well as expose or compromise patient data. The ECRI emphasizes the need to identify, monitor and protect all remote access points and follow recommended practices, like system patching and having strong passwords.<\/p>\n<p>Besides cybersecurity issues, the ECRI identified some other hazards. Mattresses and mattress covers, if improperly cleaned and disinfected, can expose patients to blood and other infectious materials. Even though surgical teams manually count their sponges, they can slip up and leave a sponge in the patient&#8217;s body, causing infection. Infection can also arise through the improper handling of flexible endoscopes.<\/p>\n<p>Improperly set ventilator alarms may fail to warn against loose connections or manufacturing defects, which, in turn, may result in the patient incurring a hypoxic brain injury. Missed alarms on physiologic monitoring system are another hazard. The incorrect programming of smart infusion pumps can cause medication dosage errors.<\/p>\n<p>Individuals who incur an injury because of medical malpractice should know that there are <a href=\"\/medical-malpractice\/\">Columbus, Ohio, medical malpractice injury lawyers<\/a> ready to speak on their behalf, so they can receive a fair settlement. With a malpractice claim, victims can seek to be reimbursed for past and future medical expenses, lost wages, pain and suffering and more. An attorney could hire third parties to show that there was an existing doctor-patient relationship and that the patient followed all the doctor&#8217;s instructions. A lawyer may ultimately be able to prove that the doctor failed to live up to an objective standard of care.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The ECRI Institute has released its 2019 Top 10 Health Technology Hazards report, which ranks the hazards according to the priority they should receive. Medical professionals in addition to Ohio residents about to undergo surgery or another procedure will want to see whether any of these hazards might affect them personally. Topping the list of threats is hackers who target&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46783"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46783"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46783\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46783"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46783"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46783"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}