{"id":46780,"date":"2018-10-10T00:00:00","date_gmt":"2018-10-10T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/10\/if-a-minor-drives-drunk-can-a-party-host-face-liability\/"},"modified":"2021-03-26T14:16:39","modified_gmt":"2021-03-26T19:16:39","slug":"if-a-minor-drives-drunk-can-a-party-host-face-liability","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/10\/if-a-minor-drives-drunk-can-a-party-host-face-liability\/","title":{"rendered":"If a minor drives drunk, can a party host face liability?"},"content":{"rendered":"<p>As students enter college and begin exercising their autonomy, there is very high likelihood that many of them will drink while underage, typically at a party of some kind. This experience has been celebrated in movies and television shows for many years, and a majority of college students get to college assuming that this is normal and even expected. Of these students who choose to drink while still minors, some of them will also choose to drive.<\/p>\n<p>While the experience may be normal, it is neither safe nor legal, and may place many more people at risk than just the student who chooses to drink and get behind the wheel. If they cause an accident, they may derail not only their own future opportunities, but also those of other victims in the accident. They may even put the host of the party where they drank in legal jeopardy.<\/p>\n<p>If you recently suffered injuries because of an underage drunk driver, then you should begin building a strong injury claim as soon as you can, to ensure that your rights remain secure while you recover. As you build this claim and seek compensation, consider how social host liability may play a role in the matter.<\/p>\n<p><strong>What is social host liability?<\/strong><\/p>\n<p>Ohio is one of many states that observes <a href=\"https:\/\/injury.findlaw.com\/accident-injury-law\/social-host-liability.html\" target=\"_blank\" rel=\"noopener noreferrer\">social host liability<\/a>, which places legal liability for underage drunk drinking on the shoulders of a host who serves or furnishes alcohol to minors. In broad terms, if a legal adult hosts a party, and a minor drinks alcohol provided at the party and later causes injuries or damage to property, the host may face liability as well as the minor. This expands the scope of an injury claim, if the underage drinker causes a car accident.<\/p>\n<p>It is important to note that a host does not need to knowingly offer or give alcohol to a minor to face liability. In these cases, &#8220;serving&#8221; alcohol means that the host knowingly provides alcohol to a minor, whereas &#8220;furnishing&#8221; alcohol is much broader. It includes simply making it available to minors, even if the host does not actually witness any underage drinking.<\/p>\n<p><strong>Building a strong claim for a full recovery<\/strong><\/p>\n<p>While social host liability is not always a simple thing to resolve legally, it is certainly important to consider in any accident that includes underage drinking. As you consider the legal options that you have, make sure that carefully examine the details of your accident and the events that lead to it. A well-built legal strategy <a href=\"\/auto-accident-injuries\/\">protects your rights<\/a> and increases the likelihood of obtaining the complete compensation that you deserve as you work toward a full recovery.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As students enter college and begin exercising their autonomy, there is very high likelihood that many of them will drink while underage, typically at a party of some kind. This experience has been celebrated in movies and television shows for many years, and a majority of college students get to college assuming that this is normal and even expected. Of&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46780"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46780"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46780\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46780"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46780"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46780"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}