{"id":46795,"date":"2018-09-12T00:00:00","date_gmt":"2018-09-12T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/09\/mistaken-test-analysis-could-lead-to-a-misdiagnosis\/"},"modified":"2021-05-24T09:27:57","modified_gmt":"2021-05-24T13:27:57","slug":"mistaken-test-analysis-could-lead-to-a-misdiagnosis","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/09\/mistaken-test-analysis-could-lead-to-a-misdiagnosis\/","title":{"rendered":"Mistaken test analysis could lead to a misdiagnosis"},"content":{"rendered":"<p>Every year, men in Ohio and around the country are diagnosed with prostate cancer. When determining the stage that the cancer has reached, doctors often use positron emission tomography (PET) scans to determine whether the cancer has spread elsewhere in the body. These scans often measure levels of prostate-specific membrane antigen (PSMA) found in the body. Because this enzyme is particularly expressive, it can be especially useful for imaging technology used to diagnose cancer and determine treatment regimens. <\/p>\n<p>However, some researchers have warned that relying solely on these scans could lead to <a href=\"https:\/\/medicalxpress.com\/news\/2018-09-pitfall-popular-prostate-cancer-pet.html\" target=\"_blank\" rel=\"noopener noreferrer\">misdiagnoses<\/a> that could negatively impact men with prostate cancer. There are benign tissues in the body that also show signs of elevated PSMA during a scan, including areas of the bowels, kidneys, salivary glands and ganglia. These can be mistaken for advanced metastases of the lymph nodes when a physician is examining PET scan results. If the wrong stage of cancer is misdiagnosed, patients could receive unneeded and even damaging treatment, given the side effects that can accompany radiation and chemotherapy. <\/p>\n<p>Researchers noted that doctors should be aware of the potential for errors as these scans are frequently used to determine treatment plans. In a study, they reviewed 407 cases and found that in 98.5 percent of them, results for benign tissue could be confused for advanced, spreading cancer in the lymph nodes. The scientists noted that these scans remain important diagnostic tools but that doctors should be sure to examine the location and circumstances of potential metastases. <\/p>\n<p>Accuracy in the detection and treatment of cancer is particularly important for patient health. If doctors fail to diagnose cancer, the disease could spread, putting lives at risk. <a href=\"\/medical-malpractice\/\">Columbus, Ohio, medical malpractice injury lawyers<\/a> can consult with patients who have been harmed by medical mistakes about the potential to seek compensation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every year, men in Ohio and around the country are diagnosed with prostate cancer. When determining the stage that the cancer has reached, doctors often use positron emission tomography (PET) scans to determine whether the cancer has spread elsewhere in the body. These scans often measure levels of prostate-specific membrane antigen (PSMA) found in the body. Because this enzyme is&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46795"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46795"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46795\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46795"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46795"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46795"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}