{"id":46807,"date":"2018-08-10T00:00:00","date_gmt":"2018-08-10T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/08\/truck-accidents-and-electronic-control-modules\/"},"modified":"2021-03-26T14:19:46","modified_gmt":"2021-03-26T19:19:46","slug":"truck-accidents-and-electronic-control-modules","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/08\/truck-accidents-and-electronic-control-modules\/","title":{"rendered":"Truck accidents and electronic control modules"},"content":{"rendered":"<p>When a truck accident occurs, the devastation it can cause is enormous. In the wrong circumstances, a single large commercial truck can destroy many other small consumer vehicles, producing thousands upon thousands of dollars in damages and severe injuries at the scene.<\/p>\n<p>Needless to say, gathering as much information about the causes of the accident as you can find is an important part of dealing with any truck accident, especially if you suspect that the truck driver or some aspect of the vehicle is responsible for the accident.<\/p>\n<p>Unlike consumer vehicles, most trucks contain a number of data collection methods that are useful when building a claim after an accident and making the case for where liability for the damages and injuries lie.<\/p>\n<p>If you recently experienced an accident involving a large truck, you should begin collecting as much evidence as you can at the scene, provided you are safe and did not suffer any serious injuries. Among the many kinds of evidence you should gather are the driving logs of the the driver and the data produced by the truck&#8217;s <a href=\"https:\/\/corporate.findlaw.com\/litigation-disputes\/preserving-the-black-box-after-a-truck-accident.html\" target=\"_blank\" rel=\"noopener noreferrer\">electronic control modules<\/a>, or ECMs.<\/p>\n<p><strong>What are ECMs ?<\/strong><\/p>\n<p>An ECM is a data aggregation device that collects and stores information about the operation of a large truck over a period of time, typically about 30 days. If the truck involved in the accident was manufactured within the last 25 years or so, then it probably contains an ECM, which means that victims of a truck accident can attempt to recover data from the device that may help build a strong claim and provide detailed proof of the causes of the accident.<\/p>\n<p>An ECM collects data on a number of aspects of the truck and its operation, including<\/p>\n<ul>\n<li>Seat belt usage<\/li>\n<li>Total drive time<\/li>\n<li>Total drive time over 65 miles per hour<\/li>\n<li>Average speed of the vehicle<\/li>\n<li>Highest speed in a given timeframe<\/li>\n<li>Air bag usage and performance<\/li>\n<li>Idling time<\/li>\n<\/ul>\n<p>This type of information can prove invaluable when building a claim after an accident with a commercial truck, allowing victims some detailed insight into the operation of the vehicle both before and at the time of the accident.<\/p>\n<p><strong>Don&#8217;t wait to build a strong legal strategy<\/strong><\/p>\n<p>If you plan to pursue an injury claim or property damage claim after a truck accident, it is wise to begin gathering evidence and constructing your strategy as soon as you can. The more information you have to validate your claim, the better, but be sure that you use all the high-quality legal resources you have available to ensure that your <a href=\"\/auto-accident-injuries\/truck-accidents\/\">rights remain secure<\/a> while you fight for fair compensation and hope for a full recovery.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When a truck accident occurs, the devastation it can cause is enormous. In the wrong circumstances, a single large commercial truck can destroy many other small consumer vehicles, producing thousands upon thousands of dollars in damages and severe injuries at the scene. Needless to say, gathering as much information about the causes of the accident as you can find is&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46807"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46807"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46807\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46807"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46807"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46807"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}