{"id":46804,"date":"2018-09-27T00:00:00","date_gmt":"2018-09-27T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/09\/car-accident-victims-may-deserve-compensation-for-many-losses\/"},"modified":"2021-03-26T14:17:23","modified_gmt":"2021-03-26T19:17:23","slug":"car-accident-victims-may-deserve-compensation-for-many-losses","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/09\/car-accident-victims-may-deserve-compensation-for-many-losses\/","title":{"rendered":"Car accident victims may deserve compensation for many losses"},"content":{"rendered":"<p>In the weeks and months after a serious car accident, victims may suffer through many kinds of pain during the recovery process, all while seeing serious medical bills and other expenses pile up. If an injury is severe or affects a specific function, it may keep the victim from working at all, with bills mounting while income is dropping.<\/p>\n<p>If you recently suffered physical injuries in a car accident, then you must build a strong accident claim as quickly but thoroughly as you can. You don&#8217;t want to wait to build the claim and miss important evidence from the accident that disappears with time, but you also don&#8217;t want to rush the process and ultimately build a weak claim that doesn&#8217;t lead to full compensation.<\/p>\n<p>Make sure you understand all of the <a href=\"https:\/\/injury.findlaw.com\/accident-injury-law\/economic-recovery-for-accidents-and-injuries.html\" target=\"_blank\" rel=\"noopener noreferrer\">types of compensation<\/a> that you may deserve and use high-quality legal resources when building your claim.<\/p>\n<p><strong>Tangible losses<\/strong><\/p>\n<p>Many of the losses that car accidents cause are self-evident. A victim may suffer broken bones and other serious injuries that require extensive surgeries and therapy to repair, while at the same time the victim may lose income or professional opportunities.<\/p>\n<p>With all types of loss, it is important to gather as much evidence as possible to make the claim clear and strong. This means gathering medical documentation about related injuries and medical billing records, as well as pay stubs and bank statements to outline how the injury affects the victim&#8217;s finances.<\/p>\n<p>It is important to consider not only medical expenses that a victim already faces, but also the ongoing cost of treatment to ensure that the victim makes a full recovery. If the victim suffers long term disability, it is wise to build a comprehensive picture of how this loss may affect them in the future.<\/p>\n<p><strong>Intangible losses<\/strong><\/p>\n<p>Other losses are just as real, but their exact impact on the victim is not easy to quantify. For instance, an accident may leave a victim with some form of disfigurement, which can adversely affect the victim in every area of their life.<\/p>\n<p>Similarly, if the victim is married, then their spouse may claim loss of consortium, or loss of the benefits of marriage. As anyone in a committed relationship can tell you, a severely injured partner places enormous pressures on the relationship, while at the same time often creating distance between spouses. While these losses are not as easy to identify and understand as medical bills, they are real and deserve compensation.<\/p>\n<p><strong>Building your claim begins now<\/strong><\/p>\n<p>Don&#8217;t wait to begin building a strong claim that truly represents your losses if you experienced a serious car accident. The sooner you begin building your claim, the sooner you can focus your energies on <a href=\"\/catastrophic-injuries-fatalities\/\">recovering from the effects of the accident<\/a> and getting back to your normal way of living.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the weeks and months after a serious car accident, victims may suffer through many kinds of pain during the recovery process, all while seeing serious medical bills and other expenses pile up. If an injury is severe or affects a specific function, it may keep the victim from working at all, with bills mounting while income is dropping. If&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46804"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46804"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46804\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46804"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46804"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46804"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}