{"id":46837,"date":"2018-07-31T00:00:00","date_gmt":"2018-07-31T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/07\/how-new-tech-can-combat-tech-related-distracted-driving\/"},"modified":"2021-05-24T10:16:07","modified_gmt":"2021-05-24T14:16:07","slug":"how-new-tech-can-combat-tech-related-distracted-driving","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/07\/how-new-tech-can-combat-tech-related-distracted-driving\/","title":{"rendered":"How new tech can combat tech-related distracted driving"},"content":{"rendered":"<p>Distracted driving accidents are considered some of the most severe in terms of injuries and vehicle damage, and with the introduction of smartphones and other mobile devices, they are on the rise. Ohio residents should know, however, that new technology is being introduced that could help keep drivers from experiencing technology-related distractions.<\/p>\n<p>Data analysis has been used for years to identify adverse events and predict which drivers are at risk. Zendrive has been doing this for trucking companies and insurers using nothing but smartphone data. The fleet management systems provider Omnitracs even developed a module for its Driving Center tool that can point out distraction and fatigue in truck drivers.<\/p>\n<p>Distracted driving is especially hard on trucking companies because of the delays they cause and the claims they generate. Many fleet owners are trying to figure out how to <a href=\"https:\/\/www.fleetowner.com\/safety\/using-data-and-tech-combat-distracted-driving-and-its-costs\" target=\"_blank\" rel=\"noopener noreferrer\">reduce stressors<\/a> in their employees&#8217; lives as this can cut down on fatigue and distraction.<\/p>\n<p>Fleet management systems from companies like Smartdrive and PeopleNet can also benefit trucking companies. These systems feature driver-coaching tools and in-cab video monitoring. Another business, Netradyne, will be releasing a system that audibly warns drivers when it senses that they are in a risky situation. Telematics-based systems can monitor speed and aggressive driving in the effort to transform truckers into safer drivers.<\/p>\n<p>If truckers continue to use their phones and ignore warnings, they can get into an accident and be held liable. Proving that one&#8217;s truck accident injuries were the result of negligence can take the assistance of <a href=\"\/auto-accident-injuries\/truck-accidents\/\">Columbus, Ohio, truck accident injury lawyers<\/a>. All kinds of proof from the police report and the work log to the phone records will be necessary. Victims can hire a lawyer and even have him or her negotiate on their behalf for a settlement. If one cannot be reached, they can proceed to a trial.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Distracted driving accidents are considered some of the most severe in terms of injuries and vehicle damage, and with the introduction of smartphones and other mobile devices, they are on the rise. Ohio residents should know, however, that new technology is being introduced that could help keep drivers from experiencing technology-related distractions. Data analysis has been used for years to&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46837"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46837"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46837\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46837"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46837"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46837"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}