{"id":46834,"date":"2018-07-27T00:00:00","date_gmt":"2018-07-27T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/07\/stay-safer-at-college-parties-by-avoiding-alcohol\/"},"modified":"2021-03-26T14:20:29","modified_gmt":"2021-03-26T19:20:29","slug":"stay-safer-at-college-parties-by-avoiding-alcohol","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/07\/stay-safer-at-college-parties-by-avoiding-alcohol\/","title":{"rendered":"Stay safer at college parties by avoiding alcohol"},"content":{"rendered":"<p>Ohio State University is an exciting place to go to school, and you probably know dozens of people who are planning parties and get-togethers. For young, college-aged adults, mistakes can easily happen at these events.<\/p>\n<p>Ohio State University staff know that mistakes happen and that students need to be protected. That&#8217;s why the school put out a guide to <a href=\"http:\/\/swc.osu.edu\/partysmart\/\" target=\"_blank\" rel=\"noopener noreferrer\">safe and successful parties<\/a>, which aims to reduce the risk of getting hurt or hurting others.<\/p>\n<p><strong>Drunk driving and college life<\/strong><\/p>\n<p>One risk to people who go to college parties is <a href=\"\/auto-accident-injuries\/\">drunk driving<\/a>. Drinking is typical at events and parties, but it&#8217;s very easy to underestimate how affected you are by these drinks. The fact is that the majority of OSU students have fewer than six drinks when they go to parties, but, depending on the person, that could be more than enough to result in drunk driving.<\/p>\n<p>Students can help protect themselves and others by opting out of drinking or by making plans to get a ride back to campus safely. Call a ride-sharing service, friend or relative.<\/p>\n<p>Blood alcohol concentrations matter, and they vary based on numerous factors including the alcohol content of the drink you&#8217;re having, your weight, age and more.<\/p>\n<p><strong>How much alcohol does it take to be too drunk to drive?<\/strong><\/p>\n<p>Any amount of alcohol in the blood stream can affect your ability to drive, but it is illegal to drive with .08 percent or more. Keep in mind that this limit doesn&#8217;t address the symptoms you could have at lower percentages. For instance, at .02 percent to .03 percent BAC, you might feel light-headed or relaxed. If you&#8217;re between .05 percent BAC and .07 percent, then you might have a good &#8220;buzz&#8221; going and have moods that are amplified. It&#8217;s also normal for some people to feel euphoric or to become louder and bolder than usual.<\/p>\n<p>In either of these situations, it&#8217;s technically legal to drive, but it&#8217;s not necessarily safe. In fact, anyone with any amount of alcohol in his or her blood stream could get behind the wheel of a vehicle and make fatal mistakes.<\/p>\n<p>For people going to parties, it&#8217;s best that you keep an eye on yourself and your friends. Make good decisions, alternate the drinks you consume with water and remember that safety has to come first. There are too many people who are negatively impacted by alcohol at parties, especially when the actions are preventable.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ohio State University is an exciting place to go to school, and you probably know dozens of people who are planning parties and get-togethers. For young, college-aged adults, mistakes can easily happen at these events. Ohio State University staff know that mistakes happen and that students need to be protected. That&#8217;s why the school put out a guide to safe&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46834"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46834"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46834\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46834"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46834"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46834"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}