{"id":46849,"date":"2018-06-13T00:00:00","date_gmt":"2018-06-13T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/06\/study-shows-four-drug-pancreatic-cancer-treatment-is-promising\/"},"modified":"2021-05-24T09:29:53","modified_gmt":"2021-05-24T13:29:53","slug":"study-shows-four-drug-pancreatic-cancer-treatment-is-promising","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/06\/study-shows-four-drug-pancreatic-cancer-treatment-is-promising\/","title":{"rendered":"Study shows four-drug pancreatic cancer treatment is promising"},"content":{"rendered":"<p>Early-stage pancreatic cancer patients in Columbus may soon have a promising new treatment option. A recent study found that a four-drug chemotherapy treatment used for late-stage pancreatic cancer patients can help early-stage patients live significantly longer than the current standard chemo treatment.<\/p>\n<p>Scientists from the Cancer Institute of Lorraine in France found that a four-drug chemo cocktail called folfirinox helped 40 percent of early pancreatic cancer patients stay cancer-free after an average of three years. In comparison, the standard chemo drug, called Gemzar, helped only 20 percent of patients stay cancer-free. In addition, nearly two-thirds of patients given folfirinox were still living after three years while less than half of Gemzar patients survived that long.<\/p>\n<p>The results of the study, which was conducted on 500 patients across France and Canada, are being touted as &#8220;practice-changing&#8221; by medical experts. The findings also offer hope to those diagnosed with the deadly disease. Currently, there is no screening available for pancreatic cancer, and those who are diagnosed with it often die within one year. This is because most patients don&#8217;t suffer symptoms, such as stomach pain, weight loss and fatigue, until the cancer has already spread. Each year, U.S. doctors diagnose 55,000 new cases of the disease. Experts say that generic versions of folfirinox are relatively inexpensive and will likely be covered by insurance if the drug is recognized as the new standard of care. <\/p>\n<p>Pancreatic cancer patients who are misdiagnosed could suffer a worsened medical condition. Individuals in this situation may benefit from contacting <a href=\"\/medical-malpractice\/\">Columbus, Ohio, medical malpractice injury lawyers<\/a> for advice. Lawyers might also help the families of patients who die as a result of misdiagnosis or delayed diagnosis. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Early-stage pancreatic cancer patients in Columbus may soon have a promising new treatment option. A recent study found that a four-drug chemotherapy treatment used for late-stage pancreatic cancer patients can help early-stage patients live significantly longer than the current standard chemo treatment. Scientists from the Cancer Institute of Lorraine in France found that a four-drug chemo cocktail called folfirinox helped&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46849"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46849"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46849\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46849"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46849"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46849"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}