{"id":46846,"date":"2018-06-20T00:00:00","date_gmt":"2018-06-20T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/06\/the-devastating-effects-of-surgery-gone-wrong\/"},"modified":"2021-05-24T09:29:41","modified_gmt":"2021-05-24T13:29:41","slug":"the-devastating-effects-of-surgery-gone-wrong","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/06\/the-devastating-effects-of-surgery-gone-wrong\/","title":{"rendered":"The devastating effects of surgery gone wrong"},"content":{"rendered":"<p>Most Ohio residents have heard accounts of individuals who have suffered complications during or after surgery. However, when a loved one suffers complications, the reality of how devastating surgical errors can be reaches home. <\/p>\n<p>Most understand that surgical procedures are designed to save lives and correct defects. The challenge arrives when a <a href=\"https:\/\/www.portsmouth-dailytimes.com\/opinion\/29568\/when-surgery-goes-wrong-due-to-human-error\" target=\"_blank\" rel=\"noopener noreferrer\">surgical procedure goes wrong<\/a> because of an error during the operation. In such cases, the patient may not know what to do. <\/p>\n<p>There are steps patients can take before the surgery to minimize the chance of a mistake during an operation. For example, when going in for a consultation, they should bring someone along who can also listen to what the surgeon says and ask questions. It&#8217;s beneficial to bring in the same person to each consultation. Do research about the procedure in advance. The internet, the library, and medical professionals are excellent sources of information. Also, get a second opinion. Don&#8217;t trust that what the first doctor says is fact. The more informed the patient is, the more control they have over the surgical procedures performed on them. <\/p>\n<p>Hold the surgeon responsible by requesting follow-up visits at the hospital shortly after the surgical procedure. Be sure to have friends and family members in the hospital in the days following the surgical procedure. Do not to be afraid to ask post-surgical questions. If there is any intense pain, speak up right away. <\/p>\n<p>If a patient is injured because of an error on the part of their surgeon or surgical team, they may want to file a claim for damages. A personal injury attorney can work with their client in identifying hospital negligence, misdiagnosis, mistakes and cases of <a href=\"\/medical-malpractice\/\">medical malpractice<\/a>. An attorney might be able to prove that a surgeon, hospital or the hospital staff was negligent. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Most Ohio residents have heard accounts of individuals who have suffered complications during or after surgery. However, when a loved one suffers complications, the reality of how devastating surgical errors can be reaches home. Most understand that surgical procedures are designed to save lives and correct defects. The challenge arrives when a surgical procedure goes wrong because of an error&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46846"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46846"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46846\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46846"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46846"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46846"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}