{"id":46852,"date":"2018-06-29T00:00:00","date_gmt":"2018-06-29T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/06\/recovering-from-whiplash-after-a-car-accident\/"},"modified":"2021-03-26T14:21:51","modified_gmt":"2021-03-26T19:21:51","slug":"recovering-from-whiplash-after-a-car-accident","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/06\/recovering-from-whiplash-after-a-car-accident\/","title":{"rendered":"Recovering from whiplash after a car accident"},"content":{"rendered":"<p>After you survive any kind of traffic accident, there is a very good chance that you will experience some form of whiplash. This injury takes many forms and may require weeks or months of treatment, depending on the severity of the injury.<\/p>\n<p>If you suffered some form of <a href=\"https:\/\/injury.findlaw.com\/car-accidents\/whiplash-related-injuries.html\" target=\"_blank\" rel=\"noopener noreferrer\">whiplash<\/a> during a car accident, do not put off seeking professional medical care. Not only can professional care help you recover from the injury more effectively than waiting on your body to heal naturally, professional medical documentation of your injury often serves as a strong basis for a personal injury claim, if that is necessary.<\/p>\n<p>Don&#8217;t put off looking into the legal resources that you have available. You may have a strong personal injury claim, and the longer that you delay building your claim, the fewer opportunities that you have to <a href=\"\/auto-accident-injuries\/\">protect your rights<\/a> and seek fair compensation for your losses.<\/p>\n<p><strong>Symptoms of whiplash<\/strong><\/p>\n<p>Whiplash is not one isolated injury, but may refer to a wide range of injuries a person may receive. In broad terms, whiplash is a soft-tissue injury that arises whenever muscle groups receive unexpected trauma, causing them to tighten significantly.<\/p>\n<p>This produces extreme pain for many victims, often practically paralyzing them with pain and stiffness. Symptoms of whiplash may include:<\/p>\n<ul>\n<li>Unreliable memory<\/li>\n<li>Problems with concentration<\/li>\n<li>Dizziness or prolonged headaches<\/li>\n<li>Stiffness and pain in your neck, head, back and torso<\/li>\n<li>Problems with balance<\/li>\n<\/ul>\n<p>If you experience any of theses symptoms, be sure seek medical care immediately and keep all the medical documentation that you receive.<\/p>\n<p><strong>Treating whiplash<\/strong><\/p>\n<p>Depending on the nature of the injury, you may need many different kinds of treatment. Whiplash treatments are not one-size-fits-all. In fact, some treatments may help ease the suffering of some victims while other victims may experience greater pain, if the treatment is not tailored to the individual injury.<\/p>\n<p>Often, whiplash requires weeks or months of occupational therapy to regain motion, and may use prescription medication to ease tension and pain. A victim may also benefit greatly from the use of non-traditional medical treatment such as chiropractics. Each treatment should be directed by a qualified medical professional caring for you individually.<\/p>\n<p>Taking your whiplash injury seriously begins with seeking out proper medical care before anything else. Once you identify your injuries and receive proper treatment, then you can begin focusing on protecting your rights with a strong legal claim.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After you survive any kind of traffic accident, there is a very good chance that you will experience some form of whiplash. This injury takes many forms and may require weeks or months of treatment, depending on the severity of the injury. If you suffered some form of whiplash during a car accident, do not put off seeking professional medical&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46852"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46852"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46852\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46852"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46852"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46852"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}