{"id":46858,"date":"2018-06-15T00:00:00","date_gmt":"2018-06-15T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/06\/many-parties-may-share-truck-accident-liability\/"},"modified":"2021-03-26T14:22:36","modified_gmt":"2021-03-26T19:22:36","slug":"many-parties-may-share-truck-accident-liability","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/06\/many-parties-may-share-truck-accident-liability\/","title":{"rendered":"Many parties may share truck accident liability"},"content":{"rendered":"<p>After surviving a truck accident, it can be overwhelming to determine what to do next. Like all traffic accidents, even if you don&#8217;t believe that you were injured, you should always get a medical examination to identify injuries you may not have noticed.<\/p>\n<p>If you discover injuries or already know that you suffered harm, you probably need to file a personal injury claim to cover your medical expenses and compensate you for other losses like lost income while you recover. Building your claim is a delicate process, especially because a <a href=\"https:\/\/injury.findlaw.com\/car-accidents\/commercial-truck-accidents-overview.html\" target=\"_blank\" rel=\"noopener noreferrer\">truck accident<\/a> can involve so many defendants.<\/p>\n<p>You must consider all the parties that may share liability for your injuries as you build you claim. This will help protect your rights to pursue fair compensation.<\/p>\n<p><strong>Who hired the driver?<\/strong><\/p>\n<p>If your accident occurred because of error or negligence on the part of the driver, you might think that the driver is the primary defendant in the claim. While this is possible, it is important to have an accurate understanding of the employment relationship between the driver and whatever party hired him or her to transport cargo.<\/p>\n<p>Drivers who work as independent contractors carry their own insurance coverage and may bear the liability on their own through that coverage. But if the driver works as an employee of a company, that employer may actually be liable for the lion&#8217;s share of your losses.<\/p>\n<p>Unfortunately, many companies attempt to classify employees as independent contractors to avoid this type of liability. Even if the driver or the shipping company that hired the driver claim the driver is not an employee, this might not be true. Carefully examine this relationship to see if you have grounds to challenge the employee status and name the employer as a co-defendant.<\/p>\n<p><strong>Who secured the cargo and prepared the truck?<\/strong><\/p>\n<p>Not all drivers are one-person shows. In most cases, some other party loads the cargo for the driver or helps secure the load at the dock. If the cargo itself plays a part in your accident because it was poorly secured or not properly balanced, then the party that loaded and secured it may bear responsibility.<\/p>\n<p>Likewise, if a third party performed shoddy repairs or maintenance that contributed to the accident, the party that performed the work may share liability just as a parts manufacturer may share liability if a faulty part causes the accident.<\/p>\n<p>Building a strong claim means that you must look at many detailed aspects of your wreck. Make sure that you <a href=\"\/auto-accident-injuries\/\">protect your rights<\/a> as you recover from your injuries and seek fair, complete compensation for your losses.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After surviving a truck accident, it can be overwhelming to determine what to do next. Like all traffic accidents, even if you don&#8217;t believe that you were injured, you should always get a medical examination to identify injuries you may not have noticed. If you discover injuries or already know that you suffered harm, you probably need to file a&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46858"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46858"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46858\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46858"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46858"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46858"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}