{"id":46861,"date":"2018-06-25T00:00:00","date_gmt":"2018-06-25T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/06\/2-brake-safety-programs-scheduled-for-cmv-drivers\/"},"modified":"2021-05-24T10:16:33","modified_gmt":"2021-05-24T14:16:33","slug":"2-brake-safety-programs-scheduled-for-cmv-drivers","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/06\/2-brake-safety-programs-scheduled-for-cmv-drivers\/","title":{"rendered":"2 brake safety programs scheduled for CMV drivers"},"content":{"rendered":"<p>Commercial motor vehicle drivers in Ohio and across America should know that there are two upcoming inspection sprees, both concerned with enforcing brake safety guidelines. The two initiatives form part of Operation Airbrake, a program started back in 1998 by the Commercial Vehicle Safety Alliance and the Federal Motor Carrier Safety Administration. During the past 20 years, more than 3.4 million brakes have been inspected.<\/p>\n<p>Regarding the first initiative, a one-day inspection spree, the CVSA will not reveal the date that it will take place. The second initiative, called Brake Safety Week, has been scheduled for <a href=\"https:\/\/cvsa.org\/program\/programs\/operation-airbrake\/brake-safety-campaigns\/\" target=\"_blank\" rel=\"noopener noreferrer\">Sept. 16 to 22<\/a>. For both events, CMV inspectors will be conducting mostly Level IV inspections since this is the level reserved for specific components.<\/p>\n<p>Truck, bus and other commercial vehicle drivers will therefore want to ensure that their brakes are in optimal condition. If they were not properly installed, and if they are not maintained according to the manufacturer&#8217;s guidelines, they can increase stopping distance and put the public at a greater risk.<\/p>\n<p>Unfortunately, brake-system violations are behind the majority of out-of-service orders issued during roadside inspections. Trucks with brakes that are out of adjustment or that have defective rotors, loose or missing parts, worn linings and pads or no warning device, among other problems, will be put out of service.<\/p>\n<p>The failure to keep brakes in good working order is just one example of <a href=\"\/auto-accident-injuries\/truck-accidents\/\">negligent truck maintenance<\/a>. When it leads to a crash, victims can consider seeing a lawyer about filing a claim. It&#8217;s important to file it before the statute of limitations runs out. The lawyer could hire professionals to explain the technical side of the accident and to determine the extent of the victim&#8217;s injuries. The lawyer could negotiate with the trucking company for an out-of-court settlement, taking the case to court if no agreement is reached.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Commercial motor vehicle drivers in Ohio and across America should know that there are two upcoming inspection sprees, both concerned with enforcing brake safety guidelines. The two initiatives form part of Operation Airbrake, a program started back in 1998 by the Commercial Vehicle Safety Alliance and the Federal Motor Carrier Safety Administration. During the past 20 years, more than 3.4&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46861"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46861"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46861\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46861"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46861"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46861"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}