{"id":46867,"date":"2018-05-09T00:00:00","date_gmt":"2018-05-09T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/05\/tired-ride-sharing-drivers-at-risk-for-accidents\/"},"modified":"2021-05-24T09:12:31","modified_gmt":"2021-05-24T13:12:31","slug":"tired-ride-sharing-drivers-at-risk-for-accidents","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/05\/tired-ride-sharing-drivers-at-risk-for-accidents\/","title":{"rendered":"Tired ride-sharing drivers at risk for accidents"},"content":{"rendered":"<p>The popularity of ride-sharing services in Ohio is increasing as passengers want an inexpensive way to travel around and drivers see a financial opportunity that provides them flexibility and independence. However, according to the American Academy of Sleep Medicine, fatigue and sleeplessness are creating risks for drivers and passengers in the ride-sharing industry.<\/p>\n<p>Many drivers for ride-sharing companies work during the night. This means that they are fighting their body&#8217;s circadian rhythm as they strive to stay awake. For many drivers, ride-sharing is a second job. It is easy to see how some <a href=\"https:\/\/www.sciencedaily.com\/releases\/2018\/04\/180416085706.htm\" target=\"_blank\" rel=\"noopener noreferrer\">drivers start their work already tired<\/a>.<\/p>\n<p>Unlike most employees in the transportation industry, drivers with ride-sharing companies are considered independent contractors. This means that they do not undergo the same health examinations and are not required to adhere to the same regulations for how long they can be on the road. Throw in salary incentives for working longer, and it&#8217;s understandable that some ride-share drivers view sleep as being overrated.<\/p>\n<p>When the average passenger hops into a ride-sharing vehicle, the last thing on their mind is the health or the alertness of the driver. According to the American Academy of Sleep Medicine, this is a recipe for disaster. More than 300,000 crashes every year involve drowsy drivers. Of these, more than 6,000 lead to fatalities. Seeing the potential for danger that could exist, major ride-sharing companies have altered their work policies and now require drivers to spend some time logged off the system before they can start driving again.<\/p>\n<p>Learning that a serious accident was caused because of the drowsiness of another driver can be devastating for victims and their families. <a href=\"\/auto-accident-injuries\/car-accidents\/\">Auto accident attorneys<\/a> may be able to provide assistance to individuals in gathering the facts and determining what compensation the victim is owed. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>The popularity of ride-sharing services in Ohio is increasing as passengers want an inexpensive way to travel around and drivers see a financial opportunity that provides them flexibility and independence. However, according to the American Academy of Sleep Medicine, fatigue and sleeplessness are creating risks for drivers and passengers in the ride-sharing industry. Many drivers for ride-sharing companies work during&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46867"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46867"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46867\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46867"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46867"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46867"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}