{"id":46864,"date":"2018-05-30T00:00:00","date_gmt":"2018-05-30T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/05\/when-commercial-truckers-drive-distracted-you-lose\/"},"modified":"2021-03-26T14:23:20","modified_gmt":"2021-03-26T19:23:20","slug":"when-commercial-truckers-drive-distracted-you-lose","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/05\/when-commercial-truckers-drive-distracted-you-lose\/","title":{"rendered":"When commercial truckers drive distracted, you lose"},"content":{"rendered":"<p>Sharing the road with massive commercial trucks is just a fact of life in modern Ohio. Semitrucks and eighteen-wheelers help deliver goods, supplies and components from one shore to another, and many of them find their way through Ohio.<\/p>\n<p>Many more mid-range and daily commute commercial trucks supply businesses throughout Ohio and the Midwest by regularly transporting needed items. Our economy is quite dependent on these massive vehicles, so most drivers understand sharing the road with them.<\/p>\n<p>Sadly, truckers are as prone to poor decision-making as the general public. They may find mobile phones tempting during a long, dull drive. However, the size of the vehicles they operate makes their distraction even more dangerous than the distraction of the average driver. With wide turning radii, longer stopping times and huge blind spots, trucks demand full focus for safe operation. <a href=\"\/auto-accident-injuries\/truck-accidents\/causes-of-trucking-accidents\/\">Trucker distraction<\/a> can prove injurious or even deadly for people in smaller vehicles.<\/p>\n<p><strong>Truck driving lends itself to distraction over time<\/strong><\/p>\n<p>It&#8217;s certainly not easy working as a professional truck driver. There are long hours, often shifts that last as many as 14 hours. There&#8217;s a lot of stress and demand. Deadlines can impact how much they get paid, and delivering loads late can result in lower per-mile pay or lost bonuses. Bad weather, unrelated crashes and road construction can all cause delays.<\/p>\n<p>Combine that with monotonous work, and it&#8217;s easy to see how distraction could prove to be incredibly tempting to a commercial driver. It may help stave off boredom and depression to read or send a text message to family members. Other drivers may try to multi-task while driving. Eating or performing grooming and self-care while on the road are common distractions as well. Even getting lost in thought can be a deadly source of distraction while on the road.<\/p>\n<p><strong>Federal law prohibits electronic distraction for commercial drivers<\/strong><\/p>\n<p>In order to keep the streets as safe as possible, the <a href=\"https:\/\/www.fmcsa.dot.gov\/driver-safety\/distracted-driving\/no-texting-rule-fact-sheet\" target=\"_blank\" rel=\"noopener noreferrer\">Federal Motor Carrier Safety Administration (FMCSA)<\/a> has rules and regulations in place that limit what commercial drivers can do. One of their rules specifically prohibits the use of a mobile phone for any kind of texting. This rule is in addition to any applicable laws along the delivery route for the commercial driver.<\/p>\n<p>Under the FMCSA rule, texting includes not just standard SMS messaging, but also email, instant messages, accessing web pages, dialing a number to place or end a call, or any other form of electronic text entry or retrieval. Drivers who get caught texting while operating a commercial vehicle can face steep penalties, including up to $2,750 in fines and the potential loss of their commercial license. Anyone who ends up hurt in a crash caused by a distracted truck driver may have the right to seek compensation for the injuries that result.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Sharing the road with massive commercial trucks is just a fact of life in modern Ohio. Semitrucks and eighteen-wheelers help deliver goods, supplies and components from one shore to another, and many of them find their way through Ohio. Many more mid-range and daily commute commercial trucks supply businesses throughout Ohio and the Midwest by regularly transporting needed items. Our&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46864"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46864"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46864\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46864"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46864"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46864"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}