{"id":46870,"date":"2018-05-17T00:00:00","date_gmt":"2018-05-17T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/05\/seatbelts-could-reduce-car-accident-injuries-to-liver\/"},"modified":"2021-05-24T09:12:17","modified_gmt":"2021-05-24T13:12:17","slug":"seatbelts-could-reduce-car-accident-injuries-to-liver","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/05\/seatbelts-could-reduce-car-accident-injuries-to-liver\/","title":{"rendered":"Seatbelts could reduce car accident injuries to liver"},"content":{"rendered":"<p>Ohio drivers may take steps to protect themselves from the damage caused by car accidents by buckling up behind the wheel. Research has found that wearing a seatbelt could help decrease the severity of liver injuries incurred in car crashes. However, wearing a seatbelt cannot eliminate the risk of damage to the liver in a collision, and the costs of this kind of injury can be significant both physically and financially.<\/p>\n<p>A study analyzed 51,202 patients with <a href=\"https:\/\/www.reuters.com\/article\/us-health-seatbelts-liver\/seatbelts-may-protect-against-severe-liver-injury-in-car-crashes-idUSKBN1I32G3\" target=\"_blank\" rel=\"noopener noreferrer\">car accident injuries<\/a> to the liver. By using data from the National Trauma Data Bank for 2010 through 2015, the researchers classified the injuries to their livers as either low-grade or severe. Liver and other internal organ injuries are common outcomes of the type of blunt abdominal trauma often suffered in a motor vehicle collision. Injuries like blood clots or shallow lacerations were classified as low-grade, while injuries like ruptured clots, deep lacerations or other damage requiring surgery were classified as severe.<\/p>\n<p> the patients studied, 15 percent had severe liver damage; of those, 15 percent died due to their injuries. Of those with less severe injuries, almost 8 percent died. When patients had worn a seatbelt, they were 21 percent less likely to have suffered a severe liver injury. When they had both a seatbelt and airbag installed, they were 26 percent less likely to have that critical of an injury. While the use of an airbag appeared to boost safety for seatbelt wearers, using an airbag alone did not present a lower frequency of severe liver damage.<\/p>\n<p>Even wearing a seatbelt, however, does not protect against all the damage that can be done by a negligent or dangerous driver. Car accident victims who were injured in a crash due to another&#8217;s behavior can consult with <a href=\"\/auto-accident-injuries\/car-accidents\/\">Columbus, Ohio, auto accident injuries compensation attorneys<\/a>, who might be able to help them to pursue compensation for the damages suffered.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ohio drivers may take steps to protect themselves from the damage caused by car accidents by buckling up behind the wheel. Research has found that wearing a seatbelt could help decrease the severity of liver injuries incurred in car crashes. However, wearing a seatbelt cannot eliminate the risk of damage to the liver in a collision, and the costs of&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46870"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46870"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46870\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46870"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46870"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46870"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}