{"id":46873,"date":"2018-05-30T00:00:00","date_gmt":"2018-05-30T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/05\/patient-matching-a-crucial-factor-in-healthcare-sector\/"},"modified":"2021-05-24T09:30:22","modified_gmt":"2021-05-24T13:30:22","slug":"patient-matching-a-crucial-factor-in-healthcare-sector","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/05\/patient-matching-a-crucial-factor-in-healthcare-sector\/","title":{"rendered":"Patient matching a crucial factor in healthcare sector"},"content":{"rendered":"<p>Residents of Ohio who are familiar with the private healthcare sector should be aware of current issues regarding the exchange of patient data. Patient matching errors are a major source of malpractice claims because they can result in patients suffering wrong-site surgeries or being prescribed the wrong medication. They could also result in a condition going undiagnosed or being diagnosed after a critical delay.<\/p>\n<p>In response to this issue, a group of <a href=\"https:\/\/ehrintelligence.com\/news\/health-information-exchange-hindered-by-patient-matching-issues\" target=\"_blank\" rel=\"noopener noreferrer\">33 stakeholders<\/a> in the healthcare sector, including the American Medical Association and the American Health Information Management Association, have sent a letter to the House and Senate Committees on Appropriations. Among other things, the letter urges Congress to include language in any future appropriations bills for fiscal year 2019 that can help end patient matching errors.<\/p>\n<p>The stakeholders also call for a consistent patient matching strategy for the electronic exchange of patient data. Electronic exchange is becoming standard ever since the HITECH Act mandated that healthcare organizations adopt the use of electronic health records. Duplicate EHRs have become an issue as well, but implementing an enterprise master patient index tool could reduce these.<\/p>\n<p>On average, 33 percent of denied claims against healthcare organizations like hospitals and LTPAC facilities are based on inaccurate patient identification or incorrect data. Every year, these claims cost the organizations approximately $6 billion.<\/p>\n<p>Victims of a delayed diagnosis, a misdiagnosis or some other form of medical malpractice may want to see if they&#8217;re eligible for compensation. A <a href=\"\/medical-malpractice\/\">malpractice attorney<\/a> might provide a case evaluation, bringing in third-party medical experts to determine the extent of the injuries, both short- and long-term effects, and estimating a fair settlement. The attorney may also request that the local medical board conduct an inquiry. Victims may be able to leave all negotiations up to their attorney and take their case to court if negotiations fall through. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Residents of Ohio who are familiar with the private healthcare sector should be aware of current issues regarding the exchange of patient data. Patient matching errors are a major source of malpractice claims because they can result in patients suffering wrong-site surgeries or being prescribed the wrong medication. They could also result in a condition going undiagnosed or being diagnosed&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46873"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46873"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46873\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46873"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46873"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46873"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}