{"id":46876,"date":"2018-05-15T00:00:00","date_gmt":"2018-05-15T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/05\/nursing-home-neglect-can-sometimes-have-deadly-consequences\/"},"modified":"2021-03-26T14:24:08","modified_gmt":"2021-03-26T19:24:08","slug":"nursing-home-neglect-can-sometimes-have-deadly-consequences","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/05\/nursing-home-neglect-can-sometimes-have-deadly-consequences\/","title":{"rendered":"Nursing home neglect can sometimes have deadly consequences"},"content":{"rendered":"<p>When you decide that your loved one requires more care than you can provide yourself, it is only natural that you consider a nursing home or elderly care facility. These facilities can provide the around-the-clock care that people with serious physical disabilities and those with declining mental faculties require. Unfortunately, many of these facilities are for-profit institutions, which can end up impacting the level of care residents receive.<\/p>\n<p>Even nursing homes with excellent care records can create situations that endanger the residents. Hiring for physically demanding work but paying very little or intentionally maintaining the lowest level of staff possible are common practices. These hiring and staffing decisions can directly impact the level of care that residents receive. In some cases, corner-cutting and minimal staffing can lead to severe cases of neglect or even active abuse of nursing home residents.<\/p>\n<p><strong>Scabies case from Georgia a terrible wake-up call<\/strong><\/p>\n<p>For those who have loved ones in a nursing home, the worst-case scenario is one in which your loved one ends up hurt or even dead due to the neglect or abuse of the staff. The family of a WWII model has recently filed a lawsuit against a nursing care facility in Georgia due to the horrific death of their mother.<\/p>\n<p>The <a href=\"https:\/\/www.usatoday.com\/story\/money\/nation-now\/2018\/04\/28\/former-model-eaten-alive-scabies-georgia-nursing-home\/561394002\/\" target=\"_blank\" rel=\"noopener noreferrer\">93-year-old resident<\/a> died from &#8220;septicemia due to crusted scabies&#8221; according to the autopsy report. The lawsuit filed by her children reads like something out of a horror story. The woman, who suffered from dementia, went into a nursing care facility. While there, she suffered a scabies infestation. Scabies are tiny mites that burrow into human skin. They are highly contagious but also treatable.<\/p>\n<p>In this case, however, staff did not treat her for the condition. Instead, it progressed until an estimated hundreds of millions of scabies were living off of her body. She likely suffered extreme pain over the course of months or even several years as the infestation progressed. By the time she was dying, one of her hands had turned black. Staff received instructions to not touch it, out of fear it could actually fall off.<\/p>\n<p><strong>Residents deserve a clean and safe living space and adequate care<\/strong><\/p>\n<p>There is no question that caring for the elderly, especially those with dementia, is challenging. However, the difficulty and demand of that care is why families entrust nursing homes with their loved ones in their later years. When those facilities fail to maintain a proper standard of care and cleanliness, the residents often end up paying the price.<\/p>\n<p>Those who suspect that neglect or understaffing are resulting in harm to a loved one should <a href=\"\/blog\/2017\/08\/defending-the-rights-of-a-relative-in-a-nursing-home\/\">take steps to address the issue<\/a>. If the facility does not immediately address these kinds of concerns, you may need to arrange for your loved one to move to another facility. In some cases, a lawsuit can be a means of recovering losses related to medical care in situations of nursing home neglect.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you decide that your loved one requires more care than you can provide yourself, it is only natural that you consider a nursing home or elderly care facility. These facilities can provide the around-the-clock care that people with serious physical disabilities and those with declining mental faculties require. Unfortunately, many of these facilities are for-profit institutions, which can end&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46876"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46876"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46876\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46876"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46876"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46876"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}