{"id":46885,"date":"2018-04-04T00:00:00","date_gmt":"2018-04-04T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/04\/software-shows-potential-to-reduce-radiology-errors\/"},"modified":"2021-05-24T09:30:48","modified_gmt":"2021-05-24T13:30:48","slug":"software-shows-potential-to-reduce-radiology-errors","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/04\/software-shows-potential-to-reduce-radiology-errors\/","title":{"rendered":"Software shows potential to reduce radiology errors"},"content":{"rendered":"<p>Accurate diagnoses for medical patients in Ohio often relies on the results of tests like ultrasounds and X-rays. A research team that studied the efficacy of a software system meant to catch data entry errors made by radiologists and sonographers found significant potential to reduce mistakes that could lead to a misdiagnosis and delayed or ineffective treatment. <\/p>\n<p>The results as published in the Journal of the American College of Radiology showed that the software caught errors in <a href=\"http:\/\/www.healthimaging.com\/topics\/imaging-informatics\/radiology-software-can-save-1m-reduce-errors-bone-density-imaging\" target=\"_blank\" rel=\"noopener noreferrer\">6 to 28 percent<\/a> of ultrasound or radiology reports. The system also improved efficiency by shortening the time that practitioners spent making reports. This would result in labor savings for medical institutions. <\/p>\n<p>Although many of the errors that the researchers identified were relatively minor, they still could lead to negative consequences for patients. Radiology report errors are a source of lawsuits when they cause physicians to misdiagnose illnesses or mismanage treatments. When physicians fail to properly diagnose a medical problem, the patient&#8217;s condition could worsen. This scenario often causes a patient to endure longer and more expensive hospitalizations. <\/p>\n<p>When a patient suffers harm because of medical errors or negligence on the part of a physician or hospital, legal assistance might prove beneficial. Medical malpractice cases face high standards of proof in the legal system, and <a href=\"\/medical-malpractice\/\">Columbus, Ohio, medical malpractice injury lawyers<\/a> could gather evidence to support a lawsuit. Access to independent medical experts provided by a lawyer could allow the patient to present a strong case. After filing court papers, a lawyer could open negotiations with the medical provider and its insurer. If this effort does not produce an acceptable settlement, then the case could be presented in court.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Accurate diagnoses for medical patients in Ohio often relies on the results of tests like ultrasounds and X-rays. A research team that studied the efficacy of a software system meant to catch data entry errors made by radiologists and sonographers found significant potential to reduce mistakes that could lead to a misdiagnosis and delayed or ineffective treatment. The results as&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46885"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46885"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46885\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46885"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46885"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46885"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}