{"id":46891,"date":"2018-04-13T00:00:00","date_gmt":"2018-04-13T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/04\/self-driving-cars-still-affected-by-human-problems\/"},"modified":"2021-05-24T09:12:44","modified_gmt":"2021-05-24T13:12:44","slug":"self-driving-cars-still-affected-by-human-problems","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/04\/self-driving-cars-still-affected-by-human-problems\/","title":{"rendered":"Self-driving cars still affected by human problems"},"content":{"rendered":"<p>Autonomous vehicle technology is exciting to many people in Ohio because of the futuristic potential it presents for self-driving cars and a world without auto accidents. Car accidents can be costly and dangerous, causing severe injuries and even deaths; most are attributable to human error behind the wheel. Automated vehicles present the opportunity for a future of cars that are free of these human failings. At the same time, others warn of technological problems that could prove to be equally unsafe.<\/p>\n<p>One engineering professor at Arizona State University says there is reason to be cautious about the safety potential of self-driving vehicles, but not because of any inherent problems with the technology. Autonomous cars are being developed in order to replicate as closely as possible the human experience of driving a car.However, he notes, it is human driving that leads to <a href=\"https:\/\/www.insurancejournal.com\/news\/national\/2018\/03\/29\/484726.htm\" target=\"_blank\" rel=\"noopener noreferrer\">car accidents<\/a>, while a fully automated vehicle could use other, less human ways of determining safety when operating.<\/p>\n<p>The professor commented after the first reported pedestrian fatality involving a self-driving car being operated as part of a test program. He noted that while the vehicle was unlikely to be at fault in the accident, even this type of crash could be largely prevented by taking a less human approach to the road. For example, rather than assuming that the road is clear if an obstacle is not sensed, an autonomous vehicle could assume the road is always blocked until a clear road is sensed.<\/p>\n<p>Today, however, the vast majority of devastating car accidents are caused directly by human drivers engaging in dangerous or negligent behavior behind the wheel, and the consequences can be severe. People who have been injured in a crash due to no fault of their own may benefit from speaking with <a href=\"\/auto-accident-injuries\/car-accidents\/\">Columbus, Ohio, auto accident injuries compensation attorneys<\/a>. An attorney might be able to help them to pursue compensation for their medical bills, lost wages and other damages.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Autonomous vehicle technology is exciting to many people in Ohio because of the futuristic potential it presents for self-driving cars and a world without auto accidents. Car accidents can be costly and dangerous, causing severe injuries and even deaths; most are attributable to human error behind the wheel. Automated vehicles present the opportunity for a future of cars that are&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46891"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46891"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46891\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46891"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46891"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46891"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}