{"id":46897,"date":"2018-04-24T00:00:00","date_gmt":"2018-04-24T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/04\/consider-any-injury-settlement-carefully-before-accepting\/"},"modified":"2021-03-26T14:25:04","modified_gmt":"2021-03-26T19:25:04","slug":"consider-any-injury-settlement-carefully-before-accepting","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/04\/consider-any-injury-settlement-carefully-before-accepting\/","title":{"rendered":"Consider any injury settlement carefully before accepting"},"content":{"rendered":"<p>After suffering a serious injury, you may find it overwhelming to stay on top of the settlement process while also working through your own physical recovery. This is a normal, expected part of the process, but one that often results in victims accepting settlement terms that do not fairly compensate them for their losses.<\/p>\n<p>Insurance companies understand that victims often cannot fairly represent themselves and also deal with their physical recovery, and regularly use this to their own advantage. It is important to remember that although insurance companies provide an important service to victims, they are primarily concerned with their own bottom lines and will choose their own profits over the well-being of a victim nearly every time if given the opportunity. This is not necessarily &#8220;wrong,&#8221; but it does not serve the interests of victims.<\/p>\n<p>If you recently suffered an injury and are now facing the settlement process, it is important to approach settlement negotiations with a clear mind and an understanding of what you deserve and what you should expect from an offer. In most cases, the initial offer is not going to <a href=\"\/auto-accident-injuries\/\">fully compensate your losses and suffering<\/a>, and it may take time for the paying party to come to the table with a truly fair settlement.<\/p>\n<p><strong>Consider the full scope of your needs<\/strong><\/p>\n<p>Many insurance companies attempt to frame themselves as the good guys by making a swift settlement offer, counting on the need of the victim to pay for mounting medical costs and other expenses. However, it is usually not possible to know just how long a recovery may take, or all the treatment that an injury may require until well after the injury occurs.<\/p>\n<p>By attempting to settle very quickly, an insurance provider may avoid paying for all of the needs of the victim. In many cases, victims feel like they cannot wait any longer to receive a settlement because of mounting expenses and accept an inferior offer due to this pressure.<\/p>\n<p><strong>Remember that it is a negotiation<\/strong><\/p>\n<p>A settlement offer is just that — an offer. If you recently received an offer, you almost certainly have the option to refuse it and make a counterproposal. Unfortunately, for many victims, their own unfamiliarity with the claim process and the course of recovery keeps them shortsighted about their own needs.<\/p>\n<p><a href=\"https:\/\/injury.findlaw.com\/car-accidents\/car-insurance-claims-dos-and-don-ts.html\" target=\"_blank\" rel=\"noopener noreferrer\">Before you accept any offer<\/a>, be sure to scrutinize it carefully to ensure that you understand exactly what it provides, and, more importantly, what it does not. Your recovery and ongoing treatment may last months or even years, and a strong offer should account for your future needs, not only your existing medical bills and lost income.<\/p>\n<p><strong>Use all of your resources<\/strong><\/p>\n<p>Recovering from an injury is often a much more involved, lengthy process than you might expect. Be mindful to use all the resources that you have available to examine your needs and future concerns before you accept or counter any offer. In many cases, you have more options than you realize, and may simply need time or personalized guidance to see the full extent of what a settlement offer should provide.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After suffering a serious injury, you may find it overwhelming to stay on top of the settlement process while also working through your own physical recovery. This is a normal, expected part of the process, but one that often results in victims accepting settlement terms that do not fairly compensate them for their losses. Insurance companies understand that victims often&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46897"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46897"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46897\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46897"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46897"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46897"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}