{"id":46900,"date":"2018-03-15T00:00:00","date_gmt":"2018-03-15T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/03\/your-child-should-always-see-a-doctor-after-any-car-accident\/"},"modified":"2021-03-26T14:27:55","modified_gmt":"2021-03-26T19:27:55","slug":"your-child-should-always-see-a-doctor-after-any-car-accident","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/03\/your-child-should-always-see-a-doctor-after-any-car-accident\/","title":{"rendered":"Your child should always see a doctor after any car accident"},"content":{"rendered":"<p>After a child experiences a car accident, he or she may not feel any pain or have any visible injuries, but that does not necessarily mean the child is unharmed from the experience. In many cases, car accidents can inflict injuries on the body that do not cause pain immediately, meaning that a child (or an adult, for that matter) may not realize that he or she actually has an injury that may cause serious complications, some of which can prove fatal.<\/p>\n<p>Furthermore, children of any age may not have the ability to clearly understand or communicate certain pain or sensations, or may feel unexpected pressures to avoid talking about some pain. It is also possible that a child may say he or she has pain or discomfort when this is not the case, for some unrelated reason.<\/p>\n<p>In order to ensure that your child truly is safe from harm and help avoid or mitigate future suffering or complications, it is always wise to have the child examined by a medical professional as soon as you can after an accident. Ideally, you should so within 24 hours. With any luck, your child is fine and did not suffer serious injuries, but if an injury did occur, you&#8217;ll be glad you took action sooner rather than later.<\/p>\n<p><strong>Dangerous abdominal pain<\/strong><\/p>\n<p>Both internal bleeding and organ damage <a href=\"http:\/\/injury.findlaw.com\/car-accidents\/what-if-my-pain-after-a-car-accident-was-delayed.html\" target=\"_blank\" rel=\"noopener noreferrer\">may not cause pain at first<\/a>, but can quickly develop into life threatening conditions. Internal bleeding poses the same potential harm of external bleeding, but is not visually obvious. If a victim loses too much blood too quickly, the blood loss itself may prove fatal. However, even minor internal bleeding is potentially life-threatening if the site of bleeding develops an infection, which is very common without proper, timely treatment. Should the infection grow, it will spread through the bloodstream to other organs in the body, and may kill the victim.<\/p>\n<p>Similarly, organ damage may not cause pain at first, but the body can usually only keep operating the organ for so long without it functioning fully. Unless the organ receives proper medical treatment, it will likely fail, and may prove painfully deadly.<\/p>\n<p><strong>Head, neck and back injuries<\/strong><\/p>\n<p>Other injuries may not present life threatening consequences, but can cause ongoing suffering and even long-term disability. For instance, whiplash may affect the musculature of the neck, back and torso, but may not cause pain in a victim until hours or even days later. Unfortunately, once the muscles do respond to the injury, it can be devastating and even feel paralyzing to the victim until it subsides.<\/p>\n<p>A spinal injury may pinch or sever nerves within the spinal column, which may not produce pain at first, but may soon express numbness and tingling in the victim&#8217;s arms, legs, feet and hands.<\/p>\n<p>If the accident involves a blow to the head, it can produce a mild brain injury. These injuries are particularly harmful to children, whose brains are much more pliable and may suffer greater difficulties during recovery.<\/p>\n<p><strong>Protect your child as soon as you can<\/strong><\/p>\n<p>Professional medical care following an accident is only the first part of protecting the child you love. If some other party is responsible for the account through their actions or negligence, you may have legal grounds to file a personal injury claim.<\/p>\n<p>A well-constructed personal injury claim reflects the full scope of the legal and financial issues at hand after a car accident, and uses the strength of the law to <a href=\"\/auto-accident-injuries\/\">protect the rights of your child<\/a>, ensuring that you have the tools and resources needed to help the one you love recover and thrive after suffering an injury.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After a child experiences a car accident, he or she may not feel any pain or have any visible injuries, but that does not necessarily mean the child is unharmed from the experience. In many cases, car accidents can inflict injuries on the body that do not cause pain immediately, meaning that a child (or an adult, for that matter)&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46900"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46900"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46900\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46900"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46900"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46900"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}