{"id":46918,"date":"2018-03-30T00:00:00","date_gmt":"2018-03-30T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/03\/a-mild-brain-injury-may-disrupt-your-childs-college-education\/"},"modified":"2021-03-26T14:25:57","modified_gmt":"2021-03-26T19:25:57","slug":"a-mild-brain-injury-may-disrupt-your-childs-college-education","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/03\/a-mild-brain-injury-may-disrupt-your-childs-college-education\/","title":{"rendered":"A mild brain injury may disrupt your child’s college education"},"content":{"rendered":"<p>Some young people experience serious car accidents during their time in college. Sadly, it&#8217;s often due to intoxicated driving. If not properly prepared for the aftermath, their education may suffer greatly. Not only do these accident pose serious threats to the health of the young person who experiences it, some of the effects of the accident may threaten his or her educational goals in ways that are difficult to anticipate.<\/p>\n<p>Any car accident may involve a blow to the head that results in a mild traumatic brain injury, even in instances when the victim does not recall experiencing a blow to the head. This is part of why it is important to seek out a professional medical examination following any significant car accident. Not only may a victim receive injuries that do not produce pain immediately, if the victim receives a mild TBI, the symptoms may not present themselves for days or weeks, and may wreak havoc on a young person&#8217;s educational career.<\/p>\n<p>Professional legal counsel offers important assistance during a car accident recovery, allowing the victim to focus on the physical work of getting better, and helping those in the vicmc&#8217;s community, including school officials, understand the severity of the injuries the victim suffered, ensuring that the institution gives the victim appropriate considerations to <a href=\"\/auto-accident-injuries\/\">keep his or her educational goals on track<\/a>.<\/p>\n<p><strong>Effects of a mild TBI<\/strong><\/p>\n<p>A mild TBI can present <a href=\"http:\/\/www.traumaticbraininjury.com\/symptoms-of-tbi\/mild-tbi-symptoms\/\" target=\"_blank\" rel=\"noopener noreferrer\">many different symptoms<\/a>, some of which do not immediately manifest themselves. Without proper diagnosis and treatment, a victim may not understand or even recognize that he or she acts differently and responds to tense situations differently than before the accident.<\/p>\n<p>College is hard enough for students in the current educational climate, but a student who suffers a mild TBI is truly at a dangerous disadvantage. These injuries may cause a person to suddenly lose the ability to concentrate and retain new information well, and may cause them to react to these frustrations with erratic behavior.<\/p>\n<p>This may mean that student cannot focus on learning new material, either in a lecture or while studying, and may react irrationally and violently when they cannot perform what were simple or familiar tasks before the accident.<\/p>\n<p>These injuries also regularly affect the way that a victim interprets things he or she reads or hears in conversation or in a lecture. While a victim may not lose any understanding of basic vocabulary, the injury may remove the victim&#8217;s ability to understand the contextual meaning of a sentence. This can lead to repeated misunderstandings, which is an enormous hinderance in an educational setting.<\/p>\n<p>Furthermore, this injury can significantly alter the victim&#8217;s personality, usually causing volatile behavior and poor social interactions that may compromise the victim&#8217;s ability to form and maintain community, which is a fundamental component of attending college.<\/p>\n<p><strong>Act quickly to protect the student you love<\/strong><\/p>\n<p>After any significant car accident, it is crucial to seek professional medical care. Timely intervention after a mild traumatic brain injury can help the victim understand what to expect and can help the victim&#8217;s social support system and educators understand the very real medical issues at hand. This will allow them to appropriately address the matter without harming the student&#8217;s education unfairly.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Some young people experience serious car accidents during their time in college. Sadly, it&#8217;s often due to intoxicated driving. If not properly prepared for the aftermath, their education may suffer greatly. Not only do these accident pose serious threats to the health of the young person who experiences it, some of the effects of the accident may threaten his or&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46918"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46918"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46918\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46918"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46918"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46918"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}