{"id":46915,"date":"2018-03-06T00:00:00","date_gmt":"2018-03-06T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/03\/lawsuit-challenges-agencys-attempt-to-detect-drowsy-drivers\/"},"modified":"2021-05-24T10:17:25","modified_gmt":"2021-05-24T14:17:25","slug":"lawsuit-challenges-agencys-attempt-to-detect-drowsy-drivers","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/03\/lawsuit-challenges-agencys-attempt-to-detect-drowsy-drivers\/","title":{"rendered":"Lawsuit challenges agency&#8217;s attempt to detect drowsy drivers"},"content":{"rendered":"<p>Accidents caused by truck driver fatigue can be a major concern for people on the highways in Ohio and across the United States. Truck drivers work long shifts and drive monotonously for hours across the highway; many more perform their work in overnight hauls, which could increase the danger of drowsy driving. Drowsy driving can have a range of causes, including a medical condition called sleep apnea. When untreated, sleep apnea prevents sufferers from receiving a full night&#8217;s sleep and could lead to dangerously drowsy driving.<\/p>\n<p>Detecting sleep apnea that could lead to truck driver fatigue is a public health concern. However, an industry association is in conflict with a federal agency about how regulations for testing are implemented. The Owner-Operator Independent Driver Association, or OOIDA, is suing the Federal Motor Carrier Safety Administration, or FMCSA, arguing that a 2015 regulation it created for medical examinations for truck drivers violated a 2013 law. This law requires the FMCSA to seek public comment before creating any new rules for drivers&#8217; sleep apnea testing.<\/p>\n<p>However, the FMCSA argues that its regulation does not violate the law as it only reflected exiting rules for sleep apnea testing that predated the 2013 law. In January 2018, a federal appeals court panel sided with the FMCSA. However, the OOIDA is now seeking to have its case reconsidered by all 12 judges on the court.<\/p>\n<p>Sleep apnea and other causes of drowsy truck driving can pose a real risk to truck drivers themselves and others on the road. Collisions with a semi-truck or tractor-trailer can be devastating and lead to severe, lifelong personal injuries. People who have been injured in a truck accident due to another driver&#8217;s dangerous or negligent behavior may wish to seek assistance from <a href=\"\/auto-accident-injuries\/truck-accidents\/\">truck accident injury lawyers<\/a>. An attorney may be able to help accident victims pursue compensation for the losses they have suffered as a result. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Accidents caused by truck driver fatigue can be a major concern for people on the highways in Ohio and across the United States. Truck drivers work long shifts and drive monotonously for hours across the highway; many more perform their work in overnight hauls, which could increase the danger of drowsy driving. Drowsy driving can have a range of causes,&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46915"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46915"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46915\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46915"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46915"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46915"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}