{"id":46921,"date":"2018-02-14T00:00:00","date_gmt":"2018-02-14T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/02\/steps-to-take-if-your-medical-device-gets-recalled\/"},"modified":"2021-03-26T14:29:41","modified_gmt":"2021-03-26T19:29:41","slug":"steps-to-take-if-your-medical-device-gets-recalled","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/02\/steps-to-take-if-your-medical-device-gets-recalled\/","title":{"rendered":"Steps to take if your medical device gets recalled"},"content":{"rendered":"<p>Many of us depend on medical devices to keep us healthy and active, and when a device malfunctions or presents and unanticipated hazard the results can prove disastrous. In some cases, a device poses a serious enough threat that the Food and Drug Administration (FDA) or the device manufacturer may issue a recall, asking users to turn in the device to receive a replacement and possibly other benefits.<\/p>\n<p>If you <a href=\"http:\/\/injury.findlaw.com\/product-liability\/drugs-and-medical-device-recalls.html\" target=\"_blank\" rel=\"noopener noreferrer\">receive a recall notice<\/a> on a medical device, you must act quickly to protect your own well-being and make sure that the recall does not affect your health. You may also face out-of-pocket expenses and other setbacks, which may take time to iron out. Be sure that you understand all your rights in such a situation and create a plan to keep yourself and your health protected.<\/p>\n<p><strong>Speak to your doctor first<\/strong><\/p>\n<p>The most immediate concern for anyone who faces a recall of a medical device is how the recall may impact their ongoing care. As soon as you receive the recall notice, be sure to speak with your doctor.<\/p>\n<p>Your doctor can help you understand the dangers of the device and assess the options you have for replacing the device and ensuring that your care does not suffer. It is common for a manufacturer who issues a recall to offer a replacement, but this can take time.<\/p>\n<p><strong>Speak with your insurance provider<\/strong><\/p>\n<p>Your insurance provider needs to understand how the recall affects you. There is a high likelihood that the recall may present some hiccups in your ongoing care, and may even present health risks. Your insurer may have ways of helping you remain safe during this time, and may even cover some of the expense you face because of the recall.<\/p>\n<p>Unfortunately, some insurers are not as user-friendly as others, and may push back against any extra expenses, claiming they are not responsible for some of the additional expenses. It is important to have a detailed understanding of your policy when addressing any issues with your insurer.<\/p>\n<p><strong>Legal guidance may prove useful<\/strong><\/p>\n<p>In some cases, the parties supposedly responsible for your care do not uphold their duties and may attempt to claim that any complications or unanticipated expenses brought on by the recall should fall to someone else.<\/p>\n<p>This is often a frightening and stressful situation, and it is important to remember that you do not have to resolve these issues by yourself. An experienced attorney understands how to help you deal with every party in a recall case, <a href=\"\/other-practice-areas\/product-liability\/\">keeping your care secure<\/a> and your rights protected.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many of us depend on medical devices to keep us healthy and active, and when a device malfunctions or presents and unanticipated hazard the results can prove disastrous. In some cases, a device poses a serious enough threat that the Food and Drug Administration (FDA) or the device manufacturer may issue a recall, asking users to turn in the device&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46921"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46921"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46921\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46921"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46921"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46921"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}