{"id":46939,"date":"2018-01-09T00:00:00","date_gmt":"2018-01-09T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/01\/study-shows-male-dermatologists-more-likely-to-be-sued\/"},"modified":"2021-05-24T09:31:55","modified_gmt":"2021-05-24T13:31:55","slug":"study-shows-male-dermatologists-more-likely-to-be-sued","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/01\/study-shows-male-dermatologists-more-likely-to-be-sued\/","title":{"rendered":"Study shows male dermatologists more likely to be sued"},"content":{"rendered":"<p>JAMA Dermatology released a study in December 2017 that all dermatologists in Ohio, male and female, may find interesting. The authors analyzed 90,743 malpractice claims that had since been closed and found that male physicians were more likely to be sued than female. Out of the 1,084 claims filed against dermatologists, nearly 70 percent were filed against male dermatologists.<\/p>\n<p>Researchers concluded that the reason for this is because female physicians are better communicators and tend to be more proactive in giving reassurance, listening to patient input and eliciting further input. Patient-centered communication has generally been found to increase patient satisfaction.<\/p>\n<p>Dyschromia, or skin and nail discoloration, formed the basis for most malpractice claims against dermatologists. The majority of victims accused their dermatologist of medical errors from skin operations; the second most common claim was misdiagnosis. The study noted that between 1991-1995 and 2011-2015, paid claims for dermatologists and other specialists had dropped by 29 percent.<\/p>\n<p>It is up for speculation whether wrong-site surgeries or the lack of informed consent are responsible for the medical errors and misdiagnoses. Having a physician extender on staff also has its pros and cons: While extenders are not sued as often as physicians, they tend to increase liability when they do anything involving lasers. Focusing on biopsy limitations is one way for dermatologists to address greater concerns.<\/p>\n<p>These are the kind of things that lawyers consider when consulting with victims of a <a href=\"\/medical-malpractice\/\">medical malpractice injury<\/a>. A lawyer may be able to assess the validity of the claim by determining if there was a preexisting patient-doctor relationship, if the doctor was negligent, if the doctor failed to inform the patient about possible risks and other important factors. A lawyer might hire investigators with medical expertise to build up the proof. They may then either negotiate for a settlement or take their client&#8217;s case to court.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>JAMA Dermatology released a study in December 2017 that all dermatologists in Ohio, male and female, may find interesting. The authors analyzed 90,743 malpractice claims that had since been closed and found that male physicians were more likely to be sued than female. Out of the 1,084 claims filed against dermatologists, nearly 70 percent were filed against male dermatologists. Researchers&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46939"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46939"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46939\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46939"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46939"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46939"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}