{"id":46930,"date":"2018-02-07T00:00:00","date_gmt":"2018-02-07T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/02\/knee-surgery-patients-at-risk-of-misdiagnosis\/"},"modified":"2021-05-24T09:31:16","modified_gmt":"2021-05-24T13:31:16","slug":"knee-surgery-patients-at-risk-of-misdiagnosis","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/02\/knee-surgery-patients-at-risk-of-misdiagnosis\/","title":{"rendered":"Knee surgery patients at risk of misdiagnosis"},"content":{"rendered":"<p>For people in Ohio who have had major knee surgery, they may not only face extensive pain and a complex recovery period, but they might also be at risk of misdiagnosis for persistent and unexplained pain. When physicians use older criteria to make a diagnosis of complex regional pain syndrome, or CPRS, this can mean that some people who received a knee replacement may be inaccurately diagnosed with CPRS as the cause of excessive post-surgical pain. This could actually leave patients suffering longer and with greater pain.<\/p>\n<p>Total knee replacement replaces a failing knee joint with prosthetic pieces. It is a major <a href=\"https:\/\/www.clinicalpainadvisor.com\/neuropathic-pain\/crps-2007-budapest-criteria-misdiagnosis-neuropathic-pain-total-knee-arthroplasty\/article\/741000\/\" target=\"_blank\" rel=\"noopener noreferrer\">surgical procedure<\/a> that generally requires inpatient hospitalization and carries a significant recovery time. Such surgery is always painful during recovery, but some patients experience unexplained pain that is excessive and severe. Sometimes, this is diagnosed as CPRS, but that diagnosis could be incorrect.<\/p>\n<p>In the study, researchers examined 100 patients six weeks after their operation for total knee arthroplasty. When physicians used older guidelines to diagnose the patients, eight could receive a CPRS diagnosis. However, when they used the most recent 2007 guidelines to make their diagnosis, none of the patients was identified as having CPRS. Five of the eight people with remaining unexplained pain were found to be suffering from neuropathic pain. If they received a misdiagnosis of CPRS instead, they could receive incorrect treatments and not receive necessary care that is effective in alleviating neuropathic pain.<\/p>\n<p>Medical misdiagnosis can lead to a worsened health condition; the failure to diagnose progressive diseases like cancer may even impose a lengthy and damaging waiting period before patients receive treatment for their correct illness. For people who have been misdiagnosed, <a href=\"\/medical-malpractice\/\"> medical malpractice injury lawyers<\/a> may be able to review their case and provide representation in seeking compensation for the damages they have suffered as a result of the medical mistake.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For people in Ohio who have had major knee surgery, they may not only face extensive pain and a complex recovery period, but they might also be at risk of misdiagnosis for persistent and unexplained pain. When physicians use older criteria to make a diagnosis of complex regional pain syndrome, or CPRS, this can mean that some people who received&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46930"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46930"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46930\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46930"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46930"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46930"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}