{"id":46936,"date":"2018-02-01T00:00:00","date_gmt":"2018-02-01T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/02\/can-i-sue-a-hospital-for-medical-malpractice\/"},"modified":"2021-03-26T14:31:05","modified_gmt":"2021-03-26T19:31:05","slug":"can-i-sue-a-hospital-for-medical-malpractice","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/02\/can-i-sue-a-hospital-for-medical-malpractice\/","title":{"rendered":"Can I sue a hospital for medical malpractice?"},"content":{"rendered":"<p>When a patient suffers unnecessary harm as a part of medical care, it is often appropriate to consider filing a medical malpractice suit to compensate the victim for his or her losses and medical costs.<\/p>\n<p>When the public speaks about medical malpractice, they often think of suing a practitioner, but that&#8217;s not always the most effective avenue, or may be only one of several liable parties. In some cases, a medical malpractice suit may involve a hospital that bears liability. In fact, hospitals may find themselves liable for medical malpractice both directly and indirectly.<\/p>\n<p>If you suspect that you may have grounds to <a href=\"http:\/\/injury.findlaw.com\/medical-malpractice\/medical-malpractice-who-can-be-sued-.html\" target=\"_blank\" rel=\"noopener noreferrer\">sue a hospital for malpractice<\/a>, it is important to fully understand how a hospital may hold liability for your case. A malpractice attorney can help you assess your experience and identify strong strategies to seek fair compensation and <a href=\"\/medical-malpractice\/\">keep your rights protected<\/a>.<\/p>\n<p><strong>Suing a hospital for negligence<\/strong><\/p>\n<p>A hospital is usually not like a flea market where only individual practitioners perform their work. The individuals who work in hospitals are all hired by the hospital to perform their given job, and the hospital has a responsibility to properly vet and train its employees.<\/p>\n<p>If a hospital fails to maintain safe facilities or encourage safe practices, or if it fails to properly research the qualifications of an employee, it may face liability for injuries that these failings cause.<\/p>\n<p><strong>Suing a hospital under vicarious liability <\/strong><\/p>\n<p>Vicarious liability is a legal principle that shoulders employers with responsibility for their employees&#8217; actions. In many different industries and settings, the negligent actions or mistakes of employees and the damages caused are the legal responsibility employers.<\/p>\n<p>If an employee of the hospital injures a patient, then the patient may choose to sue the hospital for medical malpractice.<\/p>\n<p>However, there are some instances where individual practitioners may perform work in a hospital while not actually employed by the hospital. In theses instances, the offending party may work as an independent contractor in some capacity. This may spare the hospital from liability.<\/p>\n<p>If the offending party is not an employee of the hospital, then the hospital does not hold vicarious liability, and a victim may not sue them for medical malpractice. It is crucial to understand these small distinctions as you assess your legal options.<\/p>\n<p>There are many ways to approach medical malpractice suits, so be sure that you understand all the nuances of pursuing a medical malpractice claim as you consider all your options moving forward.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When a patient suffers unnecessary harm as a part of medical care, it is often appropriate to consider filing a medical malpractice suit to compensate the victim for his or her losses and medical costs. When the public speaks about medical malpractice, they often think of suing a practitioner, but that&#8217;s not always the most effective avenue, or may be&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46936"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46936"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46936\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46936"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46936"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46936"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}