{"id":46945,"date":"2018-01-17T00:00:00","date_gmt":"2018-01-17T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/01\/how-people-might-help-to-prevent-surgical-errors\/"},"modified":"2021-05-24T09:31:42","modified_gmt":"2021-05-24T13:31:42","slug":"how-people-might-help-to-prevent-surgical-errors","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/01\/how-people-might-help-to-prevent-surgical-errors\/","title":{"rendered":"How people might help to prevent surgical errors"},"content":{"rendered":"<p>People in Ohio who are scheduled for surgery may want to take steps to help to protect themselves from the potential for surgical errors. Doctors are not infallible, and they sometimes make mistakes. By getting involved in their medical care, patients may be able to help to prevent surgical mistakes.<\/p>\n<p>People should make certain that they understand their treatment options and the risks that are involved with them. They should ask questions so that they can better understand what is happening and the choices that are available to them. Patients should also be thorough when they describe what is happening to them with their medical condition. They should make sure that their doctors have a complete list of all of the medications that they are taking, including over-the-counter drugs and supplements.<\/p>\n<p>It also is a good idea for patients to talk to the doctors who will be performing their surgeries. They should ask the physicians to explain the procedures to them. People may want to conduct their own research about the surgery that they are scheduled to undergo. If it is possible, they should mark the site on their bodies that will be operated on. Finally, bringing a friend or family member to the hospital the day of the surgery can help prevent mistakes from being made.<\/p>\n<p>Surgical mistakes can cause significant injuries to people. Individuals who have been harmed by mistakes that were made in surgery may benefit by consulting with experienced Columbus, Ohio, medical malpractice injury lawyers. The attorneys may work together with medical experts in order to build evidence that clearly shows fault. They may then try to help their clients recover damages that will compensate them for their losses. Lawyers may be able to negotiate settlements on behalf of their clients that fairly compensate them, or they may litigate on their behalf through trial.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>People in Ohio who are scheduled for surgery may want to take steps to help to protect themselves from the potential for surgical errors. Doctors are not infallible, and they sometimes make mistakes. By getting involved in their medical care, patients may be able to help to prevent surgical mistakes. People should make certain that they understand their treatment options&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46945"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46945"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46945\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46945"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46945"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46945"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}