{"id":46954,"date":"2018-01-15T00:00:00","date_gmt":"2018-01-15T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2018\/01\/a-mild-brain-injury-may-threaten-a-victims-manual-labor-job\/"},"modified":"2021-03-26T14:31:40","modified_gmt":"2021-03-26T19:31:40","slug":"a-mild-brain-injury-may-threaten-a-victims-manual-labor-job","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2018\/01\/a-mild-brain-injury-may-threaten-a-victims-manual-labor-job\/","title":{"rendered":"A mild brain injury may threaten a victim’s manual labor job"},"content":{"rendered":"<p>After any significant blow to the head, a person may suffer a serious brain injury. Of course, a &#8220;serious&#8221; injury may not seem like much of a big deal at the time, especially if there is no visible evidence of harm, like other injuries display.<\/p>\n<p>For those who work physically demanding jobs, the threats of a brain injury, even a mild one, are significant. Unfortunately, many manual labor jobs include superiors who take a simplistic view of these injuries and may not understand just how much harm they really cause. This can lead to great conflicts between a victim and his or her superiors in the workplace, and may cost the victim his or her job because a superior doesn&#8217;t think the injury is serious or even real.<\/p>\n<p>If you or someone you love recently received a brain injury, even if it is &#8220;mild,&#8221; it is important to treat the injury properly and seek out all the help you need to protect the victim&#8217;s rights. These injuries may affect nearly every area of the victim&#8217;s life, causing him or her to act out in ways that create conflict in the workplace and at home. Don&#8217;t hesitate to get the help you need to protect the victim&#8217;s rights and ensure that his or her immediate community and work colleagues understand just how serious the injury is.<\/p>\n<p><strong>How does a mild brain injury threaten a worker?<\/strong><\/p>\n<p>&#8220;Mild&#8221; traumatic brain injuries (TBIs) are mild in comparison to moderate or severe brain injuries, which can easily result in coma or death. While a mild TBI is unlikely to cause these kinds of threats, it still presents <a href=\"http:\/\/www.traumaticbraininjury.com\/symptoms-of-tbi\/mild-tbi-symptoms\/\" target=\"_blank\" rel=\"noopener noreferrer\">many potential difficulties<\/a>.<\/p>\n<p>A manual laborer who suffers a mild TBI may find that he or she cannot focus on simple tasks that were easy or familiar before the injury. Even following simple instructions is not always possible for these victims.<\/p>\n<p>Mild TBIs effectively &#8220;disconnect&#8221; some of the pathways within a victim&#8217;s brain, making it much more difficult and frustrating to deal with simple tasks. In addition, victims often find that their temper is much more volatile, which others may see as weak or immature behavior. While that may apply in other circumstances, mild TBI victims often have little or no control over these reactions, which is frustrating to them as well as to those around them.<\/p>\n<p>Mild TBIs may also disconnect the parts of the brain that help victims understand what they read or the conversations they have with others. While a victim may still understand all the individual words in a sentence, he or she may misinterpret the larger meaning of the sentence, leading to numerous conflicts or miscommunications.<\/p>\n<p>One can imagine how these issues, which are only some of the symptoms a mild TBI can cause, may destroy working relationships and family relationships. If a superior does not understand the nature of the injury, he or she may believe that the victim is personally to blame for the behavior, and may punish the victim unfairly or even terminate the victim&#8217;s employment.<\/p>\n<p><strong>Don&#8217;t fight for recovery alone<\/strong><\/p>\n<p>Recovering from a mild TBI can take many months, even with proper treatment. Be sure that you seek the help you need to focus on making a full recovery, while <a href=\"\/catastrophic-injuries-fatalities\/traumatic-brain-injuries\/\">keeping your legal rights and your employment protected<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After any significant blow to the head, a person may suffer a serious brain injury. Of course, a &#8220;serious&#8221; injury may not seem like much of a big deal at the time, especially if there is no visible evidence of harm, like other injuries display. For those who work physically demanding jobs, the threats of a brain injury, even a&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46954"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46954"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46954\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46954"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46954"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46954"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}