{"id":46960,"date":"2017-12-20T00:00:00","date_gmt":"2017-12-20T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2017\/12\/why-durotomy-verdicts-usually-favor-the-surgeon\/"},"modified":"2021-05-24T09:32:19","modified_gmt":"2021-05-24T13:32:19","slug":"why-durotomy-verdicts-usually-favor-the-surgeon","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2017\/12\/why-durotomy-verdicts-usually-favor-the-surgeon\/","title":{"rendered":"Why durotomy verdicts usually favor the surgeon"},"content":{"rendered":"<p>When people undergo spinal surgery, they may be at risk for developing durotomy, or tears in the outer membrane of the spinal cord. In most cases, the doctor will detect these dural tears and operate on them before they create serious problems, but when he or she does not, a case could be made for medical malpractice. Ohio residents should know, however, that malpractice claims can be tricky when they involve durotomy.<\/p>\n<p>A recent study, published in Spine journal, has illustrated this fact. After analyzing 48 durotomy claims from three different legal databases, the authors found that <a href=\"https:\/\/www.sciencedaily.com\/releases\/2017\/12\/171204112916.htm\" target=\"_blank\" rel=\"noopener noreferrer\">27 of the cases<\/a> ended with verdicts favoring the surgeon&#8217;s side. Approximately 80 percent of those victims who were denied a settlement suffered from non-neurological conditions.<\/p>\n<p>The 21 who were compensated for their injuries had a few things in common. Their injuries tended to be severe with some suffering brain damage or even death; their cases often involved a delay in diagnosis and treatment, and some of them suffered more when dural tears reopened after a failed operation. The settlement awarded to each of them averaged around $2.8 million when adjusted for inflation in 2016. The authors of the study concluded that surgeons will be favored when they detect the condition early and when it does not lead to serious, long-term issues.<\/p>\n<p>Anyone who has suffered durotomy after spinal surgery may want to consult with a <a href=\"\/medical-malpractice\/\">medical malpractice injury lawyer<\/a>. A lawyer may be able to see if the claim is a valid one, first by ensuring that there was a preexisting doctor-patient relationship and that the patient did not contribute to the injury. The lawyer may then request an inquiry from the local medical board. Once proof of negligence is established, the lawyer may proceed to negotiate for a settlement out of court or litigate if an agreement isn&#8217;t reached.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When people undergo spinal surgery, they may be at risk for developing durotomy, or tears in the outer membrane of the spinal cord. In most cases, the doctor will detect these dural tears and operate on them before they create serious problems, but when he or she does not, a case could be made for medical malpractice. Ohio residents should&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46960"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46960"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46960\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46960"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46960"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46960"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}