{"id":46986,"date":"2017-11-02T00:00:00","date_gmt":"2017-11-02T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2017\/11\/tired-truckers-could-increase-the-chance-of-a-semi-crash\/"},"modified":"2021-03-26T14:35:07","modified_gmt":"2021-03-26T19:35:07","slug":"tired-truckers-could-increase-the-chance-of-a-semi-crash","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2017\/11\/tired-truckers-could-increase-the-chance-of-a-semi-crash\/","title":{"rendered":"Tired truckers could increase the chance of a semi crash"},"content":{"rendered":"<p>Commercial trucks, like eighteen-wheelers and semitrucks, pose a substantial threat to other drivers on the road. These days, there are more commercial trucks on the road than there were in decades past, and the rate of accidents involving these vehicles is on the rise. Many times, these crashes result in catastrophic injuries or even death for the people in the smaller vehicle involved in the accident.<\/p>\n<p>No matter how carefully you drive, the potential is always there for another driver to cause a crash. When the other vehicle is a massive commercial truck, the potential for <a href=\"\/auto-accident-injuries\/truck-accidents\/\">life-altering injuries and fatalities<\/a> increases. Even in the best of situations, trucks can be dangerous companions on the road, given their large blind spots, trouble stopping quickly and wide turns. That&#8217;s why there are stricter rules for commercial drivers.<\/p>\n<p><strong>Federal hours of service laws aim to reduce crashes<\/strong><\/p>\n<p>When the driver of any vehicle feels fatigued or exhausted, the potential for a mistake or oversight increases. That risk increases when the driver has been behind the wheel for a full day and feels pressured to continue driving in order to make a delivery deadline. To reduce the number of crashes involving commercial vehicles with exhausted drivers, there are federal laws, called <a href=\"https:\/\/www.fmcsa.dot.gov\/regulations\/hours-service\/summary-hours-service-regulations\" target=\"_blank\" rel=\"noopener noreferrer\">hours of service rules<\/a>, in place.<\/p>\n<p>These rules limit how long truckers can drive without a rest, as well as the total number of hours they can drive in a day or a given period of time. For example, commercial drivers can only drive for 11 hours following a 10 consecutive hour off-duty period. These drivers may not drive after 14 hours have passed since they came on duty, regardless of any off-duty time in between.<\/p>\n<p>Commercial trucks are also limited to no more than 60 hours of driving in seven consecutive days or 70 hours in eight consecutive days. In order to restart the workday period, the driver must have at least 34 consecutive hours off-duty.<\/p>\n<p><strong>Exhaustion impacts reaction time, visibility and decision-making<\/strong><\/p>\n<p>Tired drivers can fall asleep at the wheel, which is a serious concern. Even if they stay awake, they still pose a risk to others. Getting behind the wheel while tired puts everyone else at risk of injury or death. Especially in cases with massive commercial trucks, it is critical that the driver be able to fully focus and drive as well as possible. When a human gets tired, many physical and mental processes can be compromised as a result.<\/p>\n<p>An exhausted driver may not be able to react as quickly as a well-rested one. A few seconds of extra processing time when there&#8217;s an animal darting in front of a vehicle or a car in front suddenly braking could cause a crash. So could difficulty focusing one&#8217;s eyes or having trouble thinking quickly and clearly. Everyone is safer when drivers of all vehicles feel rested when on the road.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Commercial trucks, like eighteen-wheelers and semitrucks, pose a substantial threat to other drivers on the road. These days, there are more commercial trucks on the road than there were in decades past, and the rate of accidents involving these vehicles is on the rise. Many times, these crashes result in catastrophic injuries or even death for the people in the&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46986"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46986"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46986\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46986"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46986"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46986"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}