{"id":46989,"date":"2017-11-02T00:00:00","date_gmt":"2017-11-02T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2017\/11\/this-is-what-makes-other-drivers-dangerous\/"},"modified":"2021-03-26T14:35:45","modified_gmt":"2021-03-26T19:35:45","slug":"this-is-what-makes-other-drivers-dangerous","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2017\/11\/this-is-what-makes-other-drivers-dangerous\/","title":{"rendered":"This is what makes other drivers dangerous"},"content":{"rendered":"<p>Every year it seems like manufacturers are making progress when it comes to improving safety standards in automobiles. In addition, lawmakers are passing legislation, such as bans on texting and driving, that also keep drivers and passengers safe while on the road. Unfortunately, new safety features and laws do not always do the trick.<\/p>\n<p>Many accidents occur due to the decisions that individuals make both while behind the wheel and before they even start the engine. To find out more about the some of the causes of car accidents, read further.<\/p>\n<p><strong>Drunk driving<\/strong><\/p>\n<p>Some estimates claim that there are up to 300,000 drunk driving occurrences every day. When someone operates a vehicle while under the influence of alcohol, that individual is not only endangering him- or herself, but other drivers, passengers and pedestrians.<\/p>\n<p><strong>Distracted driving<\/strong><\/p>\n<p>When people try to multitask behind the wheel, they easily become distracted. Studies have shown that people who text and drive are just as dangerous as those who drink and drive. However, distractions are not limited to cellphone use. People can become distracted due to talking to a passenger, taking in the scenery or simply changing the heater or AC settings. When a driver takes his or her eyes off the road, even for a second, an accident can occur.<\/p>\n<p><strong>Drowsiness<\/strong><\/p>\n<p>In approximately 20 percent of accidents, drowsiness is a factor. Car accidents due to fatigue are more likely to occur during overnight driving, but can also occur during the day. The issue is compounded at night due to low visibility and other risk factors that often exist once the sun goes down, such as those who drink and drive.<\/p>\n<p><strong>Driving above the speed limit<\/strong><\/p>\n<p>Speed limits exist for a reason. They are not in place to slow drivers down, but to keep everyone on the road safe. If a driver is speeding, it takes away from possible reaction time in case the unexpected occurs. For example, speed limits are set purposely low in neighborhoods so that drivers have more time to stop in case a child, or even an adult, suddenly steps out into the street.<\/p>\n<p>Car accidents happen all the time due to various reasons, including the ones above and others, such as bad weather, aggressive driving or even a vehicle malfunction. If you have suffered an injury due to a <a href=\"\/auto-accident-injuries\/\">car accident with a negligent driver<\/a>, you might be able to successfully file a claim for compensation for your injuries, lost wages and the damages to your car.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every year it seems like manufacturers are making progress when it comes to improving safety standards in automobiles. In addition, lawmakers are passing legislation, such as bans on texting and driving, that also keep drivers and passengers safe while on the road. Unfortunately, new safety features and laws do not always do the trick. Many accidents occur due to the&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46989"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46989"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/46989\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46989"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=46989"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=46989"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}