{"id":47008,"date":"2017-10-23T00:00:00","date_gmt":"2017-10-23T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2017\/10\/treatment-options-for-tongue-cancer\/"},"modified":"2021-05-24T09:33:11","modified_gmt":"2021-05-24T13:33:11","slug":"treatment-options-for-tongue-cancer","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2017\/10\/treatment-options-for-tongue-cancer\/","title":{"rendered":"Treatment options for tongue cancer"},"content":{"rendered":"<p>For any Ohio residents, being diagnosed with tongue cancer could result in aggressive treatments. There are four different types of common tongue cancer treatments, some of which may be used in conjunction with each other.<\/p>\n<p>Before <a href=\"http:\/\/www.cancercenter.com\/oral-cancer\/types\/tab\/tongue-cancer\/\" target=\"_blank\" rel=\"noopener noreferrer\">tongue cancer<\/a> can be removed, it must first be diagnosed. Common symptoms can include persistent pain in the jaw or tongue, white or red patches on the gums or lining of the mouth, a sore throat, and difficulty chewing or swallowing. Surgery is one of the most common forms of treatment. For this procedure, a surgeon surgically removes the entire tumor from the tongue. Unless the cancer is particularly aggressive, surgeons use techniques that are as minimally invasive as possible. <\/p>\n<p>Radiation therapy may be used to get rid of the cancerous tissues while sparing the healthy tissue. This procedure gives a high dose of radiation directly to the cancerous cells with pinpoint accuracy. Chemotherapy is often used in combination with radiation therapy, especially if the cancer has already spread to the lymph nodes. There are a variety of different chemotherapy drugs that can be used depending on what stage the cancer is at. Finally, targeted drug therapy can be used to target cancerous cells and interfere with their growth on a molecular level. This treatment is often used with radiation therapy or chemotherapy. <\/p>\n<p>When it comes to cancer, getting a timely diagnosis is incredibly important. The earlier cancer is diagnosed, the more options a patient may have when determining what treatment option he or she wants to pursue. If the patient receives a delayed diagnosis or a misdiagnosis and this reduces the patient&#8217;s chance of survival while requiring more aggressive treatments, <a href=\"\/medical-malpractice\/\">medical malpractice injury lawyers<\/a> may be able to file a claim against the doctor who misdiagnosed the cancer.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For any Ohio residents, being diagnosed with tongue cancer could result in aggressive treatments. There are four different types of common tongue cancer treatments, some of which may be used in conjunction with each other. Before tongue cancer can be removed, it must first be diagnosed. Common symptoms can include persistent pain in the jaw or tongue, white or red&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47008"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47008"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47008\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47008"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47008"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47008"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}