{"id":47017,"date":"2017-10-25T00:00:00","date_gmt":"2017-10-25T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2017\/10\/opioids-and-anticoagulants-top-cause-of-medical-liability-claims\/"},"modified":"2021-05-24T09:32:58","modified_gmt":"2021-05-24T13:32:58","slug":"opioids-and-anticoagulants-top-cause-of-medical-liability-claims","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2017\/10\/opioids-and-anticoagulants-top-cause-of-medical-liability-claims\/","title":{"rendered":"Opioids and anticoagulants top cause of medical liability claims"},"content":{"rendered":"<p>Ohio readers may be interested to learn that opioids are the leading cause of medication-related insurance claims, according to a new report. The report, which was issued by Coverys, also found that anticoagulant drugs are a frequent cause of medical errors. <\/p>\n<p>Researchers at Coverys, a medical insurer based in Massachusetts, studied over 10,000 <a href=\"http:\/\/www.fiercehealthcare.com\/hospitals\/opioids-anticoagulants-coverys-medication-liability-claims\" target=\"_blank\" rel=\"noopener noreferrer\">medical liability claims<\/a> that were filed against its client base from 2012 until 2016. They found that opioids were responsible for more claims than any other prescription drug, accounting for 24 percent of all medication claims. Anticoagulants accounted for 16 percent of all medication-related claims. The researchers found that 46 percent of medication-related liability cases were filed against primary care providers. Twenty-two percent of claims were filed against hospital emergency or operating rooms. Overall, medication claims were the fourth most common cause of liability claims against Coverys clients. The top three causes for claims involved diagnostic, surgery and medical management errors. <\/p>\n<p>In the report, Coverys researchers said that doctors and patients must discuss routine activities involving prescription drugs in order to reduce medication-related liability claims. They also said that medical care providers must take special care when determining the correct dosage for the oldest, youngest, lightest and heaviest patients. Finally, they said that doctors must take extra care when prescribing opioids and anticoagulants. <\/p>\n<p>Medication errors can cause patients to needlessly suffer a worsened medical condition. Some victims of medical mistakes choose to pursue a medical malpractice lawsuit against the responsible doctor with the help of <a href=\"\/medical-malpractice\/\">Columbus, Ohio, medical malpractice injury lawyers<\/a>. Such a lawsuit might help a victim obtain needed financial compensation for medical expenses, lost wages, pain and suffering and other related damages.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ohio readers may be interested to learn that opioids are the leading cause of medication-related insurance claims, according to a new report. The report, which was issued by Coverys, also found that anticoagulant drugs are a frequent cause of medical errors. Researchers at Coverys, a medical insurer based in Massachusetts, studied over 10,000 medical liability claims that were filed against&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47017"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47017"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47017\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47017"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47017"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47017"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}