{"id":47044,"date":"2017-08-22T00:00:00","date_gmt":"2017-08-22T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2017\/08\/it-may-take-days-to-realize-you-were-hurt-after-a-car-accident\/"},"modified":"2020-11-18T10:25:56","modified_gmt":"2020-11-18T16:25:56","slug":"may-take-days-to-realize-you-were-hurt-after-a-car-accident","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2017\/08\/may-take-days-to-realize-you-were-hurt-after-a-car-accident\/","title":{"rendered":"It may take days to realize you were hurt after a car accident"},"content":{"rendered":"<p>After a car accident, most people involved can be in a state of shock or experience an adrenaline rush that can make it hard to think. The mental trauma can make it difficult to truly assess the severity of your injuries. It can actually take several days before some symptoms make themselves known. This is one of the reasons why, if you have been in a car accident, it is important to see your doctor as soon as possible for an assessment.<\/p>\n<p>Since some injury symptoms develop over time, you should become familiar with what to watch for in the days following a car accident. Read below for delayed injuries it may take several days for you to become aware of after a motor vehicle collision.<\/p>\n<p><strong>Brain injuries<\/strong><\/p>\n<p>While some brain injuries are easy to see, especially if there is visible trauma to the head, others are not. It is not unusual to suffer from headaches several days after a car accident, however, it could be a sign of serious damage. For example, headaches could be a sign of a blood clot, bruising, or other damage to the brain, head or neck.<\/p>\n<p><strong>Whiplash symptoms<\/strong><\/p>\n<p>If can often take days before you feel the full effects of whiplash. This type of injury usually occurs due to rear-end collisions, even ones that happen at a low rate of speed. If you are experiencing neck or should pain, or stiffness in that region, see your doctor as soon as possible for x-rays and treatment.<\/p>\n<p><strong>Back injuries<\/strong><\/p>\n<p>Back pain is another common symptom you might experience after a car accident. Even a small amount of force can damage to the muscles, ligaments and nerves in the back. Larger amounts of force can result in injuries to the vertebrae. Rear-end and side collisions are the most common culprits behind these kinds of injuries.<\/p>\n<p><strong>Internal bleeding<\/strong><\/p>\n<p>If you experience abdominal pain or swelling, you might be suffering from internal bleeding. In addition, if you have areas with deep purple bruising or you feel faint or dizzy, these could also be signs of internal injuries. It can sometimes take hours or days to see signs of internal injuries. Since these kinds of injuries can be fatal, it is important that you seek medical attention immediately if you see symptoms.<\/p>\n<p><strong>Loss of feeling<\/strong><\/p>\n<p>Damage to the spinal cord or neck can cause you to experience numbness in your arms or hands. Numbness can be a sign of whiplash or another injury that is affecting the nerves.<\/p>\n<p>If you have been in a car accident, it may take days for even minor injuries to develop. See a medical professional as soon as possible so that you can get the treatment you need and start down the road to recovery. You may also be able to file a claim for your injuries and get the compensation you deserve after a wreck with a negligent driver.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After a car accident, most people involved can be in a state of shock or experience an adrenaline rush that can make it hard to think. The mental trauma can make it difficult to truly assess the severity of your injuries. It can actually take several days before some symptoms make themselves known. This is one of the reasons why,&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17,19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47044"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47044"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47044\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47044"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47044"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47044"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}