{"id":47125,"date":"2017-02-10T00:00:00","date_gmt":"2017-02-10T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2017\/02\/small-hospitals-with-low-emergency-room-admit-rates-pose-risks\/"},"modified":"2021-05-24T09:34:55","modified_gmt":"2021-05-24T13:34:55","slug":"small-hospitals-with-low-emergency-room-admit-rates-pose-risks","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2017\/02\/small-hospitals-with-low-emergency-room-admit-rates-pose-risks\/","title":{"rendered":"Small hospitals with low emergency room admit rates pose risks"},"content":{"rendered":"<p>Annually, 20 percent of the population winds up in emergency rooms all across the United States. According to a study published this month in The BMJ, the hospital where they seek care could make the difference between their recovery or death.<\/p>\n<p>Weighing in on the factors that effect ER patient outcomes was an assistant professor at Harvard Medical School&#8217;s health care policy and emergency medicine departments. The doctor observed that large academic medical centers were far more likely to admit patients than smaller, non-academic community hospitals were.<\/p>\n<p>The study found that patients had higher death rates within the week of their discharge from these smaller hospital ER departments than those who sought treatment from the former.<\/p>\n<p>Prior research indicated hospital admission rates didn&#8217;t play a major role in patient outcomes. This study focused on those patients who weren&#8217;t admitted from the ER in the week after their discharge. Using data from Medicare claims, they narrowed the sample to those who were in relatively good health and not at elevated risk of death.<\/p>\n<p>Yet, roughly 10,000 patients died in the seven-day period after being sent home from the ER. Most of those had been treated at hospitals where the fewest patients were admitted.<\/p>\n<p>Contributing factors likely were a lack of protocols to treat certain conditions and the scarcity of doctors and other medical professionals to staff the hospitals, especially in rural areas.<\/p>\n<p>It is possible that a doctor&#8217;s failure to admit a patient who later dies could be attributed to negligence. If so, the survivors of the deceased patient may have a legitimate claim of medical malpractice against the hospital, doctor and potentially other defendants.<\/p>\n<p><b>Source:<\/b> TIME, &#8220;The Scary Reason Healthy People Die After an ER Visit,&#8221; Mandy Oaklander, Feb. 01, 2017<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Annually, 20 percent of the population winds up in emergency rooms all across the United States. According to a study published this month in The BMJ, the hospital where they seek care could make the difference between their recovery or death. Weighing in on the factors that effect ER patient outcomes was an assistant professor at Harvard Medical School&#8217;s health&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47125"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47125"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47125\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47125"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47125"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47125"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}