{"id":47137,"date":"2017-01-27T00:00:00","date_gmt":"2017-01-27T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2017\/01\/signs-your-loved-one-may-have-fallen-victim-to-nursing-home-abuse\/"},"modified":"2019-10-03T21:53:20","modified_gmt":"2019-10-04T02:53:20","slug":"signs-your-loved-one-may-have-fallen-victim-to-nursing-home-abuse","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2017\/01\/signs-your-loved-one-may-have-fallen-victim-to-nursing-home-abuse\/","title":{"rendered":"Signs your loved one may have fallen victim to nursing home abuse"},"content":{"rendered":"<p>Whether it be neglecting a nursing home resident&#8217;s basis hygiene, not rendering necessary assistance with eating, or forcing them to remain bedridden because no accommodations are made for their mobility; these are just some of the many examples of nursing home abuse. Unfortunately, there are many others though as well.<\/p>\n<p>Failure to offer a resident the necessary level of care he or she needs is considered neglect. Not receiving an adequate level of care exposes residents to the potential for suffering both profound and potentially permanent not only bodily, but psychological damage as well.<\/p>\n<p>When it comes to personal hygiene, nursing home staff is expected to provide residents with assistance in performing basic everyday activities. These include routine tasks like getting dressed, bathing and brushing their teeth.<\/p>\n<p>They are expected to render assistance to residents with activities they are not capable of handling themselves, such as cleaning as well. Nursing home staff is also responsible for ensuring residents have both clean clothing and bedding as well as for keeping their living, bathroom and kitchen areas clean.<\/p>\n<p>Nationwide, more than 20 percent of nursing home residents have been found to have been malnourished, sometimes because of untreated depression or swallowing issues as well as for reasons of neglect. Issues involving malnutrition or dehydration are among the many examples of neglect found in nursing homes.<\/p>\n<p>The goal of assisted living facilities should be to keep residents as active as possible to not only help with circulation, but muscle tone and strength to help with balance and prevent falls. Persistent immobility can lead not only to long term physical limitations, but potential exposure to deadly disease as well.<\/p>\n<p>Unexplained injuries or mood changes should also be met with alarm. Although seniors, on average, fall 2.6 times per year, falls at nursing homes may be representative of a resident attempting to do something on their own because of lack of help. Psychological issues may be telling signs of abuse as well.<\/p>\n<p>If you suspect <a href=\"\/medical-malpractice\/nursing-home-abuse-negligence\/\">nursing home abuse<\/a> of someone you know, then you should speak with an Ohio personal injury attorney. In learning more about your loved one&#8217;s case, he or she can explain your rights as it relates to seeking legal remedy in your particular case.<\/p>\n<p><b>Source:<\/b> nextavenue.org, &#8220;6 Signs of Nursing Home Neglect,&#8221; Sarah Blanchard, accessed Jan. 27, 2017<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether it be neglecting a nursing home resident&#8217;s basis hygiene, not rendering necessary assistance with eating, or forcing them to remain bedridden because no accommodations are made for their mobility; these are just some of the many examples of nursing home abuse. Unfortunately, there are many others though as well. Failure to offer a resident the necessary level of care&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[22],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47137"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47137"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47137\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47137"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47137"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47137"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}