{"id":47410,"date":"2015-05-05T00:00:00","date_gmt":"2015-05-05T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2015\/05\/briefly-glancing-away-from-the-road-increases-crash-risk\/"},"modified":"2019-10-03T21:57:11","modified_gmt":"2019-10-04T02:57:11","slug":"briefly-glancing-away-from-the-road-increases-crash-risk","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2015\/05\/briefly-glancing-away-from-the-road-increases-crash-risk\/","title":{"rendered":"Briefly glancing away from the road increases crash risk"},"content":{"rendered":"<p>The Liberty Mutual Research Institute for Safety reported in April, coinciding with National Distracted Driving Awareness Month, that momentary distractions, including a glance at a mobile phone, delays the hazard anticipation of drivers and potentially increases the probability of traffic accidents. It could be surprising to Ohio drivers that a vehicle traveling at 70 mph moves about 67 yards, or more than half the distance of a football field, in two seconds.<\/p>\n<p>While the National Highway Traffic Safety Administration recommends that motorists limit their glances away from the road to two seconds at the most, scientists at the Research Institute say that there is a readjustment period when drivers then turn their attention back to the road, resulting in a detrimental impact on safety for even two-second glances. The scientists used a driving simulator with eye-tracking technology to monitor the <a href=\"http:\/\/www.claimsjournal.com\/news\/national\/2015\/04\/16\/262845.htm\" target=\"_blank\">driving performance<\/a> and reactions of experienced drivers to non-hazardous and hazardous driving situations.<\/p>\n<p>The results of the driving simulation indicate that motorists who are visually interrupted for two seconds have lower reaction abilities to possible dangers such as another vehicle quickly pulling in front of them. Drivers whose focus on the road was not interrupted had better reaction abilities. The research participants were given a questionnaire after the driving simulation to assess how they perceived their driving performance. Distracted motorists rated their execution 70 percent on average, suggesting that they do not understand the negative impact that distractions cause.<\/p>\n<p>Accidents that result from distracted driving could involve high-speed impacts because the drivers do not see the hazards ahead of them. This might mean that the occupants of the other vehicles suffer serious or fatal injuries. Those victims or their families may qualify for compensation if they can show in personal injury or wrongful death claims that the <a href=\"\/auto-accident-injuries\/car-accidents\/\">negligence<\/a> of the distracted drivers caused the victims&#8217; injuries or deaths.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Liberty Mutual Research Institute for Safety reported in April, coinciding with National Distracted Driving Awareness Month, that momentary distractions, including a glance at a mobile phone, delays the hazard anticipation of drivers and potentially increases the probability of traffic accidents. It could be surprising to Ohio drivers that a vehicle traveling at 70 mph moves about 67 yards, or&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47410"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47410"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47410\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47410"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47410"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47410"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}