{"id":47440,"date":"2015-02-19T00:00:00","date_gmt":"2015-02-19T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2015\/02\/the-dangers-of-distracted-driving\/"},"modified":"2020-11-18T10:11:02","modified_gmt":"2020-11-18T16:11:02","slug":"the-dangers-of-distracted-driving","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2015\/02\/the-dangers-of-distracted-driving\/","title":{"rendered":"The dangers of distracted driving"},"content":{"rendered":"<p>In 2012, 3,328 people suffered fatal injuries in car accidents involving distracted drivers. In the same year, distracted motorists were involved in collisions that resulted in 421,000 injured individuals. With approximately nine people killed and 1,153 people injured every day in these types of accidents, residents of Ohio should be aware of the dangers associated with <a href=\"http:\/\/www.cdc.gov\/motorvehiclesafety\/distracted_driving\/\" target=\"_blank\" rel=\"noopener noreferrer\">distracted driving<\/a>.<\/p>\n<p>Manual, visual and cognitive distractions are the three major types of distractions that can affect drivers. Many activities can cause a driver to become distracted, but texting is one of the most dangerous since it involves all three types of distraction. A study carried out by the Centers for Disease Control and Prevention showed that 69 percent of drivers in the United States ages 18 to 64 reported texting while driving within 30 days of the survey, and 31 percent of these same individuals reported reading or sending email messages while driving within 30 days of the survey.<\/p>\n<p>According to the CDC, drivers under the age of 20 are most likely to be in fatal crashes involving distracted drivers. When compared to high school students who do not text and drive, students who text while driving are nearly five times as likely to drink and drive and twice as likely to ride with a driver who has been drinking and driving.<\/p>\n<p>Over the past several years, many federal and state laws have been passed that limit cell phone use while driving. Despite this, distracted drivers are involved in hundreds of thousands of car accident injuries every year. Fortunately, when an individual has been injured in a car accident and believes a negligent driver is to blame, he or she can take legal action in an effort to receive adequate compensation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In 2012, 3,328 people suffered fatal injuries in car accidents involving distracted drivers. In the same year, distracted motorists were involved in collisions that resulted in 421,000 injured individuals. With approximately nine people killed and 1,153 people injured every day in these types of accidents, residents of Ohio should be aware of the dangers associated with distracted driving. Manual, visual&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47440"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47440"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47440\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47440"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47440"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47440"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}