{"id":47446,"date":"2015-02-24T00:00:00","date_gmt":"2015-02-24T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2015\/02\/ohio-dump-truck-accident-leaves-1-dead-injures-3-others\/"},"modified":"2019-10-03T21:57:45","modified_gmt":"2019-10-04T02:57:45","slug":"ohio-dump-truck-accident-leaves-1-dead-injures-3-others","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2015\/02\/ohio-dump-truck-accident-leaves-1-dead-injures-3-others\/","title":{"rendered":"Ohio dump truck accident leaves 1 dead, injures 3 others"},"content":{"rendered":"<p>A three-vehicle truck accident in Ohio left one woman dead and sent three others to the hospital on Feb. 13. One of the vehicles, a dump truck, struck the other two vehicles while traveling in Wayne Township.<\/p>\n<p>The accident occurred at about 2:30 p.m. at the intersection of Ohio State Route 73 and Jacksonburg Road. A dump truck was traveling in the westbound lane of SR 73 when it struck a Chevrolet Silverado that was headed south on Jacksonburg Road. After the first collision, the dump truck moved toward the eastbound lane of SR 73 and struck an eastbound car. The car overturned and came to a stop in a roadside ditch.<\/p>\n<p>The Silverado&#8217;s driver, a 34-year-old woman, died at the scene of the accident. A passenger in the truck suffered unspecified injuries and was airlifted to Miami Valley Hospital in Dayton. Emergency crews transported the drivers in the overturned car and the dump truck to Atrium Medical Center in Middletown. The Butler County Sheriff&#8217;s Office continued to investigate the accident at the time of reports. No contributing factors or possible causes were disclosed.<\/p>\n<p>The owners and operators of large commercial vehicles like dump trucks are responsible for properly training and monitoring their drivers. Personal injury attorneys may be able to help victims&#8217; families identify the responsible parties in commercial truck accidents. Family members may be eligible to file wrongful death suits against truck drivers, truck owners and the companies that hired them. Damages recoverable in a wrongful death lawsuit stemming from a fatal truck accident can include funeral and burial expenses, compensation for the loss of the reasonably expected earning capacity of the decedent and the loss of prospective inheritance.<\/p>\n<p><strong>Source:<\/strong> WCPO, &#8220;Wayne Township vehicle accident leaves one dead &#8220;, Feb. 13, 2015<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A three-vehicle truck accident in Ohio left one woman dead and sent three others to the hospital on Feb. 13. One of the vehicles, a dump truck, struck the other two vehicles while traveling in Wayne Township. The accident occurred at about 2:30 p.m. at the intersection of Ohio State Route 73 and Jacksonburg Road. A dump truck was traveling&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47446"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47446"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47446\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47446"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47446"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47446"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}