{"id":47452,"date":"2015-01-29T00:00:00","date_gmt":"2015-01-29T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2015\/01\/the-dangers-of-impaired-driving-in-ohio\/"},"modified":"2019-10-03T21:57:49","modified_gmt":"2019-10-04T02:57:49","slug":"the-dangers-of-impaired-driving-in-ohio","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2015\/01\/the-dangers-of-impaired-driving-in-ohio\/","title":{"rendered":"The dangers of impaired driving in Ohio"},"content":{"rendered":"<p>Drinking and driving is a huge problem in the United States as there is roughly one death involving a driver under the influence of alcohol every 51 minutes. According to the National Highway Traffic Safety Administration, 10,322 people died in accidents involving alcohol use in 2012. These otherwise preventable incidents accounted for more than 30 percent of all traffic fatalities in the country that year. People in Ohio can take some steps to reduce the amount of impaired drivers on the road. <\/p>\n<p>When going out for the night, making a plan before consuming alcohol could help stop a <a href=\"\/auto-accident-injuries\/car-accidents\/\"> car accident<\/a> from occurring. A group can designate a driver who will not drink, and one can also take keys from impaired friends. If there is no designated driver, one might plan to use a taxi or another car service to get home. <\/p>\n<p>Some motorists repeatedly engage in drinking and driving and are not usually deterred by safety measures like sobriety checkpoints and blood alcohol content laws. Other approaches have more success like vehicle impoundment or intensive supervised probation with treatment. Impoundment involves taking away a vehicle after one drives with a suspended license or after a conviction for driving under the influence, and supervised probation is an intervention program that uses counseling and monitoring to address the drinking habits of repeat offenders. Interlock devices have been shown to significantly reduce the number of arrests for impaired driving. <\/p>\n<p>Those convicted of DUI face harsh criminal penalties in order to deter repeat offenses, and a motorist could also face consequences in civil court if someone suffers injuries in a drunk driving accident. If the actions of an intoxicated driver lead to a crash that causes injuries to another, the driver may be liable for medical expenses and other damages the victim incurs. <\/p>\n<p><b>Source:<\/b> Centers for Disease Control and Prevention, <a href=\"http:\/\/www.cdc.gov\/motorvehiclesafety\/impaired_driving\/impaired-drv_factsheet.html\" target=\"_blank\">&#8220;Impaired Driving: Get the Facts&#8221;<\/a>, accessed on Jan. 24, 2015<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Drinking and driving is a huge problem in the United States as there is roughly one death involving a driver under the influence of alcohol every 51 minutes. According to the National Highway Traffic Safety Administration, 10,322 people died in accidents involving alcohol use in 2012. These otherwise preventable incidents accounted for more than 30 percent of all traffic fatalities&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47452"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47452"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47452\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47452"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47452"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47452"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}