{"id":47513,"date":"2014-10-16T00:00:00","date_gmt":"2014-10-16T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2014\/10\/ohio-nursing-homes-part-of-record-neglect-settlement-deal\/"},"modified":"2019-10-03T21:58:39","modified_gmt":"2019-10-04T02:58:39","slug":"ohio-nursing-homes-part-of-record-neglect-settlement-deal","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2014\/10\/ohio-nursing-homes-part-of-record-neglect-settlement-deal\/","title":{"rendered":"Ohio nursing homes part of record neglect settlement deal"},"content":{"rendered":"<p>According to a recent announcement from the U.S. Justice Department, a chain of nursing homes agreed to pay $38 million to the federal government and eight states, including Ohio, in order to settle numerous complaints. The chain, which owns and operates dozens of nursing homes and rehabilitation centers, was facing claims that it provided substandard care to patients and billed Medicare for unnecessary services. According to authorities, the size of the settlement is unprecedented among suits filed in the United States involving elder justice. <\/p>\n<p>The U.S. Department of Justice said Extendicare Health Services failed to provide adequate patient care in 33 of its skilled nursing centers in eight states, dating back to 2013. The company allegedly understaffed its nursing homes and left patients unattended while they suffered from dehydration, malnutrition, infections, pressure ulcers, falls and improper catheter care. The government also accused a subsidiary of EHS of billing Medicare for unnecessary and unreasonable services. <\/p>\n<p>Extendicare centers in multiple Ohio locales, including Carroll, Columbus and Toledo, were among the list of offending care facilities. Centers in Indiana, Kentucky, Washington, Wisconsin, Pennsylvania, Michigan and Minnesota were also listed. In the settlement, the company denied any wrongdoing but agreed to undergo a five-year monitoring program overseen by the U.S. Department of Health and Human Services. The monitoring is to take place in all 146 Extendicare nursing centers. <\/p>\n<p>Family members expect that loved ones placed in skilled nursing facilities will receive proper care, but that is not always the case. Signs of neglect include bedsores, injuries from a fall, weight loss and soiled bed linens. People who suspect that a patient is a victim of <a href=\"\/medical-malpractice\/nursing-home-abuse-negligence\/\">nursing home neglect<\/a> or abuse may wish to consult an attorney to explore potential civil remedies. <\/p>\n<p><strong> Source: <\/strong> Department of Justice, &#8220;Extendicare Health Services Inc. Agrees to Pay $38 Million to Settle False Claims Act Allegations Relating to the Provision of Substandard Nursing Care and Medically Unnecessary Rehabilitation Therapy,&#8221; Oct. 10, 2014 <\/p>\n<p> <b>Source:&nbsp;<\/b>Cleveland.com, &#8220;<a href=\"http:\/\/www.cleveland.com\/open\/index.ssf\/2014\/10\/nursing_home_chain_with_big_oh.html\" target=\"_blank\">Nursing home chain with big Ohio presence agrees to record settlement over patient treatment<\/a>&#8220;, Stephen Koff, October 10, 2014<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to a recent announcement from the U.S. Justice Department, a chain of nursing homes agreed to pay $38 million to the federal government and eight states, including Ohio, in order to settle numerous complaints. The chain, which owns and operates dozens of nursing homes and rehabilitation centers, was facing claims that it provided substandard care to patients and billed&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[22],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47513"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47513"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47513\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47513"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47513"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47513"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}