{"id":47564,"date":"2014-06-13T00:00:00","date_gmt":"2014-06-13T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2014\/06\/undiagnosed-diabetes-may-lead-to-heart-attacks-studies-show\/"},"modified":"2021-05-24T09:39:39","modified_gmt":"2021-05-24T13:39:39","slug":"undiagnosed-diabetes-may-lead-to-heart-attacks-studies-show","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2014\/06\/undiagnosed-diabetes-may-lead-to-heart-attacks-studies-show\/","title":{"rendered":"Undiagnosed diabetes may lead to heart attacks, studies show"},"content":{"rendered":"<p>Some Ohio readers might already be aware of the medical evidence linking diabetes to cardiovascular disease and heart attacks. Diabetes often goes undiagnosed despite the manifestation of cardiovascular problems. Undiagnosed diabetes may be the cause behind ten percent of heart attacks, according to new research presented at the Quality of Care and Outcomes Research Scientific Session 2014.<\/p>\n<p>The lead author of the study, an assistant professor at the University of Missouri as well as at Saint Luke&#8217;s Mid America Heart Institute, said that it was important to diagnose diabetes in patients who have had heart attacks because of the ways in which diabetes contributes to heart disease. Diabetes may be present but undiagnosed in as many as 7 million Americans, in addition to the estimated 25.8 million Americans who have been diagnosed with the disease. It can cause increased blood sugar levels, which can, in turn, increase a person&#8217;s risk of heart attack. Two out of three people who have diabetes die from cardiovascular disease, according to statistics released by the American Heart Association.<\/p>\n<p>The Heart Foundation has said that at least 920,000 people in the U.S. will have heart attacks in 2014. Fifty percent of those incidents will happen without warning. The <a href=\"\/medical-malpractice\/\">failure to diagnose<\/a> diabetes may contribute to heart attacks in some of these cases. The Quality of Care study&#8217;s authors relied on the post-heart-attack A1C levels of 2,854 patients who didn&#8217;t know they were diabetic. A1C levels allow medical personnel to determine the patient&#8217;s blood sugar levels over a period of two to three months prior to the test. Based on the data studied, doctors were 17 times more likely to discover diabetes if they checked the patient&#8217;s A1C levels.<\/p>\n<p>In a case where a person suffers injury because of failure to diagnose or other medical malpractice, a personal injury lawyer may be able to help the injured party secure compensation. Expert testimony is often necessary in medical malpractice cases where liability is disputed. A lawyer may arrange for experts and take depositions, negotiate with insurers and present the case at trial.<\/p>\n<p> <b>Source:&nbsp;<\/b>Medical Daily , &#8220;<a href=\"http:\/\/www.medicaldaily.com\/diabetes-may-cause-heart-attacks-when-doctors-fail-diagnosis-disease-286148\" target=\"_blank\" rel=\"noopener noreferrer\">Diabetes May Cause Heart Attacks When Doctors Fail To Diagnosis The Disease<\/a>&#8220;, Samantha Olson, June 03, 2014<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Some Ohio readers might already be aware of the medical evidence linking diabetes to cardiovascular disease and heart attacks. Diabetes often goes undiagnosed despite the manifestation of cardiovascular problems. Undiagnosed diabetes may be the cause behind ten percent of heart attacks, according to new research presented at the Quality of Care and Outcomes Research Scientific Session 2014. The lead author&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47564"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47564"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47564\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47564"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47564"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47564"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}