{"id":47609,"date":"2014-02-28T00:00:00","date_gmt":"2014-02-28T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2014\/02\/suit-says-reasonable-standard-of-care-not-upheld-at-nursing-home\/"},"modified":"2019-10-03T21:59:52","modified_gmt":"2019-10-04T02:59:52","slug":"suit-says-reasonable-standard-of-care-not-upheld-at-nursing-home","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2014\/02\/suit-says-reasonable-standard-of-care-not-upheld-at-nursing-home\/","title":{"rendered":"Suit says reasonable standard of care not upheld at nursing home"},"content":{"rendered":"<p>The resident of an Ohio nursing home recently sued the facility, and the defendant issued a response seeking a stay in the case to allow arbitration. At issue was alleged <a href=\"\/blog\/\">nursing home neglect<\/a> caused by chronic understaffing and lack of supplies, claims made by a 66-year-old resident of the Athens County care center. By February 2014, the judge had not granted the defense request, but he did grant a different motion. He ruled that defense attorneys did not have to provide the plaintiff with any documentation until after the arbitration question was settled.<\/p>\n<p>According to an area newspaper, the documentation sought by the plaintiff was voluminous. The patient&#8217;s legal team wanted records turned over to them regarding how the 66-year-old was treated when at the nursing home as well as an accounting of the center&#8217;s policies and procedures, including how staff was trained. In addition, the defense team was asked to provide information about any government investigations, resident accidents or unusual incidents, and suggestions and complaints made by residents, employees or consumers.<\/p>\n<p>Specific to his own case, the litigating resident claimed to have suffered from inadequate care that led to extreme pain, mental anguish, weight loss, bedsores, falls and &#8220;catastrophic injuries.&#8221; He was a patient at the nursing home from September 2012 until January 2013. The defendants named in the suit included the facility itself, its administrator, corporate affiliates and several parties who were not identified in court documents. <\/p>\n<p>In cases where nursing home abuse or neglect is alleged, lawyers for both sides may ask to see documentation regarding nursing home staff. A plaintiff&#8217;s legal team is entitled during the process known as discovery to review any evidence of elder abuse, medication errors and other information relevant to a lawsuit. <\/p>\n<p> <b>Source:&nbsp;<\/b>The Athens News, &#8220;<a href=\"http:\/\/www.athensnews.com\/ohio\/article-41801-nursing-home-respond.html\" target=\"_blank\">Nursing home responds to lawsuit by former resident<\/a>&#8220;, Jim Phillips, February 23, 2014<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The resident of an Ohio nursing home recently sued the facility, and the defendant issued a response seeking a stay in the case to allow arbitration. At issue was alleged nursing home neglect caused by chronic understaffing and lack of supplies, claims made by a 66-year-old resident of the Athens County care center. By February 2014, the judge had not&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[22],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47609"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47609"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47609\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47609"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47609"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47609"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}