{"id":47600,"date":"2014-03-24T00:00:00","date_gmt":"2014-03-24T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2014\/03\/ohio-car-accident-involving-wrong-way-driver-injures-3\/"},"modified":"2019-10-03T21:59:45","modified_gmt":"2019-10-04T02:59:45","slug":"ohio-car-accident-involving-wrong-way-driver-injures-3","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2014\/03\/ohio-car-accident-involving-wrong-way-driver-injures-3\/","title":{"rendered":"Ohio car accident involving wrong-way driver injures 3"},"content":{"rendered":"<p>According to the latest news report, a three-vehicle accident in Bellaire during the evening hours of March 15 left three individuals injured. The southward lanes of Ohio 7 where the multi-car accident occurred were closed off to traffic for two or three hours while authorities investigated the crash.<\/p>\n<p>The Ohio State Highway Patrol said that the chain-reaction collision took place when a 59-year-old Bellaire woman driving a Cadillac in the north direction of the southward lanes crashed into two cars that were traveling in the southward direction.<\/p>\n<p>A 73-year-old Moundsville man driving a Mercury Cougar and a 43-year-old Martins Ferry woman driving a Buick Rendezvous were both struck by the Cadillac. The male driver was able to drive to Wheeling Hospital while rescue squads on the scene transported the two female drivers to Wheeling Hospital where they were treated for their injuries, according to police reports.<\/p>\n<p>As of the time of this news release, authorities on the scene stated that alcohol may have played a role in the three-car accident. The patrol was continuing its investigations into the accident, however, and said that charges may be filed.<\/p>\n<p>Although police were continuing their investigations into the cause of this car accident, the fact that the woman was driving her car in the opposite lane of a highway is reason for concern. Police investigating the incident noted that alcohol may have been involved in the collision. Ohio residents who suffer from <a href=\"\/auto-accident-injuries\/car-accidents\/\">car accident injuries<\/a> due to a negligent, drunk or reckless driver may be eligible to receive compensation to cover damages, medical expenses and other losses. Once a police investigation is complete, an attorney may be able to review it for facts relating to the liable party in order to negotiate a fair settlement or to use as a defense in a personal injury lawsuit.<\/p>\n<p><b>Source:&nbsp;<\/b>Times Leader, &#8220;Accident closes Ohio 7 in Bellaire for several hours&#8221;, March 17, 2014<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to the latest news report, a three-vehicle accident in Bellaire during the evening hours of March 15 left three individuals injured. The southward lanes of Ohio 7 where the multi-car accident occurred were closed off to traffic for two or three hours while authorities investigated the crash. The Ohio State Highway Patrol said that the chain-reaction collision took place&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47600"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47600"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47600\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47600"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47600"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47600"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}