{"id":47636,"date":"2013-12-03T00:00:00","date_gmt":"2013-12-03T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/12\/reduced-symptoms-not-end-of-brain-injury-recovery\/"},"modified":"2019-10-03T22:00:13","modified_gmt":"2019-10-04T03:00:13","slug":"reduced-symptoms-not-end-of-brain-injury-recovery","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/12\/reduced-symptoms-not-end-of-brain-injury-recovery\/","title":{"rendered":"Reduced symptoms not end of brain injury recovery"},"content":{"rendered":"<p>For the parents, organizers and players of contact sports in Ohio, a series of studies on the long-term effects of mild concussion may raise doubts about previous thinking on the topic. When the symptoms of a <a href=\"http:\/\/www.lvtbd.com\/Auto-Accident-Injuries\/Car-Accidents\/\" target=\"_blank\">traumatic brain injury<\/a> disappear, many people with TBIs think that their brains have healed. Investigation of brain function following the end of symptoms has shown that this is not the case. In a separate peer-reviewed study appearing in the journal Pediatrics, researchers found that keeping young players off the football field longer following brain injury could have prevented some deaths. <\/p>\n<p>The common symptoms of concussion include dizziness, headaches, impaired memory and depression. In this study, researchers used 3-D nerve imaging to look at brain function of individuals diagnosed with mild concussion at two weeks and four months after the diagnosis. These images were compared with non-injured individuals. Even with the reduction in symptoms at four months, those with brain trauma had 10 percent more abnormalities. <\/p>\n<p>The healing time for the brain may be slower than once thought, but it is on par with other types of injuries, according to a study author. The symptoms of muscle sprains and burns often disappear prior to a full recovery. The risk of returning to the field or to work without full recovery from head trauma is that repeated injury has been associated with more severe consequences. <\/p>\n<p>Sports players expect coaches and other organizing personnel to use the latest knowledge in support of player safety. The negligence of these trusted leaders may have severe consequences for the players and their families. A second brain injury following inadequate healing time, for instance, may result in coma, amnesia, permanent disability or death. Victims of such negligent actions may consult with an experienced attorney to seek compensation for medical expenses and other damages. <\/p>\n<p> <b>Source:&nbsp;<\/b>Bloomberg, &#8220;<a href=\"http:\/\/www.bloomberg.com\/news\/2013-11-20\/brain-still-harmed-by-concussion-after-symptoms-decline.html\" target=\"_blank\">Brain still harmed by concussion after symptoms decline<\/a>&#8220;, Elizabeth Lopatto, November 20, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For the parents, organizers and players of contact sports in Ohio, a series of studies on the long-term effects of mild concussion may raise doubts about previous thinking on the topic. When the symptoms of a traumatic brain injury disappear, many people with TBIs think that their brains have healed. Investigation of brain function following the end of symptoms has&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47636"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47636"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47636\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47636"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47636"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47636"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}