{"id":47642,"date":"2013-12-18T00:00:00","date_gmt":"2013-12-18T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/12\/mlb-player-said-to-have-traumatic-brain-injury-at-time-of-suicide\/"},"modified":"2020-11-18T01:28:25","modified_gmt":"2020-11-18T07:28:25","slug":"mlb-player-said-to-have-traumatic-brain-injury-at-time-of-suicide","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/12\/mlb-player-said-to-have-traumatic-brain-injury-at-time-of-suicide\/","title":{"rendered":"MLB player said to have traumatic brain injury at time of suicide"},"content":{"rendered":"<p>Ohio fans of the late Major League Baseball star Ryan Freel may have heard that the former player suffered from a degenerative brain disease at the time of his December 2012 suicide. The <a href=\"http:\/\/www.lvtbd.com\/Auto-Accident-Injuries\/Car-Accidents\/\" target=\"_blank\" rel=\"noopener noreferrer\">traumatic brain injury<\/a> syndrome known as chronic traumatic encephalopathy was not the sole reason Freel shot himself, but it was implied to be a factor in a report provided to the athlete&#8217;s mother and stepfather by the Boston University Center for the Study of Traumatic Encephalopathy and Sports Legacy Institute. The report, which said that Freel was suffering from Stage II CTE when he died, was also presented to Major League Baseball officials.<\/p>\n<p>CTE is most often diagnosed in football, hockey and boxing, sports which are traditionally included in studies for traumatic brain injuries. Freel, who played for five different teams before retiring from the game in 2010, is reported to be the first MLB player to receive the diagnosis. This may not be surprising to fans who followed his career, which saw him suffer multiple concussions and be rushed to the hospital after colliding with an opposing player during a 2007 game.<\/p>\n<p>As important as CTE may have been in Freel&#8217;s suicide, however, brain injury researchers cautioned that it is only one of many causes, such as mental illness and genetics, that may lead athletes to take their own lives. For example, Freel also fought depression, attention deficit disorder and anxiety.<\/p>\n<p>A head injury may mean a traumatic brain injury. In cases where long-term care is needed due to brain damage suffered in a work accident or automobile collision, financial compensation may be sought in court. Rehabilitation and other medical expenses may be recompensed as well as part of a settlement for accident compensation.<\/p>\n<p><b>Source: <\/b>Fox News, &#8220;Family says late MLB player Ryan Freel had chronic traumatic encephalopathy&#8221;, December 16, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ohio fans of the late Major League Baseball star Ryan Freel may have heard that the former player suffered from a degenerative brain disease at the time of his December 2012 suicide. The traumatic brain injury syndrome known as chronic traumatic encephalopathy was not the sole reason Freel shot himself, but it was implied to be a factor in a&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47642"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47642"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47642\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47642"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47642"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47642"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}