{"id":47651,"date":"2013-11-22T00:00:00","date_gmt":"2013-11-22T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/11\/volkswagen-vehicle-defects-prompt-recalls-in-ohio\/"},"modified":"2020-11-18T10:27:04","modified_gmt":"2020-11-18T16:27:04","slug":"volkswagen-vehicle-defects-prompt-recalls-in-ohio","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/11\/volkswagen-vehicle-defects-prompt-recalls-in-ohio\/","title":{"rendered":"Volkswagen vehicle defects prompt recalls in Ohio"},"content":{"rendered":"<p>The Germany-based Volkswagen Group has issued a recall for vehicles. According to a report, some defective vehicles have the potential to cause stalling or sudden acceleration that could lead to traffic collisions.<\/p>\n<p>An estimated 2.6 million vehicles are on the recall list due to gearbox problems, fuel leakage and defective lighting system defects. The gearbox trouble affects vehicles that have 7-speed dual-clutch transmissions. It is recommended that mineral oil be used instead of synthetic oil in the affected 1.6 million vans and cars. Use of the incorrect gearbox oil can cause operational errors such as unexpected acceleration, sudden power loss and sometimes vibration.<\/p>\n<p>Those receiving a recall notice for the Volkswagen Tiguan crossover vehicle should have the car checked for defective lighting. One fuse may trip and will cause specific lights to fail, but some will remain lit. If this occurs, drivers are notified through the instrument cluster. The fix is as simple as a sturdier fuse exchanged for the original. More than 800,000 vehicles in several countries are affected.<\/p>\n<p>According to an auto reviewer for the Consumer Reports magazine, Volkswagen&#8217;s recalls, as well as those issued by Toyota, Mitsubishi and Chrysler accentuate the need for today&#8217;s car manufacturers to remain vigilant as increasingly complex systems are becoming more common in new vehicles. Those injured in a car accident due to an engineering defect in a recalled car may be entitled to compensation from the manufacturer for any losses incurred. Personal injury lawyers that have experience building cases against automobile manufacturing companies may be able to help victims receive any financial award that might be due.<\/p>\n<p><b>Source: <\/b>Automotive News, &#8220;Volkswagen recalls 2.6 million vehicles on engine, light faults&#8221;, November 14, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Germany-based Volkswagen Group has issued a recall for vehicles. According to a report, some defective vehicles have the potential to cause stalling or sudden acceleration that could lead to traffic collisions. An estimated 2.6 million vehicles are on the recall list due to gearbox problems, fuel leakage and defective lighting system defects. The gearbox trouble affects vehicles that have&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47651"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47651"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47651\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47651"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47651"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47651"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}