{"id":47666,"date":"2013-10-22T00:00:00","date_gmt":"2013-10-22T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/10\/objects-are-left-in-surgical-patients-at-alarming-rates\/"},"modified":"2021-05-24T09:40:19","modified_gmt":"2021-05-24T13:40:19","slug":"objects-are-left-in-surgical-patients-at-alarming-rates","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/10\/objects-are-left-in-surgical-patients-at-alarming-rates\/","title":{"rendered":"Objects are left in surgical patients at alarming rates"},"content":{"rendered":"<p>Ohio residents preparing for surgery may have a lot on their minds. Few consider that a surgeon might leave an object in their body, an object that can cause infection, pain and eventually another surgery. Worse, sometimes a patient may even die due to this form of <a href=\"http:\/\/www.lvtbd.com\/Medical-Malpractice\/\" target=\"_blank\" rel=\"noopener noreferrer\">medical negligence<\/a>. Between 2005 and 2012, a new report claims, 772 tools were left in patients and 16 people died from the effects.<\/p>\n<p>The report, issued by the Joint Commission, criticizes hospitals for poor procedures and ineffective communication between members of a surgical team. In some cases protocols are not followed, and in other cases they simply do not exist. At other hospitals, insufficient education of staff was a problem as well. The Commission&#8217;s report suggested that hospitals adopt procedures such as having more than one person perform the instrument count and using a board with instrument counts on them. One hospital cut errors in half by using similar protocols.<\/p>\n<p>While these mistakes have their biggest impact on individuals and their families, they also cost hospitals a great deal of money. A recent lawsuit claimed that a sponge left inside a woman for four years caused her extreme pain, disability and mental distress. Courts awarded her $2.5 million. In all, the costs of caring for the these patients and compensating them comes to over $160,000 per forgotten tool.<\/p>\n<p>While some hospitals and surgical teams are making progress and reducing the incidence of this surgical error, many are not. Ohio patients anticipating surgery can check the safety statistics for their local hospitals, which include rates for objects left behind in patients. An attorney who is experienced in medical malpractice claims may be able to help those who have suffered from this kind of medical error. These victims may be eligible for compensation.<\/p>\n<p><b>Source: <\/b>CBS News, &#8220;Nearly 800 surgical tools left in patients since 2005: Report&#8221;, Ryan Jaslow, October 18, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ohio residents preparing for surgery may have a lot on their minds. Few consider that a surgeon might leave an object in their body, an object that can cause infection, pain and eventually another surgery. Worse, sometimes a patient may even die due to this form of medical negligence. Between 2005 and 2012, a new report claims, 772 tools were&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47666"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47666"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47666\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47666"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47666"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47666"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}