{"id":47717,"date":"2013-06-05T00:00:00","date_gmt":"2013-06-05T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/06\/nursing-home-neglect-and-abuse-severely-underreported\/"},"modified":"2019-10-03T22:01:19","modified_gmt":"2019-10-04T03:01:19","slug":"nursing-home-neglect-and-abuse-severely-underreported","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/06\/nursing-home-neglect-and-abuse-severely-underreported\/","title":{"rendered":"Nursing home neglect and abuse severely underreported"},"content":{"rendered":"<p>Many&nbsp;Ohio residents grapple with how to care for aging grandparents, parents and other elderly loved ones. In many cases, family members may try to take on caring for aging relatives. However, as physical and mental aliments persist and advance, many are forced to turn to nursing homes or assisted living facilities.<\/p>\n<p>To families seeking a place for loved ones, nursing homes are billed as being safe and secure with caring and attentive staff. In reality, however, many nursing homes are severely deficient in the number of and training of staff members. As a result, many nursing home residents suffer medication errors, fall injuries and abuse and negligent.<\/p>\n<p>Nursing home advocates often cite lack of funding and severe staffing shortages as being major problems that contribute to the deficient care of residents. In some cases, one nursing aide may be responsible for the care of more than 30 residents. Such an individual is often not trained to handle residents with special needs or advanced conditions. What&#8217;s more, these employees are often poorly compensated and forced to work overtime hours. Given the lack of support and poor working conditions, it&#8217;s no wonder that incidences of nursing home neglect and abuse occur.<\/p>\n<p>Spurring change within the nursing home industry is difficult as funding is often a factor and incidents of nursing home neglect and abuse are severely underreported. Today an estimated 3.2 million Americans currently live in nursing homes. That number is expected to grow tremendously in the coming years as more baby boomers age.<\/p>\n<p>Individuals who believe a family member or loved one has been the victim of <a href=\"http:\/\/www.lvtbd.com\/Medical-Malpractice\/Nursing-Home-Abuse-Negligence\/\" target=\"_blank\">nursing home neglect<\/a> or abuse would be wise to discuss their case with an attorney. Cases of neglect can include situations such as medication errors and residents wandering to fall injuries and bedsores. Signs of nursing home neglect or abuse should not be ignored and those responsible must be brought to justice.<\/p>\n<p><strong>Source:&nbsp;<\/strong>Glens Falls Post-Star, &#8220;<a href=\"http:\/\/poststar.com\/news\/local\/watching-out-for-nursing-home-abuse-neglect\/article_4dcafbc0-c02c-11e2-9d6b-0019bb2963f4.html\" target=\"_blank\">Watching out for nursing home abuse, neglect<\/a>,&#8221; Jon Alexander, May 18, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many&nbsp;Ohio residents grapple with how to care for aging grandparents, parents and other elderly loved ones. In many cases, family members may try to take on caring for aging relatives. However, as physical and mental aliments persist and advance, many are forced to turn to nursing homes or assisted living facilities. To families seeking a place for loved ones, nursing&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[22],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47717"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47717"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47717\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47717"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47717"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47717"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}