{"id":47726,"date":"2013-05-09T00:00:00","date_gmt":"2013-05-09T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/05\/soccer-referee-who-was-punched-dies-from-brain-injury\/"},"modified":"2020-11-18T10:00:53","modified_gmt":"2020-11-18T16:00:53","slug":"soccer-referee-who-was-punched-dies-from-brain-injury","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/05\/soccer-referee-who-was-punched-dies-from-brain-injury\/","title":{"rendered":"Soccer referee who was punched, dies from brain injury"},"content":{"rendered":"<p>The human brain is an intricate and delicate organ. The brain regulates all body processes and allows an individual to think, reason and communicate. When a portion of the brain sustains an injury, an impacted individual may be rendered unable to walk or talk or may seem like a completely different person.<\/p>\n<p>Doctors continue to be mystified by how the brain works and why some people seem to bounce back relatively unscathed from a <a href=\"http:\/\/www.lvtbd.com\/Auto-Accident-Injuries\/Car-Accidents\/\" target=\"_blank\" rel=\"noopener noreferrer\">brain injury<\/a> while others remain severely disabled. What is clear is that a blow sustained to the head and brain can be a devastating and potentially fatal injury.<\/p>\n<p>&nbsp;<\/p>\n<p>A tragic incident in which a soccer referee died from a brain injury recently made national headlines. A 17-year-old male suspect is currently in police custody awaiting criminal charges in the 46-year-old referee&#8217;s death. The brain injury stemmed from an argument that ensued related to a call the referee made during a soccer game. The 17-year-old became upset over the call and ended up punching the referee squarely in the face.<\/p>\n<p>Reeling from the blow, the 46-year-old remained conscious but complained of feeling dizzy and nauseous. The situation took a turn for the worse when he began vomiting blood and he was rushed to the hospital. After being admitted, the 46-year-old&#8217;s brain continued to swell and he slipped into a coma. He died a week later as a result for the traumatic brain injury and subsequent brain swelling and damage.<\/p>\n<p>This incredibly sad and tragic incident proves how even one blow to the head can result in a severe and potentially fatal brain injury. By the time such an injury has occurred, doctors are in a race against time to control the swelling in the brain that can cause irreversible brain damage and even lead to death.<\/p>\n<p>Individuals who have sustained a brain injury as a result of the negligent actions of another, whether it be in a car accident or a medical procedure, may want to consult with an attorney. In such cases, a lawsuit may help an injured individual recover compensation related to their injuries and medical expenses and needs.<\/p>\n<p><b>Source: <\/b>CBS News, &#8220;Soccer referee&#8217;s death shows how dangerous head blows can be,&#8221; Ryan Jaslow, May 6, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The human brain is an intricate and delicate organ. The brain regulates all body processes and allows an individual to think, reason and communicate. When a portion of the brain sustains an injury, an impacted individual may be rendered unable to walk or talk or may seem like a completely different person. Doctors continue to be mystified by how the&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47726"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47726"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47726\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47726"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47726"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47726"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}