{"id":47735,"date":"2013-05-22T00:00:00","date_gmt":"2013-05-22T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/05\/former-nursing-home-resident-seeks-justice-with-lawsuit\/"},"modified":"2020-11-18T10:00:46","modified_gmt":"2020-11-18T16:00:46","slug":"former-nursing-home-resident-seeks-justice-with-lawsuit","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/05\/former-nursing-home-resident-seeks-justice-with-lawsuit\/","title":{"rendered":"Former nursing home resident seeks justice with lawsuit"},"content":{"rendered":"<p>Residents of nursing homes often suffer physical and mental ailments that require constant supervision and attention. In some cases, residents may suffer from dementia or Alzheimer&#8217;s and be prone to wandering. In other cases, residents may have physical injuries that affect mobility and require close attention. Whatever the case may be, every nursing home resident should have regular evaluations and individualized care plans.<\/p>\n<p>Many nursing homes claim to provide a safe and caring environment for residents. While many delivery on such promises, others fall short and fail to protect vulnerable residents from fall injuries or bed sores.<\/p>\n<p>One former female resident of a nursing home recently filed a nursing home negligence lawsuit in which she accuses the named defendants of neglect and failing to provide the quality and level of care promised.<\/p>\n<p>The former resident lived at the nursing home for roughly seven months. According to the lawsuit, during this time, the woman&#8217;s health deteriorated significantly. She suffered from neglect which resulted in malnutrition and dehydration. Furthermore, the woman suffered from infections which resulted from neglect by nursing home staff.<\/p>\n<p>The woman is seeking to recover both compensatory and punitive damages related to physical, emotional and mental pain and suffering. Additionally, the woman asserts the nursing home is negligent in engaging in marketing tactics that are misrepresentative of the quality and level of care provided at the facility.<\/p>\n<p>In this case, the former resident was able to take legal action on her own behalf and fight for the injustices she experienced. In many cases, however, nursing home residents are not physically or mentally well enough to even tell family members and friends if they are suffering nursing home neglect or abuse. Family members and friends, therefore, would be wise to pay close attention to overall health and wellbeing of a loved one and make note of unexplained injuries or odd behavior.<\/p>\n<p>&nbsp;<\/p>\n<p><b>Source: <\/b>The West Virginia Record,&#8221; Former resident sues Genesis Healthcare for nursing home negligence,&#8221; Kyla Asbury, May 17, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Residents of nursing homes often suffer physical and mental ailments that require constant supervision and attention. In some cases, residents may suffer from dementia or Alzheimer&#8217;s and be prone to wandering. In other cases, residents may have physical injuries that affect mobility and require close attention. Whatever the case may be, every nursing home resident should have regular evaluations and&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[22],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47735"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47735"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47735\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47735"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47735"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47735"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}