{"id":47744,"date":"2013-04-25T00:00:00","date_gmt":"2013-04-25T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/04\/nursing-home-named-in-lawsuit-after-residents-death\/"},"modified":"2020-11-18T09:56:41","modified_gmt":"2020-11-18T15:56:41","slug":"nursing-home-named-in-lawsuit-after-residents-death","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/04\/nursing-home-named-in-lawsuit-after-residents-death\/","title":{"rendered":"Nursing home named in lawsuit after resident&#8217;s death"},"content":{"rendered":"<p>One of the most difficult decisions a family must make relates to the long-term care of an elderly loved one. In many cases, family members are unable or ill-equipped to handle the growing responsibilities often associated with caring for an elderly mother, father or relative. As a result, many families take comfort in entrusting the care of a loved one to professionals at a skilled nursing home facility.<\/p>\n<p>While many such nursing homes are reputable with caring and attentive staff, some fail to adequately monitor and care for residents. The estate of a resident at one Ohio nursing home recently filed a lawsuit in which allegations related to nursing home neglect are mentioned as contributing to the death of the 84-year-old woman.<\/p>\n<p>According to the lawsuit, the 84-year-old was allowed by nursing home staff members to wander out of the facility in the middle of the night. As a result, the elderly resident suffered multiple injuries including those to her head, legs and arms. She also suffered from the ill-effects of hypothermia and eventually died.<\/p>\n<p>Named in the lawsuit as defendants, are the nursing home and a resident-care assistant who was on duty when the resident left the facility. At the time the incident occurred, the resident-care assistant was the only employee on duty and was responsible for the monitoring, safety and wellbeing of roughly 30 residents. An investigation by officials with the Ohio Department of Health concluded that dangerous and problematic conditions were present at the nursing home.<\/p>\n<p>Individuals who have suffered abuse or negligent at a nursing home facility have rights and may choose to pursue legal action. Likewise, family members who have witnessed the abuse or neglect of a loved one at a nursing home would be wise to contact an attorney who has experience in handling such matters.<\/p>\n<p>Source: The Vindicator, &#8220;Estate of woman who died at nursing home sues,&#8221; April 11, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the most difficult decisions a family must make relates to the long-term care of an elderly loved one. In many cases, family members are unable or ill-equipped to handle the growing responsibilities often associated with caring for an elderly mother, father or relative. As a result, many families take comfort in entrusting the care of a loved one&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[22],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47744"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47744"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47744\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47744"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47744"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47744"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}