{"id":47750,"date":"2013-04-05T00:00:00","date_gmt":"2013-04-05T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/04\/drivers-failure-to-yield-results-in-two-injured\/"},"modified":"2019-10-03T22:01:48","modified_gmt":"2019-10-04T03:01:48","slug":"drivers-failure-to-yield-results-in-two-injured","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/04\/drivers-failure-to-yield-results-in-two-injured\/","title":{"rendered":"Driver&#8217;s failure to yield results in two injured"},"content":{"rendered":"<p>Drivers who fail to follow traffic laws put their lives and those of other drivers and passengers at risk. Such driving errors occur for a variety of reasons. In many cases, car accidents arise when drivers are distracted or simply fail to pay attention. One such accident involving an Ohio man recently resulted in a <a href=\"http:\/\/www.lvtbd.com\/Auto-Accident-Injuries\/Car-Accidents\/\" target=\"_blank\">car accident<\/a> that sent two individuals to the hospital.<\/p>\n<p>The two-car accident occurred during the early afternoon hours as a 75-year-old male driver approached an intersection. At that same time a Ford Mustang with two occupants approached the same intersection. The 75-year-old driver failed to yield the right of way to the Mustang and instead proceeded to drive through the intersection. Upon doing so, he crashed into the side of the Mustang.<\/p>\n<p>As a result of the collision, both occupants in the Mustang sustained injures for which they required medical care. They were taken to a nearby hospital where medical personnel reported they sustained non-life-threatening injuries. The 75-year-old driver was not injured in the crash.<\/p>\n<p>Car accidents such as this occur nearly every day throughout the state of Ohio. In many cases, individuals involved in such accidents sustain serious injuries that require both immediate and ongoing medical attention. Even seemingly minor car accidents can result in painful injuries such as whiplash, back and spinal problems and simple fractures. In some cases, such injuries require individuals to undergo physical therapy and miss work.<\/p>\n<p>Ohio residents who have been injured in a car accident caused by another driver would be wise to consult with an attorney. In such cases, a personal injury lawsuit may be an appropriate means to help injured individuals recoup compensation related to medical expenses, lost wages and pain and suffering.<\/p>\n<p>Source: The Post-Journal, &#8220;Elderly Ohio Man Charged In Two-Car Accident,&#8221; March 16, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Drivers who fail to follow traffic laws put their lives and those of other drivers and passengers at risk. Such driving errors occur for a variety of reasons. In many cases, car accidents arise when drivers are distracted or simply fail to pay attention. One such accident involving an Ohio man recently resulted in a car accident that sent two&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47750"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47750"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47750\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47750"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47750"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47750"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}