{"id":47780,"date":"2013-01-15T00:00:00","date_gmt":"2013-01-15T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2013\/01\/truck-accident-flips-street-sweeper-and-blocks-traffic\/"},"modified":"2019-10-03T22:02:11","modified_gmt":"2019-10-04T03:02:11","slug":"truck-accident-flips-street-sweeper-and-blocks-traffic","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2013\/01\/truck-accident-flips-street-sweeper-and-blocks-traffic\/","title":{"rendered":"Truck accident flips street sweeper and blocks traffic"},"content":{"rendered":"<p>The roadways of Ohio are traveled daily by vehicles of varying sizes, some of which are carrying loads, some hazardous and some not. The drivers of commercial motor vehicles and their employers are held to a higher standard of care than other drivers and are required to follow additional legislation due to the nature of their vehicles and the nature of the loads that they carry while traveling. When these vehicles are involved in a <a href=\"\/auto-accident-injuries\/truck-accidents\/\">truck accident<\/a>, the outcome can be very severe and sometimes tragic.<\/p>\n<p>A recent Ohio accident involved a tractor-trailer and a street sweeper. The accident occurred around 4:00 in the morning when the driver of the tractor-trailer rear-ended the street sweeper. The collision caused the street sweeper to flip on its side, therefore, blocking three lanes of traffic. The driver of the street sweeper was sent to the hospital to be treated for his injuries. This accident is still under investigation so the severity of the injuries is unknown at this time.<\/p>\n<p>If the driver of the semi is determined to be negligent therefore contributing to the occurrence of this crash it could have a detrimental impact on his life. It could ultimately mean the loss of a commercial drivers&#8217; license which in turn means the loss of livelihood. However, if the driver was not driving with the appropriate standard of care, it is important that the driver is held accountable for their actions.<\/p>\n<p>When an investigation determines that a driver involved in a truck accident was negligent, the other parties involved in the crash may be able to recover compensation from that negligent driver if those others suffered injuries as a result of the crash. The damages that they may be able to recover will help them to pay for financial obligations that arise as a result of the accident such as medical bills, property damage and potentially lost wages.<\/p>\n<p><strong>Source: <\/strong>WDTN.com, &#8220;All lanes open following crash on I-75,&#8221; David Robinson, Jan. 7, 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The roadways of Ohio are traveled daily by vehicles of varying sizes, some of which are carrying loads, some hazardous and some not. The drivers of commercial motor vehicles and their employers are held to a higher standard of care than other drivers and are required to follow additional legislation due to the nature of their vehicles and the nature&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47780"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47780"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47780\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47780"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47780"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47780"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}