{"id":47792,"date":"2012-12-13T00:00:00","date_gmt":"2012-12-13T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/12\/texting-while-driving-car-accident-causes-death-of-10-year-old\/"},"modified":"2020-11-18T10:23:56","modified_gmt":"2020-11-18T16:23:56","slug":"texting-while-driving-car-accident-causes-death-of-10-year-old","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/12\/texting-while-driving-car-accident-causes-death-of-10-year-old\/","title":{"rendered":"Texting while driving car accident causes death of 10-year-old"},"content":{"rendered":"<p>As smart phones become more and more popular amongst Americans, distracted driving habits, such as texting while driving, have also become more prevalent in the news. Lawmakers are cracking down on drivers who cause car accidents because of distraction by portable electronics. A recent case in Ohio is no different. A driver that was texting while driving has been sentenced to almost five years in prison.<\/p>\n<p>The 31-year-old driver was looking at a text message on his phone when he rear-ended the car in front of him. The impact caused the car in front of him to be pushed into oncoming traffic. The car in front of him was then struck by oncoming traffic, causing the death of a 10-year-old passenger in the vehicle. The driver and a second passenger in the vehicle suffered non-life threatening injuries. The man has been charged with vehicular homicide and aggravated vehicular assault.<\/p>\n<p>These are criminal charges. However, there are civil penalties in situations such as this one. When an individual is injured in a car crash due to the negligence of another person, they have a civil cause of action for personal injury against that negligent individual. When someone is fatally injured, their loved ones have a wrongful death cause of action against the negligent party.<\/p>\n<p>In this situation, the three people in the car in front of the texting driver were family members. In such a case, it may be possible that the surviving victims would be able to successfully file a lawsuit against a driver for their injuries, plus the wrongful death of any family member who was killed in the accident. Altogether, plaintiffs in such a case may be able to recover compensation to cover medical bills, lost wages, death expenses and pain and suffering.<\/p>\n<p><strong>Source: <\/strong>San Francisco Chronicle, &#8220;Texting driver gets prison in Ohio fatal crash,&#8221; Nov. 29, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As smart phones become more and more popular amongst Americans, distracted driving habits, such as texting while driving, have also become more prevalent in the news. Lawmakers are cracking down on drivers who cause car accidents because of distraction by portable electronics. A recent case in Ohio is no different. A driver that was texting while driving has been sentenced&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47792"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47792"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47792\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47792"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47792"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47792"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}