{"id":47795,"date":"2012-12-06T00:00:00","date_gmt":"2012-12-06T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/12\/ohio-truck-driver-sentenced-for-fatal-accident\/"},"modified":"2019-10-03T22:02:21","modified_gmt":"2019-10-04T03:02:21","slug":"ohio-truck-driver-sentenced-for-fatal-accident","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/12\/ohio-truck-driver-sentenced-for-fatal-accident\/","title":{"rendered":"Ohio truck driver sentenced for fatal accident"},"content":{"rendered":"<p>Personal injury litigation following any Ohio car accident can become very complicated. However, when injuries have been caused by a <a href=\"\/auto-accident-injuries\/truck-accidents\/\">truck accident<\/a>, the process can become even more complicated.<\/p>\n<p>Truck drivers are held to a higher standard of care than other drivers operating passenger vehicles. This is largely due, not only to the size of these commercial motor vehicles, but also to the potentially dangerous nature of the loads that they carry in these large vehicles. This means that accidents involving semi-trucks require very careful analysis.<\/p>\n<p>A perfect example is a truck driver in Ohio who has recently been sentenced for causing a fatal crash that killed three individuals. The semi crushed a vehicle carrying three individuals that were headed to the airport. All three were fatally injured. The driver has been sentenced to 90 days house arrested, and his driver&#8217;s license has been suspended for five years.<\/p>\n<p>Driver&#8217;s license suspension is a large penalty for truck drivers in these instances. Truck driving is their livelihood, and they need a commercial driver&#8217;s license to operate these vehicles. When that license is suspended, truck drivers are forced to find a new source of income.<\/p>\n<p>Although it is unknown whether medical bills are being compensated in this case, sometimes the injured or their families can also receive compensation for medical expenses incurred as a result of the accident. Some of the steps that must be taken following a truck accident include the following:<\/p>\n<p>&bull; Partnership with trucking experts and accident reconstruction experts;<\/p>\n<p>&bull; Examination of accident reports and interviewing witnesses;<\/p>\n<p>&bull; In depth review of medical bills, records of prognosis and severity of injuries; and<\/p>\n<p>&bull; Review truck maintenance logs, driver logs, truck company training procedures and driving records to determine if any interstate commerce regulations were violated.<\/p>\n<p>If all of these steps are followed, the injured or their family will likely receive the compensation to which they are entitled.<\/p>\n<p><strong>Source: <\/strong>WFMJ.com, &#8220;<a href=\"http:\/\/www.wfmj.com\/story\/20198117\/driver-sentenced-for-triple-fatal-crash-on-i-80\" target=\"_blank\">Driver sentenced for triple fatal crash on I-80<\/a>,&#8221; Nov. 27, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Personal injury litigation following any Ohio car accident can become very complicated. However, when injuries have been caused by a truck accident, the process can become even more complicated. Truck drivers are held to a higher standard of care than other drivers operating passenger vehicles. This is largely due, not only to the size of these commercial motor vehicles, but&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47795"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47795"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47795\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47795"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47795"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47795"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}