{"id":47801,"date":"2012-12-20T00:00:00","date_gmt":"2012-12-20T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/12\/foggy-conditions-may-have-led-to-fatal-car-wreck-on-ohio-road\/"},"modified":"2019-10-03T22:02:27","modified_gmt":"2019-10-04T03:02:27","slug":"foggy-conditions-may-have-led-to-fatal-car-wreck-on-ohio-road","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/12\/foggy-conditions-may-have-led-to-fatal-car-wreck-on-ohio-road\/","title":{"rendered":"Foggy conditions may have led to fatal car wreck on Ohio road"},"content":{"rendered":"<p>Big rigs are traveling the roads of Ohio day in and day out. Semi drivers are required to exercise a certain elevated standard of care when driving on the roads due not only to the nature of the vehicles that they are driving, but also, due to the hazardous nature of the loads they often carry. Often times, a collision involving a semi can quickly become a fatal car wreck. Unfortunately, this recently occurred in an accident in Ohio.<\/p>\n<p>An Ohio driver was killed in an accident in the early morning on Wednesday December 5. The 64-year-old man was traveling down the road in his Mustang when a semi pulled out in front of him from an exit ramp. This caused a collision between the two vehicles. The driver of the Mustang was pronounced dead at the scene of the accident.<\/p>\n<p>This accident occurred in allegedly very foggy conditions. The exact circumstances surrounding the accident are still being investigated, and it is unknown at this time whether the prosecutors will charge the truck driver.<\/p>\n<p>Even though it may be unknown whether either party was at fault in this situation since the fog was so heavy, it is always a good idea for a family who has unexpectedly lost a loved one in a tragic car accident to seek out the assistance of an experienced personal injury attorney. Often times in situations like this that end in death, the family may be able to file a wrongful death lawsuit and recover compensation.<\/p>\n<p>The loved ones of a deceased individual can file a claim for wrongful death if the death of their family member was caused by another person&#8217;s negligence. When a family successfully recovers in a wrongful death lawsuit, they can usually receive compensation for financial obligations that are accident-related such as medical bills, funeral expenses and lost wages. Although no amount of money can ever bring back a loved one, the compensation will hopefully help to relieve some of the financial pain that the family will have to endure and allow family members the time to focus on their emotional recovery.<\/p>\n<p><b>Source: <\/b>wsaz.com, &#8220;UPDATE: Name Released in Fatal Crash in Jackson County, Ohio,&#8221; Dec. 6, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Big rigs are traveling the roads of Ohio day in and day out. Semi drivers are required to exercise a certain elevated standard of care when driving on the roads due not only to the nature of the vehicles that they are driving, but also, due to the hazardous nature of the loads they often carry. Often times, a collision&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[2],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47801"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47801"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47801\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47801"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47801"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}