{"id":47808,"date":"2012-11-14T00:00:00","date_gmt":"2012-11-14T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/11\/four-vehicle-accident-leaves-two-with-only-minor-injuries\/"},"modified":"2020-11-18T10:25:42","modified_gmt":"2020-11-18T16:25:42","slug":"four-vehicle-accident-leaves-two-with-only-minor-injuries","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/11\/four-vehicle-accident-leaves-two-with-only-minor-injuries\/","title":{"rendered":"Four-vehicle accident leaves two with only minor injuries"},"content":{"rendered":"<p>Numerous residents of Columbus rely on vehicles as a form of transportation every day. Unfortunately, there are also negligent and careless drivers on the road every day. The actions of a careless driver often lead to a car accident that can have harmful and sometimes tragic outcomes.<\/p>\n<p>A recent Ohio car accident involved four vehicles and left two injured. Just before 5:00 in the afternoon, a man driving a pickup truck attempted to merge onto I-75. He lost control of his vehicle, causing him to veer off of the right side of the road and hit the guardrail. His truck then moved backwards back onto the interstate and struck the concrete barrier.<\/p>\n<p>Another vehicle traveling on the road struck the pickup truck, pushing it into the other lane where it was then hit by a semi-tractor-trailer. Meanwhile, the second vehicle spun on the road and was struck head-on by a fourth vehicle.<\/p>\n<p>Thankfully, in this situation, only two of the involved individuals had to be transported to the hospital, and they had only minor injuries. However, this is not always the case in car accidents with circumstances as serious as this one.<\/p>\n<p>When a car accident results in injured parties needing medical treatment, those injured parties may be able to receive compensation under a personal injury cause of action. However, the accident and their injuries must have been caused by a negligent driver. That negligent driver is the person from which the other injured individuals may be able to recover compensation and damages.<\/p>\n<p>Different circumstances surround every car accident, and some injuries do not have a sudden onset. It is always important to see a doctor after a car accident and, if there are injuries, to explore the potential options for recovering compensation.<\/p>\n<p><b>Source: <\/b>limaohio.com, &#8220;Four-car accident slows traffic on I-75 near Findlay,&#8221; Nov. 1, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Numerous residents of Columbus rely on vehicles as a form of transportation every day. Unfortunately, there are also negligent and careless drivers on the road every day. The actions of a careless driver often lead to a car accident that can have harmful and sometimes tragic outcomes. A recent Ohio car accident involved four vehicles and left two injured. Just&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47808"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47808"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47808\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47808"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47808"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47808"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}