{"id":47815,"date":"2012-11-09T00:00:00","date_gmt":"2012-11-09T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/11\/accident-on-ohio-roadway-causes-semi-rollover\/"},"modified":"2019-10-03T22:02:39","modified_gmt":"2019-10-04T03:02:39","slug":"accident-on-ohio-roadway-causes-semi-rollover","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/11\/accident-on-ohio-roadway-causes-semi-rollover\/","title":{"rendered":"Accident on Ohio roadway causes semi rollover"},"content":{"rendered":"<p>Any accident involving an 18-wheeler has the potential to be devastating for all parties involved. This is especially true when a <a href=\"\/auto-accident-injuries\/truck-accidents\/\" target=\"_blank\">truck accident<\/a> involves other vehicles that are much smaller. The nature of semi tractor trailers makes them particularly dangerous and, at times, lethal. The size disparity between a semi and other vehicles, paired with the often dangerous, hazardous or toxic loads that they carry, make most other vehicles a poor candidate for survival against a semi.<\/p>\n<p>A recent semi tractor trailer accident in Ohio left part of the interstate closed down for the morning following the crash. An SUV was stopped on the road at around 5:30 in the morning after striking a deer. A semi that was approaching the SUV from behind struck the SUV causing the semi to roll over onto its side.<\/p>\n<p>In this accident, thankfully, none of the involved parties were injured. However, this is not often the case. When an accident involving a semi causes injuries to another, the case can quickly become very complicated. This is true because the drivers of these large vehicles hold commercial drivers&#8217; licenses, and are therefore held to a higher standard and a different set of rules than other drivers on the road.<\/p>\n<p>In these situations, it is important to examine accident reports, investigate the accident and talk to witnesses to determine exactly how the events unfolded. Truck drivers and truck companies are required to keep logs of driver hours, which cannot exceed a specific limit, and truck maintenance. They are also required to follow specific training guidelines. If any of these standards were not met, it can mean<a><\/a> very severe consequences for the truck driver and trucking company, and can be paramount to the injured individual&#8217;s case.<\/p>\n<p>When an individual is injured by a negligent semi driver, they may be entitled to compensation for their injuries and other financial obligations that can be tied back to the accident. Anyone who is injured by a semi driver should be compensated accordingly.<\/p>\n<p><strong>Source: <\/strong>The Medina-Gazette, &#8220;<a href=\"http:\/\/medinagazette.northcoastnow.com\/2012\/10\/30\/semi-truck-accident-closes-part-of-i-71-south-in-westfield-twp\/\" target=\"_blank\">Semi truck accident closes part of I-71 south in Westfield Twp.<\/a>,&#8221; Steve Grazier, Oct. 30, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Any accident involving an 18-wheeler has the potential to be devastating for all parties involved. This is especially true when a truck accident involves other vehicles that are much smaller. The nature of semi tractor trailers makes them particularly dangerous and, at times, lethal. The size disparity between a semi and other vehicles, paired with the often dangerous, hazardous or&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47815"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47815"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47815\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47815"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47815"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47815"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}