{"id":47828,"date":"2012-10-05T00:00:00","date_gmt":"2012-10-05T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/10\/sports-related-tbis-at-the-forefront-of-research\/"},"modified":"2019-10-03T22:02:52","modified_gmt":"2019-10-04T03:02:52","slug":"sports-related-tbis-at-the-forefront-of-research","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/10\/sports-related-tbis-at-the-forefront-of-research\/","title":{"rendered":"Sports-related TBIs at the forefront of research"},"content":{"rendered":"<p>There are many types of catastrophic injuries and numerous different situations that can cause these very unfortunate injuries. When it comes to <a href=\"http:\/\/www.lvtbd.com\/Other-Practice-Areas\/Catastrophic-Injuries\/\" target=\"_blank\">traumatic brain injuries<\/a>, they are often caused by traffic accidents, construction accidents and falls. However, a common misconception is that brain injuries and concussions are always caused by a blow to the head. Readers in Columbus may be interested to know that this is not always the case.<\/p>\n<p>Most recently, sports-related concussions and brain injuries have gained a lot of press and, therefore, have come to the forefront of research efforts to further understand the underlying issues. One notable conclusion so far is that a concussion can be caused by any form of trauma, whether it is whiplash, a loud explosion or an accelerated turning of the head.<\/p>\n<p>NFL players and military veterans are helping the medical community learn a lot about traumatic brain injuries. The symptoms manifest both physically and emotionally. Some of the physical symptoms may include blurred vision, hearing loss, nausea, headache, dizziness and sensitivity to light. The emotional symptoms may include confusion, memory loss, fatigue, irritability, sadness and nervousness.<\/p>\n<p>Doctors want athletes and their parents to know that, while the patient is recovering, the brain is much more susceptible to further injury. Therefore, it is very important to keep them off of the playing field until it is certain they have recovered fully.<\/p>\n<p>Doctors also want parents of young athletes to be aware of the risks that certain sports may pose. Children are not able to fully control their neck muscles until they become teenagers. This makes soccer a particularly concerning sport. The quick head moves required make young children in this game more likely to suffer from brain injuries.<\/p>\n<p>When an individual suffers from a catastrophic injury such as a brain injury, it is important to seek the necessary treatment and start the recovery process as quickly as possible. However, this process can be expensive. If the brain injury was caused by another person&#8217;s negligence, the injured party may be entitled to compensation.<\/p>\n<p><strong>Source: <\/strong>SouthBendTribune.com, &#8220;<a href=\"http:\/\/articles.southbendtribune.com\/2012-09-25\/news\/34087550_1_concussion-symptoms-head-injuries-poor-memory\" target=\"_blank\">Head injury awareness grows<\/a>,&#8221; Margaret Fosmoe, Sept. 25, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are many types of catastrophic injuries and numerous different situations that can cause these very unfortunate injuries. When it comes to traumatic brain injuries, they are often caused by traffic accidents, construction accidents and falls. However, a common misconception is that brain injuries and concussions are always caused by a blow to the head. Readers in Columbus may be&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47828"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47828"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47828\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47828"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47828"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47828"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}