{"id":47838,"date":"2012-10-31T00:00:00","date_gmt":"2012-10-31T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/10\/collision-causes-one-death-multiple-injuries-and-damages-a-home\/"},"modified":"2019-10-03T22:02:59","modified_gmt":"2019-10-04T03:02:59","slug":"collision-causes-one-death-multiple-injuries-and-damages-a-home","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/10\/collision-causes-one-death-multiple-injuries-and-damages-a-home\/","title":{"rendered":"Collision causes one death, multiple injuries and damages a home"},"content":{"rendered":"<p>Dealing with the untimely and unexpected death of a loved one who is killed in an accident can be one of the most difficult experiences that one will endure in life. It can cause not only emotional hardship but also financial hardship. For those and many other reasons, families who lose their loved ones in a catastrophic accident caused by another person&#8217;s negligence and lack of appropriate care can often recover damages through a <a href=\"\/catastrophic-injuries-fatalities\/wrongful-death\/\" target=\"_blank\">wrongful death<\/a> lawsuit.<\/p>\n<p>In Ohio, an accident occurred when the driver of a Ford flatbed truck, which was pulling a trailer, entered an intersection in the path of a tractor-trailer. This specific intersection has a reputation as being the site of several severe and, at times, fatal vehicle accidents.<\/p>\n<p>When the vehicles collided they traveled off of the road. The collision caused the flatbed truck to spin and strike a house backwards. Meanwhile, the tractor-trailer took down a tree. In addition to this damage, the accident also caused explosions and took down power lines.<\/p>\n<p>The driver of the flatbed was killed in the accident. His two passengers as well and the tractor-trailer driver were injured and taken to hospitals.<\/p>\n<p>In cases like these, the family of a victim who was killed in an accident might be able to recover monetary damages to cover lost wages, medical expenses, death expenses and pain and suffering. However, the cause and the responsible party need to be determined.<\/p>\n<p>Additionally, no matter what the circumstances are, situations like this prove that it is always important to seek the counsel of an attorney when there is a fatal car wreck or truck accident. This professional can be an advocate and can determine the best plan of action to get the compensation the injured party or the victim&#8217;s family may be entitled to receive.<\/p>\n<p><strong>Source: <\/strong>Montgomeryville-Lansdale Patch, &#8220;Montgomery Man Driving Semi in Fiery Ohio Crash That Killed One, Destroyed Home,&#8221; Tony Di Domizio, Oct. 17, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dealing with the untimely and unexpected death of a loved one who is killed in an accident can be one of the most difficult experiences that one will endure in life. It can cause not only emotional hardship but also financial hardship. For those and many other reasons, families who lose their loved ones in a catastrophic accident caused by&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[2],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47838"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47838"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47838\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47838"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47838"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47838"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}