{"id":47832,"date":"2012-10-09T00:00:00","date_gmt":"2012-10-09T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/10\/semi-accident-leaves-74-year-old-dead-and-three-others-injured\/"},"modified":"2019-10-03T22:02:55","modified_gmt":"2019-10-04T03:02:55","slug":"semi-accident-leaves-74-year-old-dead-and-three-others-injured","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/10\/semi-accident-leaves-74-year-old-dead-and-three-others-injured\/","title":{"rendered":"Semi accident leaves 74-year-old dead and three others injured"},"content":{"rendered":"<p>All drivers on the road must obey the laws that are set out to make the roadways a safer place to travel. However, drivers of commercial motor vehicles are held to a higher standard of care. This is due to the nature of the vehicles, the dangerous loads they often carry and to ensure the safety not only of other drivers on the road but also the drivers of these large vehicles.<\/p>\n<p>When a <a href=\"\/auto-accident-injuries\/truck-accidents\/\">truck accident<\/a> occurs, it can become a very complicated situation. This is because it is important to determine whether the truck driver obeyed all of the laws that apply to commercial motor vehicles and their drivers. Truck accidents can also be very emotionally draining situations. Given the size, build and sheer power of an 18-wheeler, other cars do not usually hold up very well when an accident occurs. This often means the driver of a smaller vehicle suffers from very serious, and sometimes fatal, injuries.<\/p>\n<p>A recent truck crash that occurred in Ohio has resulted in the tragic death of a 74-year-old woman. The woman was a passenger in an SUV that was traveling down the highway when they pulled in front of a semi, leading to the crash. The driver of the SUV, her other passenger and the driver of the semi were all transported to the hospital to be treated for their injuries. The 74-year-old passenger was pronounced dead at the scene of the accident.<\/p>\n<p>Although it appears to authorities that the driver of the SUV was a contributing factor to the occurrence of this accident, that is not always the case. When a truck crash occurs, no matter whether it appears initially that the semi driver is not at fault, it is always important to analyze the scene of the accident, truck driver records and driver logs to ensure that they have complied with the set guidelines that must be followed.<\/p>\n<p><a><\/a><\/p>\n<p>If there has been an hours of service, training, maintenance or other violation on the part of the truck driver or their employer, or if the driver was negligent in some other way, the injured party may be entitled to compensation to assist them in recovering from their injuries. In the very unfortunate situation that someone is fatally injured, then their family may be able to recover compensation from the negligent parties involved in the accident.<\/p>\n<p><strong>Source: <\/strong>The Columbus Dispatch, &#8220;<a href=\"http:\/\/www.dispatch.com\/content\/stories\/local\/2012\/09\/25\/Utica-fatal-wreck.html\" target=\"_blank\">Woman killed in Licking County crash<\/a>,&#8221; Holly Zachariah, Sept. 25, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>All drivers on the road must obey the laws that are set out to make the roadways a safer place to travel. However, drivers of commercial motor vehicles are held to a higher standard of care. This is due to the nature of the vehicles, the dangerous loads they often carry and to ensure the safety not only of other&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47832"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47832"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47832\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47832"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47832"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47832"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}