{"id":47844,"date":"2012-09-10T00:00:00","date_gmt":"2012-09-10T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/09\/motorcyclist-killed-in-semi-accident\/"},"modified":"2019-10-03T22:03:04","modified_gmt":"2019-10-04T03:03:04","slug":"motorcyclist-killed-in-semi-accident","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/09\/motorcyclist-killed-in-semi-accident\/","title":{"rendered":"Motorcyclist killed in semi accident"},"content":{"rendered":"<p>All types of vehicular accidents have the potential to cause injuries to the parties involved. However, certain vehicles, such as an 18 wheeler, can cause more damage while others, such a motorcycle, are more susceptible to damage.<\/p>\n<p>Therefore, a <a href=\"\/auto-accident-injuries\/truck-accidents\/\" target=\"_blank\">truck accident<\/a> involving a semi and a motorcycle has an increased probability of having a tragic and potentially fatal outcome. This was the situation in a recent Ohio semi accident involving a motorcycle.<\/p>\n<p>At around 3:45 a.m., a motorcycle hit the rear of a semi tractor-trailer. According to police, the semi stopped due to a mechanical problem. When it re-entered the interstate, the motorcycle crashed into it. The driver of the motorcycle was pronounced dead at the scene of the accident.<\/p>\n<p>Accidents involving commercial motor vehicles have an added complexity. Due to the nature of the vehicle and the loads they often carry, there are rules and regulations that apply specifically to semis and their drivers. It is therefore important that a thorough investigation is done in these types of accidents to ensure that all these rules and regulations were being followed by the driver of the truck.<\/p>\n<p>If any regulations were not followed and it is found that the truck driver was negligent for not meeting the appropriate standard of care, the injured party will most likely be able to recover compensation. This will help the victim to cover any expenses that arise as a result of the accident.<\/p>\n<p>In situations where the accident results in a fatality, the family of the deceased may be able to recover compensation under a wrongful death cause of action. Although nothing will bring back a lost loved one, receiving compensation can help to ease some of the financial stress. It could also provide family members with the time and resources needed to spend on more important responsibilities surrounding the death of their loved one.<\/p>\n<p><strong>Source: <\/strong>Therepublic.com, &#8220;Police say motorcycle rider dies in Ohio after crashing into semi&#8217;s rear on I-70,&#8221; Sep. 4, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>All types of vehicular accidents have the potential to cause injuries to the parties involved. However, certain vehicles, such as an 18 wheeler, can cause more damage while others, such a motorcycle, are more susceptible to damage. Therefore, a truck accident involving a semi and a motorcycle has an increased probability of having a tragic and potentially fatal outcome. This&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47844"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47844"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47844\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47844"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47844"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47844"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}