{"id":47856,"date":"2012-08-03T00:00:00","date_gmt":"2012-08-03T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/08\/ohio-accident-near-construction-zone-leaves-1-dead\/"},"modified":"2019-10-03T22:03:12","modified_gmt":"2019-10-04T03:03:12","slug":"ohio-accident-near-construction-zone-leaves-1-dead","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/08\/ohio-accident-near-construction-zone-leaves-1-dead\/","title":{"rendered":"Ohio accident near construction zone leaves 1 dead"},"content":{"rendered":"<p>The lives of an individual and their loved ones can be changed and potentially shattered in the instantaneous occurrence of an unexpected accident. Accidents that result in a tragic death can come in many forms. But no matter what the form, the situation is always life shattering for those involved.<\/p>\n<p>Although nothing will bring back a lost loved one, a <a href=\"\/catastrophic-injuries-fatalities\/wrongful-death\/\" target=\"_blank\">wrongful death<\/a> action may help to make the post-accident experience slightly less stressful. A recent accident in an Ohio construction zone may leave the loved ones of one fatally injured man with standing for a wrongful death lawsuit.<\/p>\n<p>Early on July 13, two cars crashed in a construction zone on Interstate 75 in West Carrollton, Ohio. The driver of one of the cars was fatally injured and his passenger is in critical condition. The investigation into the fatal car wreck is still pending, but it is known that there have been 26 accidents in that area since the beginning of the road construction in the spring of 2011. Depending upon the results of that investigation, those family members may have a wrongful death cause of action.<\/p>\n<p>A wrongful death lawsuit can be filed when one person&#8217;s death is caused by the negligence and lack of care of another party. In this case, there could have been a lack of care on the part of the other driver or on the city that set up the construction zone. Although there have only been two previous injuries in this construction zone, 26 prior accidents is a lot.<\/p>\n<p>When a family is successful with their wrongful death claim, they will be rewarded monetary compensation. This compensation will assist them will expenses that arise as a result of the accident. Some of these expenses may include funeral fees, medical bills, property damage and also potentially pain and suffering and loss of consortium.<a><\/a><\/p>\n<p><strong>Source: <\/strong>WDTN, &#8220;Cruiser video of I-75 fatal scene,&#8221; Pam Elliot, July 17, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The lives of an individual and their loved ones can be changed and potentially shattered in the instantaneous occurrence of an unexpected accident. Accidents that result in a tragic death can come in many forms. But no matter what the form, the situation is always life shattering for those involved. Although nothing will bring back a lost loved one, a&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[2],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47856"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47856"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47856\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47856"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47856"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47856"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}