{"id":47868,"date":"2012-07-10T00:00:00","date_gmt":"2012-07-10T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/07\/ohio-man-killed-in-multi-vehicle-truck-accident\/"},"modified":"2019-10-03T22:03:23","modified_gmt":"2019-10-04T03:03:23","slug":"ohio-man-killed-in-multi-vehicle-truck-accident","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/07\/ohio-man-killed-in-multi-vehicle-truck-accident\/","title":{"rendered":"Ohio man killed in multi-vehicle truck accident"},"content":{"rendered":"<p>When an accident on a highway alters driving conditions for other motorists traveling the same route, everyone on the road has an obligation to exercise due caution to prevent those road conditions from causing injuries. Unfortunately, this appears not to have been the case in a recent <a href=\"\/auto-accident-injuries\/truck-accidents\/\" target=\"_blank\">truck accident<\/a> that took an Ohio man&#8217;s life.<\/p>\n<p>The crash happened on Interstate 70 in the aftermath of a previous collision. As usual, traffic was slowed while authorities and medical responders dealt with the accident and cleaned up the site. Unfortunately, as vehicles were approaching the scene of the first accident, another crash occurred.<\/p>\n<p>The second accident involved two semis, a van and a truck. According to authorities, the exact cause of the crash has yet to be determined, but the driver of the van suffered fatal injuries. Pending the results of the investigation, the man&#8217;s family may look into the possibility of filing a wrongful death claim if negligence is shown to be a factor in the crash.<\/p>\n<p>Ohio residents should be aware that the legalities associated with a commercial truck accident are much different than those&nbsp;related to&nbsp;a crash involving smaller vehicles. This is because drivers of commercial vehicles and their employers are held to a higher standard of safety than other drivers on the road. These higher standards are necessary because of the large and potentially dangerous loads carried by tractor-trailers. Drivers of commercial buses are likewise held to a higher standard because of the size of the vehicles and their precious cargo.<\/p>\n<p>As for an accident involving a semi truck, it is important for victims to determine whether the truck driver upheld the legal standards for operating a commercial vehicle. If the driver has behaved negligently, then the injured parties or their families should be able to recover compensation for damages, even when those damages include the immense void left by the sudden loss of a loved one.<\/p>\n<p><strong>Source: <\/strong>pal-item.com, &#8220;Preble County crash on I-70 kills Ohio man,&#8221; July 3, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When an accident on a highway alters driving conditions for other motorists traveling the same route, everyone on the road has an obligation to exercise due caution to prevent those road conditions from causing injuries. Unfortunately, this appears not to have been the case in a recent truck accident that took an Ohio man&#8217;s life. The crash happened on Interstate&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47868"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47868"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47868\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47868"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47868"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47868"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}