{"id":47862,"date":"2012-08-17T00:00:00","date_gmt":"2012-08-17T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/08\/a-weekend-brain-injury-is-deadlier-than-a-weekday-brain-injury\/"},"modified":"2019-10-03T22:03:17","modified_gmt":"2019-10-04T03:03:17","slug":"a-weekend-brain-injury-is-deadlier-than-a-weekday-brain-injury","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/08\/a-weekend-brain-injury-is-deadlier-than-a-weekday-brain-injury\/","title":{"rendered":"A weekend brain injury is deadlier than a weekday brain injury"},"content":{"rendered":"<p>It goes without saying that catastrophic injuries should be dealt with immediately by victims and medical professionals. However, a recent study shows that those who suffer <a href=\"http:\/\/www.lvtbd.com\/Other-Practice-Areas\/Catastrophic-Injuries\/\" target=\"_blank\">traumatic brain injuries<\/a> during a weekend are more likely to die from those injuries.<\/p>\n<p>The general statistics surrounding brain injuries in the United States may shock Ohio residents. Every year, over 1 million Americans experience head trauma that requires a visit to the hospital. More than 50,000 of those patients die from these injuries, and almost a quarter of a million require additional care.<\/p>\n<p>If these statistics are not stunning enough, readers in Columbus may be surprised to know that those suffering from a head injury on the weekend are 14 percent more likely to die than those experiencing these types of wounds on a weekday. Age and cost were both ruled out as potential factors in the statistics.<\/p>\n<p>These numbers come from a recently released study by researchers at Johns Hopkins. The researchers even referred to this phenomenon as the &#8220;weekend effect,&#8221; which occurs because hospitals have less staff on the weekends and specialists are not readily accessible.<\/p>\n<p>The study also showed that the weekend effect becomes more serious as the patient&#8217;s age increases. For example, the rate of hospitalization and death due to head injuries is highest in patients over 75 years old.<\/p>\n<p>As far as addressing this problem, some suggested options include staffing hospitals to their full levels on weekends or immediately transporting older patients with head wounds to the nearest trauma center with the necessary resources. Although these options may be more expensive, they are worth it if they save lives.<\/p>\n<p>It is important that individuals with a traumatic brain injury or other catastrophic injuries seek medical and professional assistance as quickly as possible. These individuals may also be entitled to compensation for their injuries if they were caused by the negligence of another person.<\/p>\n<p><strong>Source: <\/strong>Medical News Today, &#8220;<a href=\"http:\/\/www.medicalnewstoday.com\/articles\/248677.php\" target=\"_blank\">Head Trauma Patients More Likely To Die At Weekends<\/a>,&#8221; Sarah Glynn, Aug. 7, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It goes without saying that catastrophic injuries should be dealt with immediately by victims and medical professionals. However, a recent study shows that those who suffer traumatic brain injuries during a weekend are more likely to die from those injuries. The general statistics surrounding brain injuries in the United States may shock Ohio residents. Every year, over 1 million Americans&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47862"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47862"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47862\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47862"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47862"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47862"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}