{"id":47904,"date":"2012-05-24T00:00:00","date_gmt":"2012-05-24T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/05\/head-injury-ends-ohio-football-players-career\/"},"modified":"2019-10-03T22:03:56","modified_gmt":"2019-10-04T03:03:56","slug":"head-injury-ends-ohio-football-players-career","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/05\/head-injury-ends-ohio-football-players-career\/","title":{"rendered":"Head injury ends Ohio football player&#8217;s career"},"content":{"rendered":"<p>Experiencing a traumatic brain injury is always life-altering, not only for the injured individuals but also for their loved ones. Those who have suffered a serious <a href=\"http:\/\/www.lvtbd.com\/Other-Practice-Areas\/Catastrophic-Injuries\/\" target=\"_blank\">head injury<\/a> will require immediate and potentially ongoing medical treatment. There may also be a need to take legal action. And all of this can happen in just an instant. These issues have recently been brought to the public&#8217;s attention by a career-ending injury suffered by an Ohio football player.<\/p>\n<p>Many Ohio residents have enjoyed watching Andrew Sweat play football for the Ohio State Buckeyes. However, he suffered a concussion that changed his life forever, leaving him unable to take part in the sport he worked so hard to play.<\/p>\n<p>Sweat actually suffered three different concussions during his time at Ohio State. After his third head injury, he experienced a range of symptoms, including depression, dizziness and mental confusion. However, a couple of months after that last concussion, he began to feel better, so he signed a free-agent contract with the Cleveland Browns.<\/p>\n<p>Unfortunately, the first day of training camp, Sweat slipped in the shower and lightly bumped his head. The light impact caused his previously experienced symptoms to recur. It was at that moment he decided to end his career as a football player.<\/p>\n<p>Brain injuries caused by football are a hot topic right now with the many developing NFL lawsuits. But Ohio residents know that brain injuries can result from a variety of causes, including medical mistakes, car accidents and work-related accidents. In addition to the painful and disorienting symptoms described here, traumatic brain injuries can result in loss of hearing, vision and even one&#8217;s sense of smell.<\/p>\n<p>In many cases, these injuries are caused by the negligence of another party. If that is the case, injured individuals and their loved ones may have grounds for a personal injury claim. Through such an action, Ohio residents can seek monetary compensation to assist with medical bills, lost wages and other costs that arise as a result of a head injury.<\/p>\n<p><strong>Source: <\/strong>Cleveland.com, &#8220;<a href=\"http:\/\/www.cleveland.com\/browns\/index.ssf\/2012\/05\/concussion_symptoms_end_footba.html\" target=\"_blank\">Concussion symptoms end football career for OSU&#8217;s Andrew Sweat<\/a>,&#8221; Doug Lesmerises, May 15, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Experiencing a traumatic brain injury is always life-altering, not only for the injured individuals but also for their loved ones. Those who have suffered a serious head injury will require immediate and potentially ongoing medical treatment. There may also be a need to take legal action. And all of this can happen in just an instant. These issues have recently&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47904"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47904"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47904\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47904"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47904"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47904"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}