{"id":47925,"date":"2012-03-29T00:00:00","date_gmt":"2012-03-29T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/03\/traumatic-brain-injuries-can-have-lifelong-impacts\/"},"modified":"2019-10-03T22:04:15","modified_gmt":"2019-10-04T03:04:15","slug":"traumatic-brain-injuries-have-lifelong-impacts","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/03\/traumatic-brain-injuries-have-lifelong-impacts\/","title":{"rendered":"Traumatic brain injuries can have lifelong impacts"},"content":{"rendered":"<p>Every year, over 50,000 people die from traumatic brain injuries, and another 275,000 are hospitalized. Traumatic brain injuries have a lasting impact on the lives of victims and their loved ones, and one Ohio woman who was a victim of a brain injury in January is still facing difficulties on the path to recovery.<\/p>\n<p>The woman, then a fifth-grade teacher, was driving her car when another vehicle on the road ran a stop sign. The vehicles collided, and the woman&nbsp;suffered&nbsp;a traumatic brain&nbsp;injury. She says she still doesn&#8217;t remember the moments before, during and just after the crash. She now has only limited speech, and&nbsp;her brain functionality is currently rated six out of 10.<\/p>\n<p>The woman&#8217;s neuropsychologist, speech therapist and physical therapist are confident that she will regain her abilities to teach. However, recovery can be a long road. She still cannot remember the names of the nurses that work with her daily.<\/p>\n<p>With this Ohio woman&#8217;s plight in mind, readers in the Columbus area will be interested to know that March has been declared by The Brain Injury Association of America to be Brain Injury Awareness month. And, according to the Center for Disease Control and Prevention, falls are the most common cause of traumatic brain injuries, though they also commonly result from car accidents and medical mistakes.<\/p>\n<p>A brain injury can cause symptoms as mild as a headache or as serious as the inability to read, write, speak, smell and taste. It is common for many of these abilities to return with therapy. However, victims of traumatic brain injuries are forever changed by their experiences, not the least of which is the painful path to a successful recovery. In addition to physical obstacles, brain injury patients are often confronted with an array of financial and legal challenges, and victims and their families would do well to explore all of the available options for making a difficult situation better.<\/p>\n<p><strong>Source: <\/strong>News-Sentinel, &#8220;Parkview program treats traumatic brain injuries,&#8221; Ellie Bogue, March 21, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every year, over 50,000 people die from traumatic brain injuries, and another 275,000 are hospitalized. Traumatic brain injuries have a lasting impact on the lives of victims and their loved ones, and one Ohio woman who was a victim of a brain injury in January is still facing difficulties on the path to recovery. The woman, then a fifth-grade teacher,&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47925"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47925"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47925\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47925"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47925"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47925"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}