{"id":47943,"date":"2012-01-23T00:00:00","date_gmt":"2012-01-23T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/01\/serious-injuries-for-child-in-ohio-sledding-accident\/"},"modified":"2019-10-03T22:04:27","modified_gmt":"2019-10-04T03:04:27","slug":"serious-injuries-for-child-in-ohio-sledding-accident","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/01\/serious-injuries-for-child-in-ohio-sledding-accident\/","title":{"rendered":"Serious injuries for child in Ohio sledding accident"},"content":{"rendered":"<p>As winter settles in throughout Ohio, certain safety precautions have to be taken if people are to avoid weather-related injuries. Too often, premises are not made properly safe, and individuals sustain personal injuries through no fault of their own. With these issues in mind, readers in Columbus will be saddened to hear of a child who was recently taken to Nationwide Children&#8217;s Hospital in Columbus after suffering injuries in a sledding accident at a park in Wood County.<\/p>\n<p>Police in Fostoria investigated the accident after receiving a call that a child had been injured while sledding. It was decided that the incident was not criminal in nature, so police have concluded their investigation. A local news report didn&#8217;t offer many details beyond the fact that the child suffered facial and <a href=\"http:\/\/www.lvtbd.com\/Other-Practice-Areas\/Catastrophic-Injuries\/\" target=\"_blank\">brain injuries<\/a> as a result of the accident. However, the report did say that the 22-acre park has a sledding hill, picnic areas, grills, picnic tables, a walking trail and an outdoor amphitheater.<\/p>\n<p>It wasn&#8217;t indicated whether or not the child was sledding in the appropriate sledding area or whether that area was properly situated away from impediments that could cause personal injury. Even when Ohio residents take part in potentially hazardous winter games, such as sledding, it is still the duty of park and city officials to help ensure that outdoor premises are safe for the public.<\/p>\n<p>It would seem to be the case that no criminal charges should be filed, but the family of the injured child may consider investigating the degree of safety provided by the design of the park. If the child suffered injuries as a result of another party&#8217;s negligence, then the family would have the right to receive due compensation to help cover any medical bills that resulted from the accident, as well as compensation for any pain and suffering caused by this unfortunate event.<\/p>\n<p><b>Source:<\/b> advertiser-tribune.com, &#8220;Child injured while sledding,&#8221; Jill Gosche, Jan. 23, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As winter settles in throughout Ohio, certain safety precautions have to be taken if people are to avoid weather-related injuries. Too often, premises are not made properly safe, and individuals sustain personal injuries through no fault of their own. With these issues in mind, readers in Columbus will be saddened to hear of a child who was recently taken to&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47943"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47943"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47943\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47943"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47943"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47943"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}