{"id":47946,"date":"2012-01-30T00:00:00","date_gmt":"2012-01-30T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/01\/researchers-in-columbus-studying-traumatic-brain-injuries\/"},"modified":"2019-10-03T22:04:30","modified_gmt":"2019-10-04T03:04:30","slug":"researchers-in-columbus-studying-traumatic-brain-injuries","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/01\/researchers-in-columbus-studying-traumatic-brain-injuries\/","title":{"rendered":"Researchers in Columbus studying traumatic brain injuries"},"content":{"rendered":"<p>Researchers at colleges in Columbus and other areas of Ohio are working together to study the conditions and treatment of veterans who have traumatic brain injuries. Studies show that more than 19 percent of soldiers suffer from a traumatic brain injury during deployment.<\/p>\n<p>The goal of this research is to determine how patients are currently treated, improve these treatments and educate health-care professionals on how to properly handle a <a href=\"http:\/\/www.lvtbd.com\/Other-Practice-Areas\/Catastrophic-Injuries\/\" target=\"_blank\">brain injury<\/a>.<\/p>\n<p>This research project, called Joining Forces, will give medical students an understanding of the conditions of traumatic brain injuries and how they are properly treated for the most successful recovery. The project is led by first lady Michelle Obama, Jill Biden and the American Association of Colleges of Osteopathic Medicine.<\/p>\n<p>It is important to educate these students at a young age when they are eager to learn, as they are the nation&#8217;s future health-care professionals. They will be able to take this knowledge and use it to educate existing health-care workers on how to properly handle serious injuries to the head and brain.<\/p>\n<p>Although the subjects of this study are postwar veterans, traumatic brain injuries can be the result of a multitude of other accidents. These incidents include motor vehicle accidents, mistakes made during surgery, mistakes made while administering anesthesia and construction accidents. Therefore, even though the study begins with veterans, it is guaranteed to benefit individuals who have experienced a traumatic brain injury caused by any other incident, including those listed above.<\/p>\n<p>Joining Forces will likely be beneficial for many Ohio residents who suffer brain injuries. Health-care professionals are well on their way to having a better understanding of the conditions so that they can more effectively diagnose, treat and help patients recover.<\/p>\n<p><strong>Source: <\/strong>The Columbus Dispatch, &#8220;<a href=\"http:\/\/www.dispatch.com\/content\/stories\/local\/2012\/01\/13\/ohio-colleges-aid-joining-forces.html\" target=\"_blank\">Ohio colleges to aid vets with PTSD, brain injuries<\/a>,&#8221; Pat Holmes, Jan. 13, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Researchers at colleges in Columbus and other areas of Ohio are working together to study the conditions and treatment of veterans who have traumatic brain injuries. Studies show that more than 19 percent of soldiers suffer from a traumatic brain injury during deployment. The goal of this research is to determine how patients are currently treated, improve these treatments and&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47946"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47946"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47946\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47946"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47946"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47946"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}