{"id":47952,"date":"2012-01-17T00:00:00","date_gmt":"2012-01-17T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2012\/01\/ohio-high-court-patient-needed-proof-of-injuries\/"},"modified":"2021-05-24T09:42:02","modified_gmt":"2021-05-24T13:42:02","slug":"ohio-high-court-patient-needed-proof-of-injuries","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2012\/01\/ohio-high-court-patient-needed-proof-of-injuries\/","title":{"rendered":"Ohio high court: patient needed proof of injuries"},"content":{"rendered":"<p>In most states, medical malpractice plaintiffs are required to retain expert testimony before a <a href=\"http:\/\/www.lvtbd.com\/Medical-Malpractice\/\" target=\"_blank\" rel=\"noopener noreferrer\">medical malpractice<\/a> lawsuit can be filed. Ohio, however, is not one of those states. There is no requirement in Ohio for plaintiffs to retain expert testimony, but according to a recent ruling in an Ohio court, a patient&#8217;s case was dismissed precisely because such testimony wasn&#8217;t provided. The result? A surgeon was let off the hook.<\/p>\n<p>After his surgery, the patient in the case said that his back hurt worse than it did before the procedure. He also said that he had not been made aware that his back might hurt worse after the surgery, nor had he signed a consent form.<\/p>\n<p>For his part, the surgeon couldn&#8217;t exactly remember if he had informed the patient of the risks of the surgery, but he assumed that he had done so because that was his normal procedure.<\/p>\n<p>It would seem that the surgeon&#8217;s defense was pretty flimsy, but an Ohio court ended up dismissing the case because the plaintiff had not produced an expert witness who could definitively say that the surgery caused the increased pain.<\/p>\n<p>The patient&#8217;s attorney, who opted out of producing an expert witness, said he did so because Ohio law doesn&#8217;t require such a witness for a medical malpractice case. Additionally, even one of the surgeon&#8217;s experts said in a pre-trial deposition that the pain would have been caused by no other factors but the surgery.<\/p>\n<p>The patient in this case fought against the trial judge&#8217;s dismissal, and an appeals court overturned the ruling in the trial court. The result of that decision? An expansion of patients&#8217; rights in medical malpractice cases.<\/p>\n<p>The appeals court decided that physicians are engaging in a form of battery when they fail to provide informed consent. Plaintiffs in battery cases, noted the appeals court, are not required to retain expert witnesses.<\/p>\n<p>However, in another turn of events, the Academy of Medicine of Cleveland and Northern Ohio opposed the appeals court decision.<\/p>\n<p>Eventually, the state supreme court overruled the appeals court decision and sided with the trial court, saying that the link between the patient&#8217;s pain and the surgery could not be proven.<\/p>\n<p>Other Ohio residents who have been injured as a result of medical malpractice would do well to consult with a personal injury attorney who is familiar with the relevant laws. Seeking professional legal advice can help ensure that all of a patients&#8217; rights are upheld in court, and that a careful and strategic case is mounted with a view toward due compensation for what is already a painful situation.<\/p>\n<p>Source: outpatientsurgery.net, &#8220;Malpractice Case Pits Informed Consent Vs. Expert Testimony,&#8221; Leigh Page, Jan. 9, 2012<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In most states, medical malpractice plaintiffs are required to retain expert testimony before a medical malpractice lawsuit can be filed. Ohio, however, is not one of those states. There is no requirement in Ohio for plaintiffs to retain expert testimony, but according to a recent ruling in an Ohio court, a patient&#8217;s case was dismissed precisely because such testimony wasn&#8217;t&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47952"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47952"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47952\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47952"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47952"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47952"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}