{"id":47968,"date":"2011-12-16T00:00:00","date_gmt":"2011-12-16T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2011\/12\/medical-malpractice-and-wisdom-tooth-surgery\/"},"modified":"2021-05-24T09:42:15","modified_gmt":"2021-05-24T13:42:15","slug":"medical-malpractice-and-wisdom-tooth-surgery","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2011\/12\/medical-malpractice-and-wisdom-tooth-surgery\/","title":{"rendered":"Medical Malpractice and Wisdom Tooth Surgery"},"content":{"rendered":"<p>The family of a young man who was left brain dead and eventually died following wisdom tooth surgery was awarded $700,000 for medical malpractice by a Franklin County, Ohio jury. The family, represented by attorneys Tim Van Eman of Lamkin, Van Eman, Trimble &amp; Dougherty, alleged that the oral surgeon performing the surgery administered far too much anesthesia and then failed to realize when the patient went into cardiac arrest as a result. The young man suffered severe, irreversible brain damage and was in a permanent vegetative coma for five years before passing away. The family sought compensation for the suffering they endured, having sent their son and brother off for a routine procedure only to get him back permanently brain dead and being kept alive by a morass of tubes and machines.<\/p>\n<p>Unfortunately this is not the first or last incident of this type-parents of a Maryland teen who died under similar circumstances this year during wisdom tooth removal have recently filed a lawsuit as well. Wisdom tooth extraction is a common surgery that is often performed without incident, but when proper anesthesia and monitoring safeguards are not in place, the outcome can be tragic and amount to medical malpractice.<\/p>\n<p>Ohio law has many requirements in place to ensure that doctors are not subject to &#8220;frivolous&#8221; lawsuits, such as requiring any lawsuit filed against a doctor to first be reviewed by another doctor to determine whether in fact there was malpractice. Only if the reviewing doctor then signs a sworn affidavit saying that there was malpractice is a patient or family permitted to bring a lawsuit.<\/p>\n<p>Once the lawsuit is filed, doctors and their insurance companies will often still go to extreme lengths to fight any claim of malpractice. In the Ohio wisdom tooth case, the insurance company for the doctor was told by another oral surgery expert that the negligence was &#8220;indefensible&#8221; and that he could not help them fight the claim. Instead of paying the claim however, the insurance company then went to another expert to see if he could help them fight the claim. When that expert too told them that the malpractice was indefensible, they went to yet another expert, to the tune of nine experts total, before eventually settling the part of the claim that paid for the young man&#8217;s medical bills while he was in a coma. These types of tactics by insurance companies are nothing short of a disgrace to Ohio families whose loved ones are hurt or killed by the negligence of others.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The family of a young man who was left brain dead and eventually died following wisdom tooth surgery was awarded $700,000 for medical malpractice by a Franklin County, Ohio jury. The family, represented by attorneys Tim Van Eman of Lamkin, Van Eman, Trimble &amp; Dougherty, alleged that the oral surgeon performing the surgery administered far too much anesthesia and then&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47968"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47968"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47968\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47968"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47968"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47968"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}