{"id":47971,"date":"2011-12-06T00:00:00","date_gmt":"2011-12-06T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2011\/12\/impact-of-social-media-on-personal-injury-medical-malpractice-cases\/"},"modified":"2020-11-18T10:17:31","modified_gmt":"2020-11-18T16:17:31","slug":"impact-of-social-media-on-personal-injurymedical-malpractice-cases","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2011\/12\/impact-of-social-media-on-personal-injurymedical-malpractice-cases\/","title":{"rendered":"Impact of Social Media on Personal Injury\/Medical Malpractice Cases"},"content":{"rendered":"<p>People injured through the fault of another, such as a personal injury case, often must retain a lawyer and see that a lawsuit is filed on their behalf so that their rights are protected. If you are seriously injured by a negligent driver in a truck crash or car accident, or due to substandard medical care, you may need to take your case to court if the insurance company either denies responsibility, or is not willing to be fair in the settlement process. Once a claim is made, or especially when a case is filed, your health and medical history becomes &#8220;fair game&#8221; for the insurance company or defense lawyers to investigate.<\/p>\n<p>What people often don&#8217;t realize is that the insurance companies and their attorneys have been known to check social media sites to look for postings by people who have made claims for their injuries or filed cases for fair compensation. Injury claims are then compared to statements on sites like Facebook and MySpace, and if there are inconsistencies, they can be used against the injured person. For instance, if a car crash victim who claims an inability to do certain activities, then talks about doing those activities on a networking site, those posts can be exploited by the insurance company fighting the claim.<\/p>\n<p>There was an actual case in which a seriously injured crash victim claimed he couldn&#8217;t engage in vigorous activities such as bike riding like he used to.  He also said he was limited in hobbies such as painting.  Unfortunately, he posted anecdotes about himself biking and painting and then his posts were used to discredit his case and lower its value.<\/p>\n<p>Statements taken out of context can be used against even honest and truthful people and posts to social media sites can create unnecessary skepticism and potentially have a huge impact on a legal case. The personal injury lawyers at  <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>  will advise you through every step of your personal injury or medical malpractice case, including what information not to share on social networking sites.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>People injured through the fault of another, such as a personal injury case, often must retain a lawyer and see that a lawsuit is filed on their behalf so that their rights are protected. If you are seriously injured by a negligent driver in a truck crash or car accident, or due to substandard medical care, you may need to&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[23],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47971"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47971"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47971\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47971"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47971"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47971"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}