{"id":47994,"date":"2011-11-09T00:00:00","date_gmt":"2011-11-09T06:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2011\/11\/columbus-road-construction-site-a-hotbed-for-accidents\/"},"modified":"2019-10-03T22:05:03","modified_gmt":"2019-10-04T03:05:03","slug":"columbus-road-construction-site-a-hotbed-for-accidents","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2011\/11\/columbus-road-construction-site-a-hotbed-for-accidents\/","title":{"rendered":"Columbus road construction site a hotbed for accidents"},"content":{"rendered":"<p>Usually, when road construction is taking place, Ohio drivers see flashing lights, barricades, and signage to let them know they should slow down and remain alert. All drivers have a responsibility not to endanger others on the road. Unfortunately, not everyone follows the rules, and reckless or negligent drivers fail to pay attention, causing car accidents that too often result in personal injury and property damage.<\/p>\n<p>According to crash reports, one particularly hazardous Columbus thoroughfare has demanded that motorists stay on top of their roadway vigilance. Since late September, a southbound section of I-71 from the fairgrounds to I-670 has seen 49 crashes involving 108 motorists. That comes to more than 1.5 <a href=\"http:\/\/www.lvtbd.com\/Auto-Accident-Injuries\/Car-Accidents\/\" target=\"_blank\">accidents<\/a> per day.<\/p>\n<p>The exact causes for all the accidents, which occur mostly in stop-and-go traffic, aren&#8217;t yet clear. According to officials, the Ohio Department of Transportation (ODOT) is crunching crash data to figure out the reasons, which may include speed and weather.<\/p>\n<p>One ODOT spokesperson asserts that motorists need time to adjust to unfamiliar traffic patterns that may result from road construction. She goes on to say that, despite changes in the roadway, it is still the responsibility of drivers in construction zones to slow down, reduce distractions, and not make erratic or sudden movements while driving.<\/p>\n<p>&#8220;You have folks not heeding the warnings,&#8221; said the head of traffic operations for Columbus police. &#8220;We as motorists have to be prepared for the construction zone.&#8221;<\/p>\n<p>Police also report that, in two-thirds of the crashes, drivers have been cited. For those drivers who have collided with another vehicle from behind, the most common citation given has been failure to maintain a safe distance.<\/p>\n<p>While the causes for such a spike in accidents may be multiple, one primary reason would appear to be driver negligence. Those drivers whose property has been damaged or who have suffered a personal injury as a result of a crash may well have a right to monetary compensation for their troubles.<\/p>\n<p><strong>Source:<\/strong> The Columbus Dispatch, &#8220;<a href=\"http:\/\/www.dispatch.com\/content\/stories\/local\/2011\/11\/07\/danger-zone.html\" target=\"_blank\">Downtown ramp closings, detours lead to dramatic increase in wrecks<\/a>,&#8221; Robert Vitale, Nov. 7, 2011<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Usually, when road construction is taking place, Ohio drivers see flashing lights, barricades, and signage to let them know they should slow down and remain alert. All drivers have a responsibility not to endanger others on the road. Unfortunately, not everyone follows the rules, and reckless or negligent drivers fail to pay attention, causing car accidents that too often result&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47994"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=47994"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/47994\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=47994"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=47994"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=47994"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}