{"id":48038,"date":"2011-09-08T00:00:00","date_gmt":"2011-09-08T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2011\/09\/man-critically-injured-in-drunk-driving-hit-and-run\/"},"modified":"2019-10-03T22:05:32","modified_gmt":"2019-10-04T03:05:32","slug":"drunk-driving-car-accident-injured-two-columbus-pedestrians","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2011\/09\/drunk-driving-car-accident-injured-two-columbus-pedestrians\/","title":{"rendered":"Man critically injured in drunk driving hit-and-run"},"content":{"rendered":"<p>In the past five years more than 1,800 people have died in drunk driving-related accidents in Ohio, according to the Mothers Against Drunk Driving Web site. Often these accidents are caused by drivers that are not behind the wheel legally. A man&nbsp;was left seriously <a title=\"injured\" href=\"http:\/\/www.lvtbd.com\/Other-Practice-Areas\/Catastrophic-Injuries\/\" target=\"_blank\">injured<\/a> after he and another pedestrian were struck by a vehicle that was operated by an intoxicated driver.<\/p>\n<p>The pair was crossing King Avenue in Columbus&nbsp;at about 10 p.m., when the accident occurred. They were hit by a 49-year-old male driver who, instead of stopping after striking them, fled the scene. Columbus police later found the driver and learned the man had previously been convicted of drunk driving, but unfortunately this time his reckless behavior resulted in serious harm to the pedestrians involved. He was charged with drunk driving and other charges are pending investigation.<\/p>\n<p>The man who was struck by the vehicle suffered serious injuries and was taken to the Ohio State Medical Center, where he remains in critical condition. Reportedly, the victim sustained spleen damage, a punctured lung and extensive head trauma and facial wounds. The man&#8217;s companion was also injured and underwent treatment at the scene.<\/p>\n<p>Thousands of people are injured and many others killed by drunk drivers annually, according to statistics, and often the accident victims are pedestrians. The man involved in this case is lucky to be alive, but he may never fully recover from his serious injuries. It is likely that the driver will face jail time if convicted, but even in the absence of a conviction, he could be held liable for the damages he caused the pedestrians. People injured in DWI accidents have the right to pursue reparation and may benefit from legal advice as they explore their options and possibly make a compensatory claim.<\/p>\n<p><strong>Source:<\/strong> 10TV, &#8220;Man Charged In Hit-Skip Crash That Hurt 2 Pedestrians,&#8221; Aug. 10, 2011<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the past five years more than 1,800 people have died in drunk driving-related accidents in Ohio, according to the Mothers Against Drunk Driving Web site. Often these accidents are caused by drivers that are not behind the wheel legally. A man&nbsp;was left seriously injured after he and another pedestrian were struck by a vehicle that was operated by an&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/48038"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=48038"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/48038\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=48038"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=48038"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=48038"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}