{"id":48044,"date":"2011-08-05T00:00:00","date_gmt":"2011-08-05T05:00:00","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/blog\/2011\/08\/woman-killed-in-fatal-car-wreck-in-franklin\/"},"modified":"2019-10-03T22:05:36","modified_gmt":"2019-10-04T03:05:36","slug":"woman-killed-in-fatal-car-wreck-in-franklin","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2011\/08\/woman-killed-in-fatal-car-wreck-in-franklin\/","title":{"rendered":"Woman killed in fatal car wreck in Franklin"},"content":{"rendered":"<p>No matter what the weather is like outside or what time of day it is, people are involved in car crashes. Often, a car accident can cause permanent physical damage, from which the <a title=\"victims\" href=\"\/catastrophic-injuries-fatalities\/wrongful-death\/\" target=\"_blank\">victims<\/a> do not recover, and other times the accident ends a life. A woman was killed in Franklin recently, after a head on collision with another car.<\/p>\n<p>The 33-year-old woman was heading west, not far from Reifs Mills and Hempton Lake roads, when the accident occurred. Her vehicle was struck head-on by a Jeep, and she sustained multiple blunt force injuries. According to the coroner, she died at the scene of the crash.<\/p>\n<p>An 8-year-old boy was also in the car with her. He was taken by helicopter to a hospital in Green Bay for treatment of unspecified injuries.<\/p>\n<p>Fire crews and first responders from all over the Franklin area came to assist the victims of the crash. The driver of the Jeep was a 17-year-old male, thought to have been traveling west on the same road as the woman. He was also injured, and had to be freed from his vehicle using the Jaws of Life. An ongoing investigation has been launched by the Manitowoc County Sheriff&#8217;s Department.<\/p>\n<p>When someone is involved in a car accident that results in wrongful death or serious injury, it can have heartbreaking consequences for their loved ones. It can be difficult for them to make sense of their loss after an accident of this nature, and families may struggle to adapt, both emotionally and financially. The loss of a parent is always difficult, and those who have suffered this hardship may be entitled to claim compensation.<\/p>\n<p>After an accident, people have things running through their heads and they are in pain. They can&#8217;t think clearly. Having someone who understands and who will do their best to get the money because of injuries or wrongful death will help a great deal.<\/p>\n<p><strong>Source:<\/strong> HTR News, &#8220;Victims in head-on accident in town of Franklin identified,&#8221; July 8, 2011<\/p>\n","protected":false},"excerpt":{"rendered":"<p>No matter what the weather is like outside or what time of day it is, people are involved in car crashes. Often, a car accident can cause permanent physical damage, from which the victims do not recover, and other times the accident ends a life. A woman was killed in Franklin recently, after a head on collision with another car.&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[2],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/48044"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=48044"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/48044\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=48044"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=48044"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=48044"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}