{"id":49051,"date":"2020-02-10T13:12:40","date_gmt":"2020-02-10T19:12:40","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/?p=49051"},"modified":"2020-11-18T10:10:46","modified_gmt":"2020-11-18T16:10:46","slug":"manufacturer-of-child-booster-seats-ignored-internal-safety-recommendations-report-says","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2020\/02\/manufacturer-of-child-booster-seats-ignored-internal-safety-recommendations-report-says\/","title":{"rendered":"Manufacturer of child booster seats ignored internal safety recommendations, report says"},"content":{"rendered":"<p>A leading manufacturer of child booster seats prioritized sales over safety, according to a report published in ProPublica.<\/p>\n<p>In 2012, a safety engineer at Evenflo recommended the company stop making booster seats for children under 40 pounds, according to ProPublica, which is a nonprofit investigative journalism organization. The engineer’s advice was based on government research. The engineer&#8217;s recommendation would have aligned the company with Canadian regulations and recommendations from the American Academy of Pediatrics.<\/p>\n<p>An Evenflo executive rejected the recommendation, according to the ProPublica report. Later that year, the executive again rejected the advice to stop making the Big Kid model booster seat.<\/p>\n<p>ProPublica’s report was based on: Evenflo’s internal side-impact test videos; thousands of pages of sworn depositions and company marketing materials. The information previously had been protected by secrecy orders in lawsuits around the country.<\/p>\n<p>In response to the ProPublica report, Evenflo’s corporate attorney said it produces “safe, effective, affordable products, including the Big Kid” booster seat.<\/p>\n<p><strong>Flunked side-impact tests<\/strong><\/p>\n<p>Perhaps even more brazen than keeping the booster seats on the market, Evenflo said in its marketing that Big Kid boosters were “Side Impact Tested.” The company did not reveal in its marketing that the booster seat flunked the company’s side-impact tests, the ProPublica report said.<\/p>\n<p>Side-impact collisions are considered more dangerous than head-on collisions. With a side-on collision, the only thing protecting the occupant is a door.<\/p>\n<p><strong>NHTSA did not fulfill its obligations<\/strong><\/p>\n<p>The National Highway Traffic Safety Administration also failed to protect children from side-impact crashes. Congress, nearly 20 years ago, passed a law that directed the NHTSA to write rules to improve the safety of car seats and booster seats. NHTSA never wrote standards for side-impact tests.<\/p>\n<p>Families of children injured or killed in accidents have filed lawsuits against Evenflo and its main competitors – Graco and Dorel. When ProPublica asked Dorel and Graco to provide side-impact test results, the companies refused. Dorel told ProPublica it stopped selling boosters for children under 40 pounds in 2016.<\/p>\n<p><strong>Do you have questions?<\/strong><\/p>\n<p>If you or a loved one has been injured in a motor vehicle accident, contact an experienced attorney.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A leading manufacturer of child booster seats prioritized sales over safety, according to a report published in ProPublica. In 2012, a safety engineer at Evenflo recommended the company stop making booster seats for children under 40 pounds, according to ProPublica, which is a nonprofit investigative journalism organization. The engineer’s advice was based on government research. The engineer&#8217;s recommendation would have&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/49051"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=49051"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/49051\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=49051"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=49051"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=49051"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}