{"id":49094,"date":"2020-09-16T08:00:15","date_gmt":"2020-09-16T13:00:15","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/?p=49094"},"modified":"2020-11-18T10:29:07","modified_gmt":"2020-11-18T16:29:07","slug":"how-much-car-insurance-should-i-have","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2020\/09\/how-much-car-insurance-should-i-have\/","title":{"rendered":"How much car insurance should I have?"},"content":{"rendered":"<p>The question of how much car insurance to purchase can be a tricky one. You hope that it&#8217;s something you will never need. It can be tempting to play the odds, get the bare minimum, and hope you never cause an accident or are never hurt in an accident due to someone else’s fault. Buying insurance online often results in a search for the lowest premium, which usually results in inadequate insurance limits.<\/p>\n<p>However, motor vehicle accidents are more common than you think. After an accident, the last thing you want is to find yourself underinsured.<\/p>\n<h2>Required minimum insurance<\/h2>\n<p>Ohio law requires all drivers to carry liability insurance. This insurance is designed to help cover injuries and property damage that you cause to someone else. The minimum amount of coverage you must carry is:<\/p>\n<ul>\n<li>$25,000 for bodily injury to one person<\/li>\n<li>$50,000 for injuries to multiple people<\/li>\n<li>$25,000 for property damage<\/li>\n<\/ul>\n<p>Dollar for dollar, the minimum amount of coverage is the most expensive automobile insurance you can buy. This is because the value of most car accidents falls within the $25,000 range. Paying for higher policy limits up to $250,000 is less expensive, dollar for dollar, than the bare minimum. If you can afford policy limits higher than the state minimums, you should buy higher limits.<\/p>\n<h2>Why you need uninsured and underinsured motorist coverage<\/h2>\n<p>If an accident is the other driver’s fault and he or she has no or low liability policy limits, you will likely be undercompensated.<\/p>\n<p>In this scenario, it is good to have additional <strong>uninsured\/underinsured motorist coverage<\/strong> on your auto policy. It will help cover your expenses if the other driver has no or too little insurance. Such coverage will also cover your pain and suffering and injuries. <strong>In many states, including Ohio, you must specifically request uninsured and underinsured motorist coverage.<\/strong> You should request as high a limit as possible for such coverage, consistent with what you can afford.<\/p>\n<p>Even if you or the other driver has adequate insurance coverage, you still must prove the value of  your case. A skilled legal professional can help negotiate the settlement you deserve or help explore additional avenues of compensation when necessary.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The question of how much car insurance to purchase can be a tricky one. You hope that it&#8217;s something you will never need. It can be tempting to play the odds, get the bare minimum, and hope you never cause an accident or are never hurt in an accident due to someone else’s fault. Buying insurance online often results in&hellip;<\/p>\n","protected":false},"author":2047,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[19,26],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/49094"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2047"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=49094"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/49094\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=49094"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=49094"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=49094"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}