{"id":49751,"date":"2021-01-04T16:20:35","date_gmt":"2021-01-04T22:20:35","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/?p=49751"},"modified":"2021-01-23T16:20:49","modified_gmt":"2021-01-23T22:20:49","slug":"how-do-truck-accidents-happen","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2021\/01\/how-do-truck-accidents-happen\/","title":{"rendered":"How do truck accidents happen?"},"content":{"rendered":"<p>Colliding with any fellow motorist on the road can turn a peaceful drive into a nightmare. Getting in a crash with a semi-truck can be especially brutal due to the large size of the vehicle. But if trucks are so big that it’s hard to miss them when they pass by and if the people behind the steering wheel of commercial vehicles are professionals, then how do truck accidents happen?<\/p>\n<p>Just like any accident, one party or <a href=\"https:\/\/www.findlaw.com\/injury\/car-accidents\/common-causes-of-commercial-truck-accidents.html\" target=\"_blank\" rel=\"noopener noreferrer\">both parties involved may be responsible<\/a> for the collision.<\/p>\n<h2>Keeping distance<\/h2>\n<p>If the driver of a passenger vehicle contributed to the accident, distractions or driving too close to the truck could be the cause of the crash. Not being aware of one’s surroundings and multitasking behind the wheel can create a terrible outcome. It only <a href=\"https:\/\/www.enddd.org\/the-facts-about-distracted-driving\/\" target=\"_blank\" rel=\"noopener noreferrer\">takes five seconds to cover<\/a> the entire length of a football field while driving 55 mph. This means an inattentive drive could pass a handful of trucks and not even realize it and make themselves more prone to crashing with any vehicle they blindly pass.<\/p>\n<p>It’s also worth noting that due to a truck’s large nature, a truck driver’s blind spots are much larger than a passenger vehicle driver. This makes driving side-by-side or directly in front of or behind a truck extremely dangerous. Consequently, switching lanes or merging around or in between trucks can also be a recipe for disaster.<\/p>\n<h2>Truck driver mistakes<\/h2>\n<p>On the other hand, if a truck driver is at fault, then improper training or fatigue could be contributing factors in an accident. Truck drivers shouldn’t behave like race car drivers and pass and weave around cars as they please. Instead, their training should include lessons on defensive driving tactics that they should apply while on shift. Defensive driving involves perceiving risks and preventing accidents before they happen. This can include only going the speed limit and both slowing down at intersections and when surrounding drivers hit the brakes.<\/p>\n<p>Truck drivers may feel the need to speed if their employer pressures them to make it to their destinations in a specific duration of time. In turn, when speed becomes a priority, safety can fall to the wayside. And another way an employer can set up their truck drivers for failure is by not following federal regulations when it comes to legal shift lengths and breaks. Overworking can cause drowsiness and fatigue and falling asleep at the wheel is a sure way to cause a crash.<\/p>\n<p>Since a truck accident can happen through missteps that truck drivers and passenger vehicle drivers take, it’s important for all motorists to do their part to make Ohio’s roadways safer.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Colliding with any fellow motorist on the road can turn a peaceful drive into a nightmare. Getting in a crash with a semi-truck can be especially brutal due to the large size of the vehicle. But if trucks are so big that it’s hard to miss them when they pass by and if the people behind the steering wheel of&hellip;<\/p>\n","protected":false},"author":2016,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[25],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/49751"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2016"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=49751"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/49751\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=49751"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=49751"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=49751"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}