{"id":50354,"date":"2021-03-30T12:00:13","date_gmt":"2021-03-30T17:00:13","guid":{"rendered":"https:\/\/www.injurymedmal.com\/?p=49787"},"modified":"2021-05-24T09:21:56","modified_gmt":"2021-05-24T13:21:56","slug":"when-can-patients-sue-ohio-hospitals-for-malpractice","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2021\/03\/when-can-patients-sue-ohio-hospitals-for-malpractice\/","title":{"rendered":"When can patients sue Ohio hospitals for malpractice?"},"content":{"rendered":"<p>When you need hospital care or a surgery at a hospital, you likely are most concerned about when your health may improve. You may worry about experiencing complications from surgery or if your treatment will be successful. However, you may not think about a more serious problem: if you experience medical malpractice under hospital care.<\/p>\n<p>Yet, healthcare providers make mistakes. A nurse could miscount the number of sponges a doctor inserted in you during surgery. Then, you discover after surgery, you still have a surgical sponge in your body. Or a doctor fails to give you a CT scan, even after you sought ER care because of a car accident and you later discover you are bleeding internally. Or the hospital pharmacy doesn’t give you the correct medication. If any such error seriously impacts your health or causes you additional harm, you could have a medical malpractice claim.<\/p>\n<h2>Medical malpractice: Holding hospitals accountable<\/h2>\n<p>In Ohio, victims of <a href=\"https:\/\/codes.ohio.gov\/orc\/2305.113\" target=\"_blank\" rel=\"noopener noreferrer\">medical malpractice<\/a> can sue hospitals for negligent care from hospital employees, including:<\/p>\n<ul>\n<li>Doctors<\/li>\n<li>Surgeons<\/li>\n<li>Nurses<\/li>\n<li>Residents<\/li>\n<li>Pharmacists<\/li>\n<li>Hospital administrators<\/li>\n<\/ul>\n<p>Providing negligent care goes beyond making surgical or diagnostic mistakes or not providing a patient proper treatment. Patients also can receive negligent care if a care provider:<\/p>\n<ul>\n<li>Doesn’t supervise a patient properly<\/li>\n<li>Doesn’t respond to a patient’s serious complaint<\/li>\n<li>Doesn’t inform a doctor of a patient’s signs of injury or distress<\/li>\n<li>Doesn’t supervise a resident in training properly<\/li>\n<li>Doesn’t practice standard disinfecting or cleaning procedures<\/li>\n<\/ul>\n<p>Patients can sue hospital administrators if they were negligent in their staff hiring, staff training, staff supervision or failing to fire a care provider who committed malpractice in the past.<\/p>\n<h2>When you receive negligent care<\/h2>\n<p>If you feel you <a href=\"https:\/\/www.injurymedmal.com\/medical-malpractice\/\" target=\"_blank\" rel=\"noopener noreferrer\">received negligent care during a recent hospital stay<\/a>, you should consult a medical malpractice attorney. You may receive damages for any serious injuries or long-term complications you experienced because of medical malpractice. You also need to keep all your medical records, record if you need to take time off work or incur other expenses because of the negligent care you received. This documentation will help establish what level of damages you may receive.<\/p>\n<p>Sometimes, you have to hold hospitals accountable, especially if negligent care impacted your long-term health. You deserve to get compensation for any costs you incurred because of your negligent care and you can help ensure that a hospital takes steps to improve their patient care.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you need hospital care or a surgery at a hospital, you likely are most concerned about when your health may improve. You may worry about experiencing complications from surgery or if your treatment will be successful. However, you may not think about a more serious problem: if you experience medical malpractice under hospital care. Yet, healthcare providers make mistakes.&hellip;<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50354"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=50354"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50354\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=50354"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=50354"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=50354"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}