{"id":50512,"date":"2021-06-04T04:41:01","date_gmt":"2021-06-04T08:41:01","guid":{"rendered":"https:\/\/www.injurymedmal.com\/?p=50512"},"modified":"2021-06-01T04:42:37","modified_gmt":"2021-06-01T08:42:37","slug":"how-doctor-burnout-occurs-leaving-patients-in-the-crosshairs","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2021\/06\/how-doctor-burnout-occurs-leaving-patients-in-the-crosshairs\/","title":{"rendered":"How doctor burnout occurs, leaving patients in the crosshairs"},"content":{"rendered":"<p>Doctors and nurses are highly educated and trained professionals. It takes years, sometimes even decades, for them to become established in their field. This leads some people to believe that these medical professionals are so skilled that they rarely make mistakes. If you’re reading this blog, though, then you probably know all too well that the truth is far different.<\/p>\n<p>Doctors and nurses are human, which means that they’re accident prone and susceptible to burnout. The tragic reality is that these characteristics can have tremendous ramifications for unsuspecting patients, oftentimes leaving them seriously inured or, in the worst cases, deceased. This is troublesome, to say the least, especially given that some studies say as many as 50% of <a href=\"https:\/\/www.ahrq.gov\/prevention\/clinician\/ahrq-works\/burnout\/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">physicians and surgeons experience burnout<\/a>.<\/p>\n<h2>How burnout happens in the medical field<\/h2>\n<p>Doctors and nurses face many of the same stressors that the rest of us face in our professions. Here are some of the biggest contributors:<\/p>\n<ul>\n<li><strong>Time constraints: <\/strong>Medical professionals often have packed schedules. This means that any delays can throw their schedules out of line and force them to work long days. Sadly, this means that these medical professionals often end up devoting less time to patients than they would like, which can lead to rushed care and missed opportunities for diagnosis and treatment. In fact, one study found that one-third of physicians reported needing 50% more time to be able to conduct appropriately thorough physical examinations. Half of physicians surveyed in that study indicated feeling time pressures when conducting these examinations.<\/li>\n<li><strong>Chaotic environment:<\/strong> The medical field is fast paced, for sure, but it isn’t always well organized, either. Unexpected issues can arise during surgery and distractions can easily draw a tired doctor or nurse’s attention away from a patient when it is desperately needed. This can lead to serious and harmful errors being made.<\/li>\n<li><strong>Electronic medical records:<\/strong> With HIPPA came the use of electronic medical records. A lot of doctors think that these records are time-consuming and interfere with face-to-face contact with patients. Many of these doctors feel that the bureaucracy involved in dealing with electronic medical records makes them like a cog in the wheel rather than the frontline healthcare provider they hoped to be. The use of these records draws time away from patients, which can lead to medical mistakes.<\/li>\n<li><strong>Personal responsibilities:<\/strong> Being a medical professional can be stressful. But these individuals don’t just have to deal with the stress of managing others’ healthcare; they also have to cope with the pressures placed upon them in their personal lives. This could involve childcare, marital problems, and even issues pertaining to substance abuse. This pressure can compound with work-related stress to drive burnout and lead to poor outcomes for patients.<\/li>\n<\/ul>\n<h2>What can be done to prevent burnout?<\/h2>\n<p>No one wants to have a burned out doctor treat him or her. That’s why some in the medical field are calling for change. They seek to provide medical professionals with more flexible schedules and assistance in electronic medical record entries so that they can spend more time with patients. They also hope to give doctors a better work-life balance so that they can stay fresh and energized while on the job. That being said, the current state of affairs falls far short of the ideal.<\/p>\n<h2>Hold errant medical professionals accountable<\/h2>\n<p>We understand that burnout is real in every profession. Yet, not every profession has individuals’ health, wellbeing, and their very lives at stake. That’s why burnout is no excuse for medical mistakes that leave innocent patients harmed. If you or a loved one has been harmed by what you suspect to be <a href=\"https:\/\/www.injurymedmal.com\/medical-malpractice\/\" target=\"_blank\" rel=\"noopener noreferrer\">medical malpractice<\/a>, then now may be the time to reach out to a legal team that knows how to hold negligent medical professionals and their employers accountable.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Doctors and nurses are highly educated and trained professionals. It takes years, sometimes even decades, for them to become established in their field. This leads some people to believe that these medical professionals are so skilled that they rarely make mistakes. If you’re reading this blog, though, then you probably know all too well that the truth is far different.&hellip;<\/p>\n","protected":false},"author":176,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50512"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/176"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=50512"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50512\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=50512"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=50512"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=50512"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}