{"id":50516,"date":"2021-06-01T17:17:01","date_gmt":"2021-06-01T21:17:01","guid":{"rendered":"https:\/\/www.injurymedmal.com\/?p=50516"},"modified":"2021-06-04T08:29:37","modified_gmt":"2021-06-04T12:29:37","slug":"when-care-goes-wrong-in-an-emergency-room","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2021\/06\/when-care-goes-wrong-in-an-emergency-room\/","title":{"rendered":"When care goes wrong in an emergency room"},"content":{"rendered":"<p>You may like to watch hospital dramas on television. You enjoy watching simulations of doctors assessing a patient’s symptoms and responding to emergency room situations. However, most likely you don’t like the idea of ending up in an emergency room yourself. You know that if you need emergency room medical care something could be seriously wrong and even endanger your life.<\/p>\n<p>What you may not realize is that medical care can go wrong in an emergency room too. Sometimes, patients don’t receive adequate care or doctors discharge them before they discover a correct medical diagnosis. In a 2019 survey, <a href=\"https:\/\/www.medscape.com\/slideshow\/2019-malpractice-report-6012303#4\" target=\"_blank\" rel=\"noopener noreferrer\">76% of emergency room physicians surveyed<\/a> reported they had been sued by a patient for medical malpractice. Also, about half of medical malpractice injuries occur because of errors in the emergency room.<\/p>\n<h2>Medical malpractice in the emergency room<\/h2>\n<p>Some of the errors that can lead to medical malpractice in the emergency room include a healthcare provider:<\/p>\n<ul>\n<li>Failing to take an accurate medical history of a patient<\/li>\n<li>Failing to give a patient a thorough examination<\/li>\n<li>Failing to run the proper tests or x-rays to provide proper care for a patient<\/li>\n<li>Failing to rule out possible life-threatening conditions<\/li>\n<li>Failing to properly monitor a patient<\/li>\n<li>Discharging a patient without fully treating their illness<\/li>\n<li>Making surgical errors<\/li>\n<\/ul>\n<p>Some illnesses that often are misdiagnosed in an emergency room can lead to lifelong harm for a patient or even premature death. For example, if an ER doctor doesn’t correctly diagnose a stroke in a patient, that patient may end up partially paralyzed or face a long, difficult recovery because they didn’t receive the right medication quickly.<\/p>\n<p>In order for a patient to prove a successful medical malpractice claim, they must show that:<\/p>\n<ul>\n<li>There was a doctor-patient relationship.<\/li>\n<li>The emergency room physician provided negligent care.<\/li>\n<li>The patient was harmed because of that negligent care.<\/li>\n<\/ul>\n<h2>Medical malpractice compensation<\/h2>\n<p>Patients who receive a medical malpractice settlement or win a <a href=\"https:\/\/www.injurymedmal.com\/medical-malpractice\/\" target=\"_blank\" rel=\"noopener noreferrer\">medical malpractice lawsuit<\/a> can receive compensation for:<\/p>\n<ul>\n<li>Past and future medical bills<\/li>\n<li>Pain and suffering and reduction in quality of life<\/li>\n<li>Lost wages or reduced wages because of their suffering or a lifelong disability because of medical malpractice<\/li>\n<li>Punitive damages (to punish a physician for providing negligent care)<\/li>\n<\/ul>\n<p>If you believe you or a loved one suffered because of negligent care during an emergency room visit, you should consult an experienced attorney. An attorney can mount evidence for your medical malpractice claim and help hold a care provider accountable for the mistakes that impacted your health.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You may like to watch hospital dramas on television. You enjoy watching simulations of doctors assessing a patient’s symptoms and responding to emergency room situations. However, most likely you don’t like the idea of ending up in an emergency room yourself. You know that if you need emergency room medical care something could be seriously wrong and even endanger your&hellip;<\/p>\n","protected":false},"author":696,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50516"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/696"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=50516"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50516\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=50516"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=50516"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=50516"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}