{"id":50589,"date":"2021-09-13T11:54:01","date_gmt":"2021-09-13T15:54:01","guid":{"rendered":"https:\/\/www.injurymedmal.com\/?p=50589"},"modified":"2021-10-06T13:00:13","modified_gmt":"2021-10-06T17:00:13","slug":"second-chances-undermining-medical-services","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2021\/09\/second-chances-undermining-medical-services\/","title":{"rendered":"Second Chances Undermining Medical Services"},"content":{"rendered":"<p>Few bonds of trust are stronger than what patients have with their doctors. Suffering illness or injury creates uncertainty and stress during perilous times. Going to a medical professional should represent the first step in clarifying specific problems, if not recovery.<\/p>\n<p>The Indian Health Service (IHS) is an agency serving as the primary federal health care provider and advocate for American Indians and Alaska natives. The group’s mission is to provide medical services to all 2.6 million members of 563 federal recognized tribes throughout 36 states, including Ohio. Their mission is simple: to offer the best care possible.<\/p>\n<h2>The Growing Problem of Substandard Native American Health Care<\/h2>\n<p>Recent news seems to undermine that mission. According to a <a href=\"https:\/\/www.wsj.com\/articles\/the-u-s-gave-troubled-doctors-a-second-chance-patients-paid-the-price-11574439222?mod=hp_lead_pos5\">Wall Street Journal investigation<\/a>, IHS has become well known for giving “second chances” to doctors with troubling histories of malpractice allegations that resulted in permanent suspensions and potentially career-ending regulatory sanctions.<\/p>\n<p>After five malpractice settlements, one doctor hired by IHS had previously received a permanent suspension from the facility where he practiced most of his career. The ban was based on findings of “multiple serious deficits in judgment.”<\/p>\n<p>By turning to the IHS, he was able to resume his career. Following five additional malpractice settlements totaling $1.8 million, including two fatalities, the doctor retired.<\/p>\n<p>That quintet of complaints only scratches the surface of the 163 malpractice claims examined, with 40 percent resulting in death. Of the doctors hired by IHS, 25 percent of those recruited should have sounded some type of alert after reviewing their respective applications.<\/p>\n<p>To put this calamity into perspective, insurance actuaries determined that doctors in the United States will have one malpractice claim every 20 years. Surgeons would likely have two during the same period.<\/p>\n<p>IHS saw merit in some physicians who had 10 in the last decade.<\/p>\n<p>Admittedly, recruitment is a challenge for any medical facility. In May of last year, the IHS had a vacancy rate of just under 30 percent. Remote locations and lower pay present hiring. However, lowering standards and failing to secure all information in background checks have a more cataclysmic effect on the health of Native American communities throughout the country.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Few bonds of trust are stronger than what patients have with their doctors. Suffering illness or injury creates uncertainty and stress during perilous times. Going to a medical professional should represent the first step in clarifying specific problems, if not recovery. The Indian Health Service (IHS) is an agency serving as the primary federal health care provider and advocate for&hellip;<\/p>\n","protected":false},"author":696,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50589"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/696"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=50589"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50589\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=50589"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=50589"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=50589"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}