{"id":50599,"date":"2021-09-30T07:21:17","date_gmt":"2021-09-30T11:21:17","guid":{"rendered":"https:\/\/www.injurymedmal.com\/?p=50599"},"modified":"2021-10-29T12:43:02","modified_gmt":"2021-10-29T16:43:02","slug":"how-to-share-the-road-safely-with-bicyclists","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2021\/09\/how-to-share-the-road-safely-with-bicyclists\/","title":{"rendered":"How to share the road safely with bicyclists"},"content":{"rendered":"<p>Whether you ride to work, for fun, to reduce your carbon footprint or for exercise, bicycling can be a great alternative to driving in Columbus. Despite its health and environmental benefits, bicycling presents dangers especially when bikers and motorists have to share the road together. What <a href=\"https:\/\/www.nhtsa.gov\/road-safety\/bicycle-safety\">rules<\/a> should bicyclists and motorists follow so that everyone can reach their destination safely?<\/p>\n<h2>Rules for bicyclists on the road<\/h2>\n<p>One big rule for bicyclists is to be predictable. This means traveling in the same direction as traffic and riding in bike lanes if there are bike lanes present. Biking on the sidewalk can make it harder for motorists to see you, and sometimes sidewalks end abruptly forcing the bicyclist to ride into traffic. Bicyclists should also signal before turning, and they should look behind them briefly before changing lanes or executing a turn. Bicyclists may want to consider taking a safe riding class. And bicyclists should always make sure to wear a helmet when riding.<\/p>\n<h2>Rules for motorists sharing the road with bicyclists<\/h2>\n<p>Motorists also have rules to follow when sharing the road with bicyclists. Motorists must yield to a bicyclist’s right of way when necessary to avoid turning in front of the bicyclist and causing an accident. Motorists should make sure they pay attention when reversing, especially in parking lots as there may be bicyclists behind them. At intersections motorists should come to a complete stop and look both ways for any bicyclists approaching them. Motorists should avoid speeding and drive defensively.<\/p>\n<h2>Take action if you are involved in a bicycle accident<\/h2>\n<p>If you are <a href=\"https:\/\/www.injurymedmal.com\/auto-accident-injuries\/car-accidents\/bicycle-accidents\/\">struck by a car<\/a> while riding your bicycle you could be seriously injured. When this happens, you may want to learn more about negligence lawsuits. Simply put, motorists have a duty to drive with due care. If they breach this duty by striking a bicyclist, causing injuries that would not have happened but for the crash, the injured bicyclist may be able to hold the negligent motorist accountable.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether you ride to work, for fun, to reduce your carbon footprint or for exercise, bicycling can be a great alternative to driving in Columbus. Despite its health and environmental benefits, bicycling presents dangers especially when bikers and motorists have to share the road together. What rules should bicyclists and motorists follow so that everyone can reach their destination safely?&hellip;<\/p>\n","protected":false},"author":696,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[36],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50599"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/696"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=50599"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50599\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=50599"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=50599"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=50599"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}