{"id":50607,"date":"2021-11-30T18:23:45","date_gmt":"2021-11-30T23:23:45","guid":{"rendered":"https:\/\/www.injurymedmal.com\/?p=50607"},"modified":"2021-11-30T18:23:45","modified_gmt":"2021-11-30T23:23:45","slug":"can-premature-discharge-from-an-emergency-room-be-medical-malpractice","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2021\/11\/can-premature-discharge-from-an-emergency-room-be-medical-malpractice\/","title":{"rendered":"Can premature discharge from an emergency room be medical malpractice?"},"content":{"rendered":"<p>When we have a medical emergency in our life, we trust in medical professionals to apply their experience, education and sound judgment towards helping us to overcome the adverse effects of our condition. This is especially true in the emergency room, where time is often of the essence for treating dangerous injuries.<\/p>\n<p>Sometimes, unfortunately, doctors and other emergency room personnel make mistakes that can have horrific consequences for the injured person – such as when they discharge someone too early without performing an adequate examination. When can a hospital or doctor be legally accountable for increased injuries that result from a premature emergency room discharge?<\/p>\n<h2>What constitutes medical malpractice?<\/h2>\n<p>Doctors and other medical professionals have a <a href=\"https:\/\/www.findlaw.com\/injury\/medical-malpractice\/medical-malpractice-faq.html\" target=\"_blank\" rel=\"noopener\">minimum standard of care<\/a> that they must always comply with when assisting patients. Medical malpractice is when a doctor negligently deviates from this standard of care, resulting in harm to a patient that could have been avoided if the doctor had behaved as they should have.<\/p>\n<p>When courts must decide whether a particular doctor’s conduct constitutes malpractice, they compare that doctor’s actions with the actions of a hypothetical average and reasonable doctor in their field. If the average doctor would have done something (or refrained from doing something) in a particular situation, then it could be malpractice to deviate from that course of action, especially if doing so harms the patient.<\/p>\n<h2>When is premature emergency room discharge malpractice?<\/h2>\n<p>Applying this standard to the context of emergency room visits, it could be malpractice for an E.R. doctor to discharge someone before the average doctor would agree that it is safe to do so.<\/p>\n<p>For example, you might be showing signs of a severe bacterial infection, internal bleeding or some other problem that practically any other doctor would recognize, but your E.R. staff failed to catch it and sent you home prematurely, which caused your condition to become much worse.<\/p>\n<p>It’s important to note, however, that just because you suffer from an adverse effect from premature discharge from the E.R. does not necessarily mean that there was medical malpractice involved. The doctor’s decision to discharge you must have been the actual <a href=\"https:\/\/casetext.com\/case\/mcneilan-v-the-ohio-state-univ-med-ctr\" target=\"_blank\" rel=\"noopener\">cause of your injury getting worse<\/a>.<\/p>\n<p>Medical malpractice comes in many forms, and it can cause a great deal of unnecessary suffering. Fortunately, our justice system offers recourses to victims of the negligence of medical personnel.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When we have a medical emergency in our life, we trust in medical professionals to apply their experience, education and sound judgment towards helping us to overcome the adverse effects of our condition. This is especially true in the emergency room, where time is often of the essence for treating dangerous injuries. Sometimes, unfortunately, doctors and other emergency room personnel&hellip;<\/p>\n","protected":false},"author":3576,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50607"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/3576"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=50607"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50607\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=50607"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=50607"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=50607"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}