{"id":50604,"date":"2021-12-01T06:26:58","date_gmt":"2021-12-01T11:26:58","guid":{"rendered":"https:\/\/www.injurymedmal.com\/?p=50604"},"modified":"2021-11-29T06:27:55","modified_gmt":"2021-11-29T11:27:55","slug":"wrongful-death-caused-by-drunk-driving-and-taking-legal-action","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2021\/12\/wrongful-death-caused-by-drunk-driving-and-taking-legal-action\/","title":{"rendered":"Wrongful death caused by drunk driving and taking legal action"},"content":{"rendered":"<p>Every year, more than 10,000 individuals are killed in drunk driving accidents. That equates to 28 drunk driving-related deaths every day, which is one death every 52 minutes. The most recent statistics that are available show that Ohio had more than 1,000 <a href=\"https:\/\/www.bankrate.com\/insurance\/car\/drunk-driving\/\">drunk driving deaths<\/a> in a calendar year, which means that there are thousands of families in our state each year who are heartbroken to hear that their loved one was taken from them too soon. Sadly, these numbers have remained relatively consistent over the years despite increased efforts by law enforcement and public awareness initiatives.<\/p>\n<p>While many of the individuals who are responsible for causing these deaths are held criminally liable for their actions, the truth of the matter is that a criminal prosecution does nothing to help families coping with the financial realities that their loss has caused. For these families, merely getting by on a day-to-day basis can be difficult, especially if their loved one was the primary wage earner in the family. While these lost wages can certainly take a toll, so, too, can medical and funeral expenses, not to mention the emotional pain and suffering that befalls these families.<\/p>\n<p>So, what can these families do to find their own sense of accountability and recover the compensation that they’re owed? One option is to pursue a <a href=\"https:\/\/www.injurymedmal.com\/catastrophic-injuries-fatalities\/\">wrongful death<\/a> lawsuit. Although it might seem easy to pursue one of these cases in the aftermath of a drunk driving accident, they can actually be rather complicated. That’s why if you’ve lost a loved one to one of these tragic wrecks, then you may want to consider taking the following steps to help build your case.<\/p>\n<ol>\n<li><strong>Gather law enforcement observations: <\/strong>In a lot of drunk driving cases, you can turn to law enforcement to help you prove that the other driver was intoxicated at the time of the accident. This is because police officers may have observations, such as smelling alcohol on the driver’s breath shortly after the accident or seeing the driver throw alcohol containers out of the window prior to the accident. Law enforcement may even have seen the drunk driver try to switch seats with a passenger following an accident. As you’re gathering these observations, be sure to obtain any photographs that law enforcement took during the course of their investigation.<\/li>\n<li><strong>Listen to emergency phone call records:<\/strong> A 9-1-1 call may help establish how the driver was operating his or her vehicle at the time of the accident, as well as help you identify witnesses who were concerned about the driver’s actions both before and after the accident.<\/li>\n<li><strong>Collect criminal records:<\/strong> By digging into a driver’s criminal history, you may find a history of drunk driving that helps support your claim. If that driver does have a history of drunk driving, then there’s a decent chance that he or she was driving on a suspended or revoked license, which makes it even easier to show that he or she was driving negligently.<\/li>\n<li><strong>Gather evidence of damages suffered: <\/strong>This might sound simple enough considering that you can just submit any bills you received from your loved one’s medical providers and the funeral services provider, but there’s a lot more to your wrongful death claim than that. You’ll also want to think about how to portray the ways in which your lost loved one supported your family, including nurturing and guiding his or her children. You can also consider how to illustrate the pain and suffering that your loved one must have been subjected to prior to passing away.<\/li>\n<\/ol>\n<h2>Be diligent to build the strong wrongful death claim that you need<\/h2>\n<p>If you’ve lost a loved one to a drunk driving accident, then you’re going through what could be the toughest part of your life. Your emotional pain and suffering can be exacerbated by the financial turmoil that has been thrust upon you, which can leave you stressed about your uncertain future. But you shouldn’t despair. Instead, you should seek out the guidance and support that you need to build a thorough and compelling wrongful death claim. Only then can you rest assured that you’ve positioned yourself as best as possible for success and closing this painful chapter of your life.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every year, more than 10,000 individuals are killed in drunk driving accidents. That equates to 28 drunk driving-related deaths every day, which is one death every 52 minutes. The most recent statistics that are available show that Ohio had more than 1,000 drunk driving deaths in a calendar year, which means that there are thousands of families in our state&hellip;<\/p>\n","protected":false},"author":2140,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[38],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50604"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2140"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=50604"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50604\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=50604"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=50604"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=50604"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}