{"id":50627,"date":"2022-02-02T11:38:32","date_gmt":"2022-02-02T16:38:32","guid":{"rendered":"https:\/\/www.injurymedmal.com\/?p=50627"},"modified":"2022-02-02T11:38:32","modified_gmt":"2022-02-02T16:38:32","slug":"can-you-develop-bed-sores-during-a-hospital-stay","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2022\/02\/can-you-develop-bed-sores-during-a-hospital-stay\/","title":{"rendered":"Can you develop bed sores during a hospital stay?"},"content":{"rendered":"<p>Medical facilities and health care professionals pride themselves on diagnosing conditions and treating injuries. Unfortunately, it is not uncommon for doctors and nurses to adopt a singular focus in terms of an illness and miss the onset of dangerous conditions. This level of negligence or inattention can lead to serious health complications.<\/p>\n<p>A patient who remains in the same position for extended periods of time can develop the progressive skin condition known as bed sores. While many people equate the onset of bedsores with nursing home residents who are confined to a wheelchair or bed, these pressure sores can develop on the skin under numerous conditions. A medical staff must ensure not only the proper hydration of patients but that they are continuously moved to reduce or eliminate the pressure on certain body parts.<\/p>\n<h2><strong>What are bed sores?<\/strong><\/h2>\n<p>Bed sores, also called decubitus ulcers, <a href=\"https:\/\/www.mayoclinic.org\/diseases-conditions\/bed-sores\/symptoms-causes\/syc-20355893\" target=\"_blank\" rel=\"noopener\">develop after prolonged periods of pressure against the skin<\/a>. These sores often affect areas of the body that have little muscle or tissue separating the skin from the bones such as the heels, hips, shoulder blades or tailbone. Without the proper care and attention, the condition can quickly progress through numerous stages of severity including skin damage, tenderness, cellulitis, bone infections and sepsis. An infection can quickly spread through the blood to numerous vital organs leading to severe complications.<\/p>\n<p>After a serious surgery or a medical condition that challenges mobility, a hospital patient faces the risk of developing bedsores. Even with doctors, nurses and techs coming in and out of the hospital room, patients must receive the proper care necessary to prevent this devastating condition.<\/p>\n<p>Far from an isolated complication,<a href=\"https:\/\/www.injurymedmal.com\/medical-malpractice\/nursing-home-abuse-negligence\/bedsores\/\"> bed sores can impact thousands of hospital patients each year<\/a>. What might seem at first like a minor skin condition can quickly progress to damage muscles and bones – often requiring amputation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Medical facilities and health care professionals pride themselves on diagnosing conditions and treating injuries. Unfortunately, it is not uncommon for doctors and nurses to adopt a singular focus in terms of an illness and miss the onset of dangerous conditions. This level of negligence or inattention can lead to serious health complications. A patient who remains in the same position&hellip;<\/p>\n","protected":false},"author":708,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[31],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50627"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/708"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=50627"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50627\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=50627"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=50627"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=50627"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}