{"id":50636,"date":"2022-03-29T15:49:28","date_gmt":"2022-03-29T19:49:28","guid":{"rendered":"https:\/\/www.injurymedmal.com\/?p=50636"},"modified":"2022-04-18T15:52:24","modified_gmt":"2022-04-18T19:52:24","slug":"exactly-what-is-traumatic-brain-injury-and-how-long-does-it-last","status":"publish","type":"post","link":"https:\/\/www.injurymedmal.com\/blog\/2022\/03\/exactly-what-is-traumatic-brain-injury-and-how-long-does-it-last\/","title":{"rendered":"Exactly what is traumatic brain injury and how long does it last?"},"content":{"rendered":"<p>Traumatic brain injury (TBI) is a serious injury that comes about if an unexpected physical shock does damage to the person’s brain. <a href=\"https:\/\/www.hopkinsmedicine.org\/health\/conditions-and-diseases\/traumatic-brain-injury\">A TBI can cause serious, long-lasting damage<\/a> to a person’s brain (which can result in disability) or it can cause death. TBI is an umbrella term and many other, more specific injuries fall under that category. Because the brain is such a complex organ, the destruction can be confined to one area of the brain or it can be more widespread. Also, the damage to the brain can be mild (a mild concussion) or it can result in severe injury, coma, or death.<\/p>\n<h2>Different kinds of TBIs<\/h2>\n<p>There are a few different types of brain injuries that are seen in individuals.<\/p>\n<ul>\n<li><strong>Penetrating brain injury: <\/strong>This is an injury in which the skull is open. This occurs if some sort of object has actually entered the skull and has created an opening.<\/li>\n<li><strong>Closed brain injury: <\/strong>This type of injury occurs when something hits the head but does not break the skull. It commonly occurs if the head has been jolted backward and forward and moves the brain and it then becomes bruised, potentially tears the brain tissue, and can disrupt the blood vessels in the brain. This type of brain injury is often caused by the person falling, a motor-vehicle accident, and from sports.<\/li>\n<li><strong>Primary and secondary brain injury:<\/strong> A primary injury is a serious injury to the brain that is a complete injury upon impact. A typical example of a primary brain injury is the result of a car accident, a fall, or a wound from a gunshot. A secondary brain injury is when the results of the injury develop over time and the worst outcome is not seen initially. With a secondary injury, the cells, chemistry, tissues, and or blood vessels are altered, which can lead to significant damage to the brain.<\/li>\n<li><strong>Diffuse axonal injury: <\/strong>This is a tearing of the brain’s nerve fibers, which can occur to the brain upon impact if the brain shifts and turns in the skull. This type of injury commonly causes a coma and injuries to various parts of the brain to occur. The developments that occur in the brain as a result of an accident are often too small to see with the naked eye and may possibly not be seen on a scan.<\/li>\n<\/ul>\n<h2>The causes of a head injury, bruising and brain damage<\/h2>\n<p>There are many different possible causes of a head injury in both adults and children. Motor vehicle accidents often cause head injuries. Head injuries may also occur when people fall or they are physically abused in any number of ways.<\/p>\n<p>If someone receives a direct hit to their head, the brain may be physically damaged. One possible bruise to the brain will appear directly where the impact occurred. The brain will move backward because of the impact of the hit and it will run into the skull. This can also cause the brain’s lining, blood vessels, and tissues to cause bruising, bleeding and swelling. If a person does have brain damage as a result of some impact, their symptoms may be mild or they may be more severe. There are some people who suffer permanent damage as the result of a severe injury, which will affect their life in different ways.<\/p>\n<h2>Valuable legal advice from a Columbus lawyer<\/h2>\n<p>If you have suffered a TBI as a result of another person’s negligence, you may wish to consult with a <a href=\"https:\/\/www.injurymedmal.com\/catastrophic-injuries-fatalities\/\">Columbus, Ohio, lawyer<\/a>, who can give you the benefit of their knowledge and expertise. The lawyer can ensure that your rights are protected and that you hopefully can receive the compensation that you need and to which you are entitled.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Traumatic brain injury (TBI) is a serious injury that comes about if an unexpected physical shock does damage to the person’s brain. A TBI can cause serious, long-lasting damage to a person’s brain (which can result in disability) or it can cause death. TBI is an umbrella term and many other, more specific injuries fall under that category. Because the&hellip;<\/p>\n","protected":false},"author":2141,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50636"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/2141"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=50636"}],"version-history":[{"count":1,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50636\/revisions"}],"predecessor-version":[{"id":50637,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/posts\/50636\/revisions\/50637"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=50636"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/categories?post=50636"},{"taxonomy":"posttag","embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/tags?post=50636"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}