{"id":45968,"date":"2019-10-02T23:09:30","date_gmt":"2019-10-03T04:09:30","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/medical-malpractice\/"},"modified":"2020-09-23T21:26:57","modified_gmt":"2020-09-24T02:26:57","slug":"medical-malpractice","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/medical-malpractice\/","title":{"rendered":"Medical Malpractice"},"content":{"rendered":"<h1>We Advocate For Victims Of Medical Malpractice<\/h1>\n<p>Doctors, nurses and other health care professionals have a duty to provide care that meets certain standards. When they fail to meet the applicable standards and a patient is injured, they have committed medical malpractice and they need to be held accountable for the lapse in care and its consequences.<\/p>\n<h2>Understanding When An Injury Was Caused By Malpractice<\/h2>\n<p>The existence of a physician-patient relationship places on the physician the duty to act as a physician of reasonable skill, care, and diligence under similar circumstances. This is known as the standard of care. The standard of care is to do those things that a reasonably careful physician would do and to refrain from doing those things that a reasonably careful physician would not do. The required standard of care is the same throughout the United States.<\/p>\n<p>A malpractice claim arises when a physician fails to meet the standard of care for his or her specialty and causes an injury or death. Proving a malpractice case is not simple. In fact, malpractice cases are complex.<\/p>\n<p>Proving a winning malpractice case requires extensive experience in analyzing the medical records and literature and conducting thorough investigations with expert witnesses. Many depositions are taken and often times there is a jury trial.<\/p>\n<p>Lamkin, Van Eman, Trimble &amp; Dougherty handle malpractice cases throughout the state of Ohio, including central and southern Ohio.<\/p>\n<h2>Categories Of Medical Negligence<\/h2>\n<p>There are many different ways medical errors can occur. The top four categories include:<\/p>\n<p><strong>1. Errors By Medical Professionals<\/strong><\/p>\n<p>Some of the most common and catastrophic errors by medical professionals involve negligent surgical procedures, including anesthesia errors and medical tools left inside the bodies of patients, careless medication errors by pharmacists or doctors, birth injuries, misdiagnosis and <a href=\"\/medical-malpractice\/nursing-home-abuse-negligence\/\">nursing home negligence<\/a>.<\/p>\n<p><strong>2. Facility Negligence<\/strong><\/p>\n<p>When hospitals, family clinics, emergency rooms and other facilities fail to maintain safe and well-equipped areas for patients, injuries like slip and falls and <a href=\"\/medical-malpractice\/nursing-malpractice\/\">staph infections<\/a> occur&mdash;and the results can be catastrophic.<\/p>\n<p><strong>3. Failure To Diagnose<\/strong><\/p>\n<p>Early detection is critical for treatment, containment and remediation of <a href=\"\/medical-malpractice\/gynecological-cancer\/\">gynecological cancer<\/a>, heart problems, diabetes and a range of other physical problems, including those stemming from a lack of oxygen to a baby during birth. Serious illnesses allowed to grow or expand cause increased complications as a result of a doctor&#8217;s failure to detect the illness.<\/p>\n<p><strong>4. Lack Of Informed Consent<\/strong><\/p>\n<p>Patients are entitled to make decisions regarding their medical treatment and are entitled to be informed about the material risks for a medical procedure or treatment. When a physician fails to disclose to a patient the material risks and dangers of a surgery or other care, and an injury occurs, then the patient may have a claim based on lack of informed consent.<\/p>\n<h2>Protecting The Rights Of Injured Parties Since 1968<\/h2>\n<p>At <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, our attorneys have seen how negligent medical care can change a person&#8217;s life forever.<\/p>\n<h2>Our Knowledge And Experience<\/h2>\n<p>Attorney Tim Van Eman has over 30 years of experience assisting Ohioans with medical malpractice claims. Medical malpractice attorney Kathy A. Dougherty has 15 years of experience working in various roles in hospitals and clinics.<\/p>\n<p>Such experience is invaluable and unmatched by many of our competitors.<\/p>\n<p>Let us help you recover. Our legal team is committed to helping clients in Columbus, Ohio, pursue the compensation they deserve for the injuries they have suffered.<\/p>\n<h2><strong>Contact Our Firm Today<\/strong><\/h2>\n<p>Turn to our experienced lawyers to help with your medical malpractice claim. Schedule a free initial consultation. Call <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span><\/strong> or <a href=\"\/contact\/\">contact us online<\/a>.<\/p>\n<p>We collect attorneys&#8217; fees only if we recover compensation for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We Advocate For Victims Of Medical Malpractice Doctors, nurses and other health care professionals have a duty to provide care that meets certain standards. When they fail to meet the applicable standards and a patient is injured, they have committed medical malpractice and they need to be held accountable for the lapse in care and its consequences. Understanding When An&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45968"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=45968"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45968\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=45968"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}