{"id":45983,"date":"2019-10-02T23:09:48","date_gmt":"2019-10-03T04:09:48","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/auto-accident-injuries\/"},"modified":"2021-03-26T12:25:21","modified_gmt":"2021-03-26T17:25:21","slug":"auto-accident-injuries","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/auto-accident-injuries\/","title":{"rendered":"Auto Accident Injuries"},"content":{"rendered":"<h1>Helping Columbus Accident Victims For 50 Years<\/h1>\n<p>If you have been injured in a car accident, you are suddenly forced to deal with multiple problems — hospitalization, doctor visits, medical bills, lost time from work and frequent communication with insurance companies, to name a handful.<\/p>\n<p>Rather than dealing with these problems yourself, enlist the help of our respected and experienced auto accident injury lawyers. For 50 years, the attorneys at <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, have been helping people in your situation obtain the compensation they need. With more than 100 years of combined experience, our lawyers help those in Columbus and surrounding areas obtain money to cover medical expenses and lost wages, among other damages, following <a href=\"\/auto-accident-injuries\/car-accidents\/\">car crashes<\/a> and:<\/p>\n<ul>\n<li><a href=\"\/auto-accident-injuries\/truck-accidents\/\">Commercial trucking accidents<\/a> caused by driver fatigue, improperly loaded cargo and mechanical failure<\/li>\n<li>Motorcycle accidents caused by distracted drivers who fail to pay proper attention to motorcyclists<\/li>\n<li>Pedestrian and bicycle auto accidents caused by drivers who fail to yield right of way to walkers and bikers<\/li>\n<li>Public transportation accidents caused by negligent city, charter, tour, school or Central Ohio Transit Authority (COTA) bus drivers<\/li>\n<li>Ride-hailing accidents caused by drivers operating ride-booking services such as Uber, Lyft and Sidecar<\/li>\n<\/ul>\n<h2>Our Track Record Of Success: Multimillion-Dollar Results<\/h2>\n<p>The quality of the representation we provide has led Ohio Super Lawyers to select attorney Timothy L. Van Eman for its listing. Our track record of success includes securing multimillion-dollar verdicts and settlements for our clients. Let us help you secure the compensation you need.<\/p>\n<h2>Learn How We Can Help You Today<\/h2>\n<p>Turn to our skilled and experienced personal injury attorneys to help you. Schedule a free initial consultation today by calling <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span><\/strong> or simply <a href=\"\/contact\/\">contact us online<\/a>. There are no upfront costs and we collect attorneys&#8217; fees only if we recover compensation for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Helping Columbus Accident Victims For 50 Years If you have been injured in a car accident, you are suddenly forced to deal with multiple problems — hospitalization, doctor visits, medical bills, lost time from work and frequent communication with insurance companies, to name a handful. Rather than dealing with these problems yourself, enlist the help of our respected and experienced&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45983"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=45983"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45983\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=45983"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}