{"id":46015,"date":"2019-10-02T23:10:24","date_gmt":"2019-10-03T04:10:24","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/truck-accidents\/"},"modified":"2020-09-23T21:08:26","modified_gmt":"2020-09-24T02:08:26","slug":"truck-accidents","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/auto-accident-injuries\/truck-accidents\/","title":{"rendered":"Truck Accidents"},"content":{"rendered":"<h1>Helping Columbus Injury Victims Recover From Truck Accident Injuries<\/h1>\n<p>Commercial truck drivers and trucking companies are held to a higher standard than other drivers &mdash; and for good reason. A tractor-trailer hauling a full load can cause extraordinary damage in a high-speed highway accident.<\/p>\n<p>Many of these accidents often result in catastrophic injuries and even death to others on the road. Sorting out all the details of an accident to get you or your loved one the necessary compensation takes a lawyer with substantial understanding of trucking laws and personal injury laws.<\/p>\n<h2>A Law Firm With Expertise Assembling Evidence Of Truck Accident Insurance Claims<\/h2>\n<p>At <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, our Columbus attorneys have over 100 years of combined legal experience. We know how to effectively and efficiently assemble the evidence of a truck accident insurance claim. We will:<\/p>\n<ul>\n<li>Examine all accident reports, talk to witnesses and conduct our own investigation of the accident.<\/li>\n<li>Consult with trucking experts and accident reconstructionists to help determine <a href=\"\/auto-accident-injuries\/truck-accidents\/causes-of-trucking-accidents\/\">what caused the accident<\/a> and why.<\/li>\n<li>Review medical bills and medical records to determine the extent of injuries and the prognosis for a full or partial recovery. If the accident was fatal, we can build a case for compensation for a lost loved one in a wrongful death action.<\/li>\n<li>Review driver logs, truck maintenance logs, trucking company training policies and driving records to determine whether all interstate commerce regulations were met.<\/li>\n<li>Take your case to trial if a fair settlement agreement cannot be reached.<\/li>\n<\/ul>\n<h2>Our Main Goal Is To Get You The Compensation You Need To Get Your Life Back Together<\/h2>\n<p>Our main goal is to provide you (or the family of a wrongful death victim) with the compensation necessary to get your life back together.<\/p>\n<p>Our firm has a 50-year tradition of representing injured people and the families of <a href=\"\/catastrophic-injuries-fatalities\/wrongful-death\/\">wrongful death victims<\/a> throughout Ohio. We offer free consultations and charge no legal fees unless we recover compensation for you.<\/p>\n<p><a href=\"\/contact\/\">Email us<\/a> or call our Columbus office for a free consultation at <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span><\/strong>.<strong> <\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Helping Columbus Injury Victims Recover From Truck Accident Injuries Commercial truck drivers and trucking companies are held to a higher standard than other drivers &mdash; and for good reason. A tractor-trailer hauling a full load can cause extraordinary damage in a high-speed highway accident. Many of these accidents often result in catastrophic injuries and even death to others on the&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":45983,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46015"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46015"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46015\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45983"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46015"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}