{"id":46023,"date":"2019-10-02T23:10:34","date_gmt":"2019-10-03T04:10:34","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/mission-statement\/"},"modified":"2020-09-23T21:51:34","modified_gmt":"2020-09-24T02:51:34","slug":"vision-statement","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/vision-statement\/","title":{"rendered":"Mission Statement"},"content":{"rendered":"<h1>What We Are Known For<\/h1>\n<p>You need a law firm that has the resources, the work ethic and the reputation to demand top dollar for your case. We are that law firm.<\/p>\n<p>The following represents not only our mission statement but also why we&#8217;re respected in the Ohio legal community:<\/p>\n<h3>RESULTS<\/h3>\n<p>Over the years, we have obtained millions of dollars for clients in verdicts and settlements. Insurance companies know if they don&#8217;t offer a fair settlement, we will spend the time and money to take our clients&#8217; cases to trial. This isn&#8217;t true for all law firms, but it&#8217;s been true for us since we opened our doors in 1968.<\/p>\n<h3>Commitment<\/h3>\n<p>Our relationship with our clients is the core of our practice. From the initial meeting, you will meet with one of our attorneys to discuss your claim. We pride ourselves on being open and honest from the first meeting through the end of your case.<\/p>\n<h3>Confidence<\/h3>\n<p>We&#8217;re good at what we do, and the community here in Columbus and across Ohio knows it. Having represented clients across the state for more than 50 years, we&#8217;ve earned the respect of judges, opposing lawyers and even insurance companies.<\/p>\n<h3>Hard Work<\/h3>\n<p>When it comes to your case, we will do what it takes to maximize your recovery. That means utilizing state-of-the-art investigation and research methods. It means securing the services of top-notch experts to strengthen your case. Should the case need a trial, we&#8217;ll have done the necessary leg work already to fight for a fair and just result.<\/p>\n<h3>Ethical<\/h3>\n<p>Our first duty is to you, our client, but our ethical obligations extend to the courts and our profession, and they are equally important to us. We will represent you with honesty, integrity and professionalism. We will strictly observe the confidentiality of your discussions with us.<\/p>\n<p class=\"callOut\">Learn more about our <a href=\"\/attorneys\/\">legal team<\/a> today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What We Are Known For You need a law firm that has the resources, the work ethic and the reputation to demand top dollar for your case. We are that law firm. The following represents not only our mission statement but also why we&#8217;re respected in the Ohio legal community: RESULTS Over the years, we have obtained millions of dollars&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46023"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46023"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46023\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46023"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}