{"id":46031,"date":"2019-10-02T23:10:42","date_gmt":"2019-10-03T04:10:42","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/verdicts-settlements\/"},"modified":"2020-09-23T22:08:41","modified_gmt":"2020-09-24T03:08:41","slug":"verdicts-settlements","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/verdicts-settlements\/","title":{"rendered":"Verdicts &#038; Settlements"},"content":{"rendered":"<h1>Verdicts &amp; Settlements<\/h1>\n<p><span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, represents serious injury and death victims throughout Ohio and the Midwest. Our team has assisted victims of all types of life-threatening and life-altering injuries. A measure of our success has been our ability to recover significant financial damages for the loved ones of wrongful death victims and for those injured by the negligence of others. We have won settlements and verdicts of all sizes, including the sampling listed below:<\/p>\n<ul>\n<li>$6,700,000 for closed head brain injury of car passenger hit by a truck that failed to stop at a stop sign.<\/li>\n<li>$4,400,000 for failure of hospital to diagnose and treat patient with diabetic ketoacidosis in the emergency room.<\/li>\n<li>$3,850,000 for a construction worker in a lift truck that lacked adequate fall protection and was hit by another vehicle.<\/li>\n<li>$3,300,000 for negligent monitoring of pediatric patient.<\/li>\n<li>$3,222,000 for truck driver who was filling his tank with gas and was crushed by another truck as it was pulling away from the gas pumps. Truck driver sustained major internal injuries.<\/li>\n<li>$3,200,000 for injuries to young man caused by a driver who ran a red light.<\/li>\n<li>$2,300,000 for failure to properly monitor a patient following cardiac catheterization resulting in death.<\/li>\n<li>$1,000,000 in failing to properly treat for pneumonia resulting in death.<\/li>\n<li>$1,000,000 for failure to timely diagnose melanoma.<\/li>\n<li>$986,000 for home construction worker blinded in one eye by a defectively manufactured hammer.<\/li>\n<li>$925,000 for emergency room negligence for failure to diagnose and treat patient with symptoms of diabetic ketoacidosis.<\/li>\n<li>$925,000 for the wrongful death of a truck driver who was killed due to the fault of the operator of another semi-tractor trailer.<\/li>\n<li>$900,000 for failure of emergency room to timely diagnose and treat patient in diabetic coma resulting in death.<\/li>\n<li>$900,000 against employer for exposing employee to hard metal particulates that caused severe lung disease.<\/li>\n<li>$899,400 against landlord for lack of smoke alarms and other code violations causing injury and death in apartment fire.<\/li>\n<li>$875,000 for wrongful death as a result of a truck driver losing control of his vehicle.<\/li>\n<li>$801,250 for injuries sustained to family as a result of a rear-end auto accident.<\/li>\n<li>$801,250 for a 10-year-old boy who need scar revision surgery as a result of a motor vehicle crash.<\/li>\n<li>$800,000 for dental and orthodontic malpractice for failure to diagnose and treat tongue cancer.<\/li>\n<li>$775,000 for failure to timely diagnose and treat stroke in emergency room.<\/li>\n<li>$750,000 for the family of a young unmarried and unemployed man who lost his life in a fatal car crash.<\/li>\n<li>$725,000 for head-on motor vehicle collision.<\/li>\n<li>$700,000 for family of patient who was left brain dead during wisdom tooth removal due to anesthesia overdose and oral surgeon&#8217;s failure to monitor.<\/li>\n<li>$670,000 for death of wife in car-truck accident. Husband driver alleged to have negligently turned left in front of dump truck.<\/li>\n<li>$535,000 for failure by a radiologist to properly report and interpret an MRI of the brain.<\/li>\n<li>$525,000 against hospital for failure to prevent pressure ulcer in paraplegic.<\/li>\n<li>$505,000 for a high school student who had a concussion and closed head injury due to a serious automobile crash.<\/li>\n<li>$510,000 for bilateral ankle fractures in auto accident.<\/li>\n<li>$500,000 for a middle-aged women with a hip fracture caused by a careless driver who ran a stop sign.<\/li>\n<li>$500,000 for failure to properly monitor patient hospitalized for pancreatitis, resulting in patient&#8217;s death<\/li>\n<li>$500,000 for fatal crash caused by tractor-trailer driver&#8217;s illegal parking at entrance to an interstate rest area.<\/li>\n<li>$450,000 for medical malpractice related to failure to diagnose and treat hemochromatosis. Hemochromatosis is an inherited condition causing the body to absorb too much iron damaging organs such as the liver, heart and pancreas.<\/li>\n<li>$450,000 for failure to timely diagnose and treat hemochromatosis.<\/li>\n<li>$400,000 for the family of a woman who died due to a pulmonary embolus which occurred after a broken ankle suffered in an automobile accident.<\/li>\n<li>$400,000 for a mild brain injury suffered as a result of an out-of-state automobile crash.<\/li>\n<li>$400,000 against insurer who improperly denied claim for collapse of building following massive snowstorm.<\/li>\n<li>$400,000 for motorcycle police officer injured when car failed to yield on left turn, striking officer.<\/li>\n<li>$400,000 for failure to diagnose lung cancer.<\/li>\n<li>$380,000 for surgical error in laparoscopic gallbladder removal.<\/li>\n<li>$375,000.00 for defective knee implant.<\/li>\n<li>$360,000 including payment for an insurance company&#8217;s bad faith claim handling for a young man who had a broken hip in an automobile crash caused by an under-insured motorist.<\/li>\n<li>$350,000 for concussion, femoral fracture and neck injuries sustained in a head-on collision. Plaintiff had significant pre-existing medical conditions.<\/li>\n<li>$330,000 for failure to timely diagnose osteosarcoma.<\/li>\n<li>$325,000 against a doctor for a negligent hernia surgery.<\/li>\n<li>$310,000 for life insurance dispute. Insurance company claimed Plaintiff failed to disclose prior medical condition on application for insurance.<\/li>\n<li>$300,000 for failure to diagnose and treat pulmonary embolus.<\/li>\n<li>$300,000 for driver injured due to illegal U-turn by other vehicle.<\/li>\n<li>$300,000 for a man who had neck and back injuries due to an automobile accident.<\/li>\n<li>$290,000 for a man who sustained a neck injury, a concussion, and a broken rib in a car wreck.<\/li>\n<li>$250,000 for multiple traumas in car accident.<\/li>\n<li>$250,000 policy limit for death from a car accident.<\/li>\n<li>$240,000 for serious strains, abrasions and contusions caused by the negligence of a commercial truck driver.<\/li>\n<li>$240,000 for a woman who had a cervical strain and multiple abrasions and eventually needed arthroscopic knee surgery due to a truck driver&#8217;s negligence in running a stop sign.\n<p>$235,000 for error during cardiac valve surgery.<\/li>\n<li>$225,000 for mild closed head injury from car accident.<\/li>\n<li>$215,000 for Plaintiff injured due to negligence of podiatrist.<\/li>\n<li>$215,000 for auto accident injuries as a result of at-fault driver failing to yield on a left turn.<\/li>\n<li>$205,000 for mild closed head injury and sprains due to the negligence of truck driver.<\/li>\n<li>$200,000 for worker injured when required by employer to drive improperly maintained company truck.<\/li>\n<li>$200,000 for excessive removal of soft palate in surgery to alleviate snoring.<\/li>\n<li>$200,000 for family of elderly driver who died following collision with illegally parked equipment trailer.<\/li>\n<li>$200,000 against driver for injury to college student riding bike.<\/li>\n<li>$195,000 for defective hip implant.<\/li>\n<li>$195,000 for leg injury to pedestrian.<\/li>\n<li>$175,000 for head and neck injury for child injured on amusement park ride.<\/li>\n<li>$140,000 for nursing home negligence in allowing a resident to develop bedsores.<\/li>\n<li>$110,000 for Achilles tendon injury at public swimming pool.<\/li>\n<li>$100,000 for injuries to driver who stopped at stop sign, then proceeded to turn and was struck by speeding police cruiser without lights and siren.<\/li>\n<li>$100,000 for knee injury in auto collision where Defendant went left of center.<\/li>\n<li>$90,000 for shoulder injury as a result of fall in hospital.<\/li>\n<li>Settlement of insurance policy limits for driver who sustained serious back injury after being struck by drunk driver.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Verdicts &amp; Settlements , represents serious injury and death victims throughout Ohio and the Midwest. Our team has assisted victims of all types of life-threatening and life-altering injuries. A measure of our success has been our ability to recover significant financial damages for the loved ones of wrongful death victims and for those injured by the negligence of others. We&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46031"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46031"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46031\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46031"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}