{"id":46085,"date":"2019-10-02T23:12:02","date_gmt":"2019-10-03T04:12:02","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/nursing-malpractice\/"},"modified":"2020-09-23T21:46:15","modified_gmt":"2020-09-24T02:46:15","slug":"nursing-malpractice","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/medical-malpractice\/nursing-malpractice\/","title":{"rendered":"Nursing Malpractice"},"content":{"rendered":"<h1>Nurses Can Be Equally Responsible For Your Medical Injury<\/h1>\n<p>When it comes to medical malpractice, most people think of errors made by doctors or surgeons. However, nurses play a critical role in the treatment of patients. A mistake or negligence on their part can do just as much damage as an error made by a doctor.<\/p>\n<h2>Understaffed, Overworked Or Low Pay? That Doesn&#8217;t Excuse What Happened.<\/h2>\n<p>At <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, our attorneys help victims of nursing malpractice seek full compensation. We represent people in the Columbus area and throughout Ohio.<\/p>\n<p>We understand that nurses are under a lot of pressure. Hospitals and medical facilities may try to eliminate or reduce costs by leaving positions open, or by employing nursing technicians or nurse&#8217;s aides rather than fully certified and licensed nursing professionals.<\/p>\n<p>Nurses are expected to be advocates for their patients. In many cases, these professionals neglect, ignore or simply miss signs and symptoms that should have been a warning that a catastrophic event was coming.<\/p>\n<h2>Common Mistakes Made By Nurses<\/h2>\n<p>Common mistakes include:<\/p>\n<ul>\n<li>Failure to take accurate or complete history at intake or triage<\/li>\n<li>Failure to adequately observe and pay attention to patient monitors<\/li>\n<li>Failure to take vital signs<\/li>\n<li>Failure to monitor vital signs on an ongoing basis<\/li>\n<li>Failure to <a href=\"\/medical-malpractice\/hospital-patient-injuries-from-falls\/\">protect those who are at risk of falling<\/a><\/li>\n<li>Failure to communicate important information from one discipline to another<\/li>\n<li><a href=\"\/medical-malpractice\/medication-errors\/\">Prescriptions medication errors<\/a><\/li>\n<li>Failure to check for medication allergies<\/li>\n<li>Improper administration of medication<\/li>\n<li>Failure to recognize an adverse reaction to medication<\/li>\n<\/ul>\n<h2>Extensive Medical Knowledge<\/h2>\n<p>One of our lawyers, Kathy Dougherty, has an extensive medical background. She holds a bachelor&#8217;s degree in nursing and an associate degree in respiratory therapy. Her 15 years of medical experience includes serving as a respiratory therapist, neonatal nurse, neonatal transport clinician and neonatal nurse practitioner in both Level II and Level III hospitals.<\/p>\n<h2>A Clear Understanding Of Medical Malpractice Matters<\/h2>\n<p>This education and the firm&#8217;s experience allow us to clearly understand all of the issues associated with a potential case, to ask questions that others may leave unanswered, and to evaluate the actions taken (or not taken) and their impact on the ultimate outcome for the patient.<\/p>\n<p>Our attorneys have successfully handled numerous medical malpractice and negligence cases, and are dedicated to pursuing financial justice for those who have been wronged. We have an in-depth understanding of the legal obligations hospitals must meet. We have expert witnesses in a wide range of medical fields at our disposal.<\/p>\n<p>If you have suffered due to nursing negligence, or have lost a loved one to <a href=\"\/catastrophic-injuries-fatalities\/wrongful-death\/\">wrongful death<\/a> while they were under the care of a nurse, we are here to stand up for your rights.<\/p>\n<h2>Contact Our Experienced Attorneys Today To Schedule Your Free Initial Consultation<\/h2>\n<p>Let us talk with you to find out what happened and potential recourse avenues available.<\/p>\n<p>Call <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span> <\/strong>or <a href=\"\/contact\/\">send us an email<\/a> if you have an inquiry.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nurses Can Be Equally Responsible For Your Medical Injury When it comes to medical malpractice, most people think of errors made by doctors or surgeons. However, nurses play a critical role in the treatment of patients. A mistake or negligence on their part can do just as much damage as an error made by a doctor. Understaffed, Overworked Or Low&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":45968,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46085"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46085"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46085\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45968"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46085"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}