{"id":46097,"date":"2019-10-02T23:12:17","date_gmt":"2019-10-03T04:12:17","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/hospital-patient-injuries-from-falls\/"},"modified":"2020-09-23T21:35:02","modified_gmt":"2020-09-24T02:35:02","slug":"hospital-patient-injuries-from-falls","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/medical-malpractice\/hospital-patient-injuries-from-falls\/","title":{"rendered":"Hospital Patient Injuries From Falls"},"content":{"rendered":"<h1>Legal Representation For Victims Of Hospital Falls<\/h1>\n<p>When someone is in the hospital, it is only natural to expect that a safe environment will be provided to help meet the patient&#8217;s needs. However, falls in hospitals can and do happen and frequently cause serious fractures, especially in the elderly.<\/p>\n<h2>Top Five Causes Of Hospital Falls<\/h2>\n<p>Hospital patients are in a vulnerable state and extra precautions must be taken regarding their care. Some of the common causes of hospital falls include:<\/p>\n<ol>\n<li> <strong>Patient transfers:<\/strong> Many patients may be immobile for any number of reasons and require manual transfer by hospital staff to get in and out of bed. Staff should move patients in a safe and effective manner that is designed to reduce the risk of injury. When staff fails to provide this level of care, falls and serious injuries can occur.<\/li>\n<li> <strong>Falling out of bed:<\/strong> Patients can also fall out of bed when unattended and when proper fall precautions, such as bed rails, are not used.<\/li>\n<li> <a href=\"\/medical-malpractice\/hospital-malpractice\/\"><strong>Premature discharge:<\/strong><\/a> Medications and certain medical conditions can leave patients feeling dizzy and prone to a loss of balance. If a patient who is at risk for a fall is discharged early or is not given instructions for how to avoid a fall, the medical provider may be liable for the harm the results.<\/li>\n<li> <strong>Slippery floors:<\/strong> Hospitals must maintain a sterile environment. This requires a frequent cleaning of floors and other surfaces. If a floor is wet or otherwise slippery, the medical provider must take proper precautions to warn patients and visitors. If the hospital fails to provide a warning, it may be responsible for any ensuing damages.<\/li>\n<li> <a href=\"\/medical-malpractice\/hospital-pharmacy-errors\/\"><strong>Failure to warn of medication hazards<\/strong><\/a><strong>:<\/strong> Many medications result in dizzying side effects. If a patient is given a medication and not warned of the increased risk of falling, disastrous results may occur.<\/li>\n<\/ol>\n<h2>Helping You Seek Compensation For Your Injury<\/h2>\n<p>When medical facilities fail to address conditions that are likely to result in a fall, serious harm can occur and the injured victim may be entitled to recover financial compensation for his or her injuries.<\/p>\n<h2>Handling Claims For 50 Years<\/h2>\n<p>At <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, our Columbus attorneys have been representing injured people and their family members throughout Ohio for 50 years. We understand how to tackle complicated <a href=\"\/medical-malpractice\/\">medical malpractice claims<\/a> and are dedicated to holding negligent medical providers accountable for their actions.<\/p>\n<h2>Contact Our Lawyers If You Or A Loved One Was Hurt In A Hospital Fall<\/h2>\n<p>If you or a loved one has been hurt in a fall as a hospital patient, we can help you pursue the financial recovery you deserve.<\/p>\n<p>To schedule a free initial consultation, call <span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span>. You may also <a href=\"\/contact\/\">contact us online<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Legal Representation For Victims Of Hospital Falls When someone is in the hospital, it is only natural to expect that a safe environment will be provided to help meet the patient&#8217;s needs. However, falls in hospitals can and do happen and frequently cause serious fractures, especially in the elderly. Top Five Causes Of Hospital Falls Hospital patients are in a&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":45968,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46097"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46097"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46097\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45968"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46097"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}