{"id":46113,"date":"2019-10-02T23:12:37","date_gmt":"2019-10-03T04:12:37","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/uninsured-and-underinsured-motorist-claims\/"},"modified":"2020-09-23T21:25:11","modified_gmt":"2020-09-24T02:25:11","slug":"uninsured-and-underinsured-motorist-claims","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/insurance-disputes\/uninsured-and-underinsured-motorist-claims\/","title":{"rendered":"Uninsured And Underinsured Motorist Claims"},"content":{"rendered":"<h1>Why Is Uninsured And Underinsured Auto Insurance Important In Ohio?<\/h1>\n<p>In the state of Ohio, one in eight individuals drive without auto insurance or without adequate auto insurance. That statistic should alarm all of us who drive on the roadways.<\/p>\n<h2>An At-Fault Driver&#8217;s Insurance Will Pay For Your Losses Unless&#8230;<\/h2>\n<p>In Ohio, if you were involved in any type of car accident and the other driver was at-fault, typically that negligent driver&#8217;s insurance policy would provide you with compensation to pay for losses stemming from <a href=\"\/auto-accident-injuries\/\">your injuries<\/a>.<\/p>\n<p>Drivers in Ohio are required to carry a minimum of $25,000 personal injury coverage per person and $50,000 for all persons injured in any one accident.<\/p>\n<p>But what if an-at fault driver skirted the law and failed to get coverage? What if the driver only obtained the minimum $25,000 coverage?<\/p>\n<h2>Here&#8217;s How You Can Protect Yourself In The Future<\/h2>\n<p>Ohio drivers who get into accidents, suing a driver who has no auto accident insurance coverage to pay for your injuries won&#8217;t get them very far. For at-fault drivers who carry the minimum $25,000 coverage that won&#8217;t get you very far either, given today&#8217;s staggering costs of medical care.<\/p>\n<p>So what can you do? Getting uninsured or underinsured motorist coverage, or UM\/UIM coverage, on your own auto insurance policy is an option.<\/p>\n<p>UM\/UIM provides coverage for both personal injury and property damage resulting from an accident caused by a driver who is either uninsured or underinsured.<\/p>\n<p>Planning ahead is the name of the game.<\/p>\n<h2>What To Do If You Already Have UM\/UIM Coverage<\/h2>\n<p>If you are an Ohio driver and already have this type of coverage, our legal team at <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, can help make sure you are compensated by your insurance company.<\/p>\n<p>There are often hurdles involved when insurers file claims against their own insurance companies &mdash; their interests are opposite of yours. They may <a href=\"\/insurance-disputes\/\">deny your claim<\/a> or offer you a settlement much lower than you deserve.<\/p>\n<p>As a result, it&#8217;s important to have an attorney who will protect your interests and ensure you receive the full compensation you deserve.<\/p>\n<p>Let us help you. Our legal team has a 50-year history of helping injured people in Columbus obtain compensation from all sources of insurance available to them, including UM\/UIM coverage.<\/p>\n<h2>Are Your Interests Being Protected? Call Us Today.<\/h2>\n<p>If you or a loved one was injured in an auto accident and need help navigating your policy or dealing with your insurance company, <a href=\"\/contact\/\">send us an email<\/a> or call us at <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span> <\/strong>today to set up a free consultation with one of our experienced lawyers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Why Is Uninsured And Underinsured Auto Insurance Important In Ohio? In the state of Ohio, one in eight individuals drive without auto insurance or without adequate auto insurance. That statistic should alarm all of us who drive on the roadways. An At-Fault Driver&#8217;s Insurance Will Pay For Your Losses Unless&#8230; In Ohio, if you were involved in any type of&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":45972,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46113"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46113"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46113\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45972"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46113"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}