{"id":46149,"date":"2019-10-02T23:13:17","date_gmt":"2019-10-03T04:13:17","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/coma\/"},"modified":"2020-09-23T21:16:38","modified_gmt":"2020-09-24T02:16:38","slug":"coma","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/catastrophic-injuries-fatalities\/coma\/","title":{"rendered":"Coma"},"content":{"rendered":"<h1>Understanding The Dangers And Future Repercussions Of A Coma<\/h1>\n<p>A coma is a period of prolonged unconsciousness resulting from a serious head or brain injury. A coma can result from any accident that caused a serious head injury, including:<\/p>\n<ul>\n<li><a href=\"\/auto-accident-injuries\/car-accidents\/\">Motor vehicle accidents<\/a><\/li>\n<li>Workplace accidents<\/li>\n<li><a href=\"\/medical-malpractice\/surgical-errors\/\">Anesthesia errors<\/a><\/li>\n<\/ul>\n<p>Sadly, many comas leave victims in a permanent vegetative state. Families are forced to make tough decisions for their loved ones.<\/p>\n<h2><strong>Legal Help For The Injured<\/strong><\/h2>\n<p>If a loved one is or was in a coma due to an injury caused by the suspected negligent actions of another, seeking out skilled and experienced legal guidance is invaluable.<\/p>\n<p>An attorney can help you understand your options and can put forward the most effective case for securing the compensation that will be needed to cover the costs of long-term medical care or losses stemming from the death of your loved one.<\/p>\n<h2><strong>Turning To <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span><\/strong><\/h2>\n<p>At <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, our attorneys are dedicated to helping those who have a loved one in a coma or lost a loved one in an accident.<\/p>\n<p>Our lawyers have more than 100 years of combined experience representing families throughout Columbus, Ohio, with personal injury matters and a track record for securing multimillion-dollar verdicts and settlements.<\/p>\n<h2><strong>Super Lawyers, AV Preeminent Rating From Martindale-Hubbell<\/strong><\/h2>\n<p>Attorney Timothy L. Van Eman has been selected for inclusion in the Ohio Super Lawyers listing and both Mr. Van Eman and Thomas W. Trimble have received AV Preeminent* ratings from Martindale-Hubbell.<\/p>\n<p>Our team has worked with the loved ones of those who have fallen into comas after such seemingly mundane events as going in to have wisdom teeth removed.<\/p>\n<h2><strong>Let Us Help Secure The Compensation You Need<\/strong><\/h2>\n<p>We understand the challenges and decisions you face. We offer guidance during every stage of the process for you and your family.<\/p>\n<p>Call today to set up a free consult to talk about your circumstances and legal options: <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span><\/strong>. Or you can simply <a href=\"\/contact\/\">contact us online<\/a>. We collect attorneys&#8217; fees only if we recover compensation for you.<\/p>\n<p class=\"smallText\">*AV&reg;, AV Preeminent&reg;, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell&reg; is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell&reg; Peer Review Ratings&trade; fall into two categories &mdash; legal ability and general ethical standards.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Understanding The Dangers And Future Repercussions Of A Coma A coma is a period of prolonged unconsciousness resulting from a serious head or brain injury. A coma can result from any accident that caused a serious head injury, including: Motor vehicle accidents Workplace accidents Anesthesia errors Sadly, many comas leave victims in a permanent vegetative state. Families are forced to&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":45976,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46149"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46149"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46149\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45976"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46149"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}