{"id":46213,"date":"2019-10-02T23:15:54","date_gmt":"2019-10-03T04:15:54","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/types-of-stockbroker-negligence-claims\/"},"modified":"2020-09-23T21:57:27","modified_gmt":"2020-09-24T02:57:27","slug":"types-of-stockbroker-negligence-claims","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/other-practice-areas\/investor-claims\/types-of-stockbroker-negligence-claims\/","title":{"rendered":"Types Of Stockbroker Negligence Claims"},"content":{"rendered":"<h1>Negligence In Securities Transactions<\/h1>\n<p>Listed below is a more thorough explanation of different kinds of stockbroker or financial adviser negligence.<\/p>\n<h2><strong>The Most Common Claims Of Stockbroker Negligence<\/strong><\/h2>\n<p>Many people fail to file claims against a financial adviser or firm because they do not want to accuse that person or firm of fraud or to otherwise reflect on their licenses or character. Yet, few of us would fail to seek recovery if we were in a serious auto accident or if your builder constructed a home with a bad foundation or leaky roof.<\/p>\n<p>Every profession or trade has a standard of care. The same is true for stockbrokers and investment advisers. Violating the standard of care is negligence, or what is often referred to as stockbroker negligence or <a href=\"\/other-practice-areas\/investor-claims\/stockbroker-negligence\/\">stockbroker malpractice.<\/a><\/p>\n<p>Negligence for a stockbroker or investment adviser is any conduct that falls below accepted standards of care that a reasonable, prudent stockbroker or investment adviser would have followed in the same situation. This includes due diligence and operating in good faith.<\/p>\n<h2><strong>Asset Allocation<\/strong><\/h2>\n<p>Types of asset classes include stocks, bonds, cash, real estate, foreign currency, etc. A stockbroker or financial adviser should know that each client&#8217;s portfolio should have proper asset allocation and diversity. Because no one can accurately predict which asset classes will do well in any given year, proper diversification between and within assets is required to achieve a reasonable and relatively steady rate of return. Concentration in a particular asset class could cause extreme volatility in one&#8217;s portfolio, resulting in substantial losses.<\/p>\n<p>Proper asset allocation is affected by one&#8217;s age, education, life circumstances and investment profile. Stockbrokers and financial advisers have a duty to learn about a client&#8217;s circumstances and goals to recommend the best asset allocation to maximize return consistent with the client&#8217;s risk tolerance. Because asset allocation has a significant impact on a portfolio&#8217;s overall performance, your brokerage firm and securities adviser has a duty to provide a considered, deliberate distribution of your assets.<\/p>\n<h2><strong>Churning<\/strong><\/h2>\n<p>Churning involves trading frequently to make more commissions. The elements of a churning claim include:<\/p>\n<ol>\n<li>Excessive trading<\/li>\n<li>Stocks purchased or sold to generate commissions and not with the customer&#8217;s best interests in mind<\/li>\n<li>Reliance by the customer on the broker to make sound investment decisions for the customer<\/li>\n<\/ol>\n<p>Churning is often analyzed by means of the turnover ratio in the account. This is the total of sales in the account divided by the average value of the account in a given year. The higher the ratio, the more likely a churning charge can be made. There is no set number that establishes the violation, although the <strong> Securities and Exchange Commission <\/strong>and some courts have concluded that a turnover rate of over 6 percent is excessive per se. Depending on other circumstances, a churning case can also be proven at a significantly lower turnover rate. For example, a pattern of sales of securities soon after they are purchased (or vice versa) is one factor to consider. Another consideration is a pattern of sales or purchases between accounts over which the broker has control.<\/p>\n<p>Standards also exist stating that most accounts requiring a 15 percent annual return or more to break even meet the definition of excessive trading or churning.<\/p>\n<p>A broker can claim that the investor agreed to the excessive trading and that the investor made the decisions to trade frequently. Thus, for liability to exist in a churning case, it must also be proven that the broker had effective control of the investor&#8217;s account. Proof of control of the account by the stockbroker or adviser may be established through a written document &mdash; often a formal contract &mdash; granting the broker control of the account or by showing that the investor relied so completely on the advice and recommendations of the broker that the broker effectively assumed control of the account.<\/p>\n<h2><strong>Failure To Execute<\/strong><\/h2>\n<p>You placed an order to sell a stock, only to find out the order wasn&#8217;t filled or it was filled incorrectly, thereby costing you money.<\/p>\n<p>When you provide approval or direction, your investment professional is allowed &#8220;a reasonable time&#8221; to execute your securities orders. If your broker didn&#8217;t place the order or simply refused to do so or even dissuaded you from placing the order after you gave him or her instructions to do so, you may have a claim. Such failure may also be considered a breach of fiduciary duty. While a component of that duty may be to warn clients against particular purchases or sales when there is reason to consider them inadvisable, if the investor had reason to believe the order was going to be executed in spite of such recommendations, the broker and the broker&#8217;s firm may be liable for damages.<\/p>\n<p>If you provided your broker with an order to buy, asked your broker to sell a stock or had a stop loss order or something similar and your broker failed to execute it in a timely manner, you may have a claim against your broker for failure to execute securities orders. Your claim is strengthened if the stock you were attempting to sell lost significant value during the delay.<\/p>\n<h2><strong>Margin Trading<\/strong><\/h2>\n<p>Trading on margin involves borrowing some of the funds from the brokerage firm needed to purchase a security, thereby allowing &#8220;leverage,&#8221; or the ability to purchase larger amounts of stock. Margin creates potential for greater returns, but also has increased risk and the potential for increased losses. When buying on margin, the security is considered collateral for the &#8220;loan&#8221; from the brokerage firm, which gives the firm the right to sell the stock to pay off the loan. This can be done by the brokerage firm without telling the investor in advance, sometimes at a significant loss.<\/p>\n<p>In general, brokers must inform clients of the risks of margin trading, and such trading must be suitable for the particular investor&#8217;s circumstances. Also, margin trading cannot occur without the broker first having the client open a margin account. Margin trading without the client first agreeing to margin trading can result in the broker being held liable for any losses related to the margin purchase.<\/p>\n<h2><strong>Overconcentration<\/strong><\/h2>\n<p>Overconcentration claims are similar to asset allocation claims. If a broker invests all or most of a portfolio in one product or sector, the chance of losing large sums of money increases dramatically. As such, diversification is a key component to a balanced, profitable investment portfolio.<\/p>\n<p>A reasonable broker or financial adviser should have his or her client&#8217;s investments spread across different asset classes, industry sectors and securities in accordance with the individual circumstances and financial goals of each client. Overconcentration occurs when a broker puts too much emphasis on one type of investment or security &mdash; in other words, too many eggs in one basket. This often results in significant loss to the investor. Your broker and brokerage firm may be held liable for any losses resulting from overconcentration.<\/p>\n<h2><strong>Unsuitability<\/strong><\/h2>\n<p>A customer&#8217;s investment profile includes the customer&#8217;s age, other investments, financial situation and needs, tax status, investment objectives, investment experience, investment time horizon, liquidity needs, risk tolerance and any other information the customer may disclose to the member or associated person in connection with such recommendation. (FINRA Rule 2111.)<\/p>\n<p>An unsuitability claim is premised on the New York Stock Exchange&#8217;s &#8220;Know Your Customer Rule&#8221; (Rule 405) and the Financial Industry Regulatory Authority&#8217;s rules (Rules 2090 and 2111). The essence of an unsuitability claim is that a broker recommended the purchase of securities or other investments that were inconsistent with the customer&#8217;s financial situation, needs, goals, objectives and risk tolerance.<\/p>\n<p>The suitability doctrine requires brokers to continuously re-evaluate the needs of their investor clients. Using outdated information as a basis for current recommendations may render the broker liable for losses that occur as a result of unsuitable recommendations.<\/p>\n<h2><strong>Contact Us Today<\/strong><\/h2>\n<p>If you have lost money because your stockbroker or investment adviser recommended or allowed unsuitable investments in your account, you may have a claim worth pursuing.<\/p>\n<p>Attorney Tim Van Eman has the experience and resources to review, investigate and aggressively pursue <a href=\"\/other-practice-areas\/investor-claims\/\">unsuitability claims<\/a>.<\/p>\n<p>Call <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span> <\/strong>to set up a free consultation or <a href=\"\/contact\/\">complete the online form<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Negligence In Securities Transactions Listed below is a more thorough explanation of different kinds of stockbroker or financial adviser negligence. The Most Common Claims Of Stockbroker Negligence Many people fail to file claims against a financial adviser or firm because they do not want to accuse that person or firm of fraud or to otherwise reflect on their licenses or&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":45999,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46213"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46213"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46213\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45999"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46213"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}