{"id":46229,"date":"2019-10-02T23:16:40","date_gmt":"2019-10-03T04:16:40","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/securities-fraud\/"},"modified":"2020-09-23T21:53:56","modified_gmt":"2020-09-24T02:53:56","slug":"securities-fraud","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/other-practice-areas\/investor-claims\/securities-fraud\/","title":{"rendered":"Securities Fraud"},"content":{"rendered":"<h1>Private Rights Of Action In Securities Fraud Cases<\/h1>\n<p>Agencies such as the Securities and Exchange Commission (SEC) and the Financial Industry Regulatory Authority (FINRA) play key roles in protecting the integrity of the markets. More and more regulatory requirements have been added in recent years, in the wake of the most recent recession, for added protection to investors.<\/p>\n<p>But as an aggrieved investor who has been harmed, you do not need to rely solely on regulatory agencies to protect your rights.<\/p>\n<h2>Agencies Can Only Do So Much; Getting A Lawyer To Help Is Recommended<\/h2>\n<p>If a <a href=\"\/other-practice-areas\/investor-claims\/stockbroker-negligence\/\">stockbroker was negligent<\/a>, it makes sense to talk to an experienced attorney who can advise you on your legal rights and recourse you have as a private citizen.<\/p>\n<p>The same is true if you suspect there was outright <a href=\"\/other-practice-areas\/investor-claims\/stockbroker-fraud\/\">fraud by a stockbroker<\/a> or another financial professional. You do not have to wait passively and hope that Uncle Sam or a financial industry self-regulatory group like FINRA will somehow make things right.<\/p>\n<h2>Skilled Representation Handling Complex Securities Fraud Cases<\/h2>\n<p>At <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, our investor claims attorney, Tim Van Eman, helps individuals in Columbus and throughout Ohio, Michigan and other states with investor claims after a stockbroker or financial adviser has engaged in fraud or negligence.<\/p>\n<p>Multiple legal and factual issues can arise in securities cases that are undeniably complex. There may be factual questions about how a given investor&#8217;s profile affected interaction with a financial services professional. The recommendation that a broker or adviser makes to someone with considerable investment experience may be quite different than for someone with less experience.<\/p>\n<p>Regardless of an investor&#8217;s profile, however, basic protections are built into the law. Brokers do not get a free pass to engage in fraud or other deceptive tactics just because a more sophisticated investor is on the other side of the transaction.<\/p>\n<h2>Contact Tim Today To Find Out How He Can Help You<\/h2>\n<p>Contact experienced attorney Tim Van Eman for a confidential evaluation of your specific case. Call <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span><\/strong> or complete a <a href=\"\/contact\/\">simple online form<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Private Rights Of Action In Securities Fraud Cases Agencies such as the Securities and Exchange Commission (SEC) and the Financial Industry Regulatory Authority (FINRA) play key roles in protecting the integrity of the markets. More and more regulatory requirements have been added in recent years, in the wake of the most recent recession, for added protection to investors. But as&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":45999,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46229"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46229"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46229\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45999"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46229"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}