{"id":46237,"date":"2019-10-02T23:16:54","date_gmt":"2019-10-03T04:16:54","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/finra-arbitration\/"},"modified":"2020-09-23T21:52:57","modified_gmt":"2020-09-24T02:52:57","slug":"finra-arbitration","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/other-practice-areas\/investor-claims\/finra-arbitration\/","title":{"rendered":"FINRA Arbitration"},"content":{"rendered":"<h1>Legal Expertise On Investment Disputes Via FINRA Arbitration<\/h1>\n<h2>What Is FINRA?<\/h2>\n<p>The Financial Industry Regulatory Authority (FINRA) is the largest independent regulator for all securities firms doing business in the United States. FINRA oversees about 4,500 brokerage firms, 163,000 branch offices and 631,000 registered securities representatives.<\/p>\n<p>FINRA&#8217;s stated role is to protect investors by maintaining the fairness of the U.S. capital markets.<\/p>\n<h2>What Is FINRA Arbitration?<\/h2>\n<p>Most stockbroker and <a href=\"\/other-practice-areas\/investor-claims\/types-of-investor-claims\/\">investment claims<\/a> are arbitrated through FINRA. (This is because nearly every brokerage account includes a contractual provision that requires the customer to arbitrate any disputes.)<\/p>\n<p>FINRA handles the logistics of the arbitration, handles scheduling, enforces the rules of the arbitration process and coordinates selection of arbitrators for each case.<\/p>\n<h2>The Process<\/h2>\n<p>Your FINRA arbitration claim begins with your lawyer filing a statement of claim. The stockbroker and his or her firm then file an answer (which usually denies most of the allegations).<\/p>\n<p>FINRA arbitration differs from a court or jury trial in that the case is decided by a panel of arbitrators, usually three. The arbitrators are frequently lawyers or individuals with a business or securities background, and they get paid for their time spent at hearings for the case.<\/p>\n<p>FINRA arbitration rules require both sides of the dispute to exchange certain documents. Therefore, prior to the actual arbitration hearing, there is a significant amount of paper discovery between the claimant&#8217;s attorney and the broker&#8217;s attorney. As such, the claimant must assist his or her lawyer by providing required documents. Depositions are usually not allowed prior to the arbitration hearing.<\/p>\n<p>The claimant has the burden to prove the elements of his or her case. If the case does not settle, there will be an arbitration hearing with the arbitration panel making a decision after both sides present evidence and testimony. Both sides usually hire expert witnesses to help prove their case. Arbitration hearings can last from a day or two to several weeks, depending on the complexity of the case and the number of witnesses.<\/p>\n<p>After the arbitration hearing and decision by the arbitration panel, the case is over. If the claimant wins the case, payment is usually made within 30 days. There are rarely any appeals in FINRA arbitrations.<\/p>\n<h2>Will My Case Settle Before Arbitration?<\/h2>\n<p>Many FINRA arbitrations settle before the hearing. This is the same as settling out of court. However, there is no guarantee any given case will settle. As such, you and your lawyer must be prepared to fully arbitrate the case. As one would expect, the stronger the case, the more likely an offer of settlement will be made.<\/p>\n<h2>How Will My Lawyer Be Paid?<\/h2>\n<p>Attorney Tim Van Eman with <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, handles <a href=\"\/other-practice-areas\/investor-claims\/types-of-stockbroker-negligence-claims\/\">stockbroker-investor claims<\/a> for individuals in Columbus and throughout Ohio.<\/p>\n<p>If you or someone you care about has been a victim of stockbroker negligence or investment fraud, schedule an appointment today to find out Tim can help you.<\/p>\n<p>Call <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span><\/strong> or <a href=\"\/contact\/\">send an email<\/a> today. Tim offers services on a contingent fee basis and initial consultations are free.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Legal Expertise On Investment Disputes Via FINRA Arbitration What Is FINRA? The Financial Industry Regulatory Authority (FINRA) is the largest independent regulator for all securities firms doing business in the United States. FINRA oversees about 4,500 brokerage firms, 163,000 branch offices and 631,000 registered securities representatives. FINRA&#8217;s stated role is to protect investors by maintaining the fairness of the U.S.&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":45999,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46237"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46237"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46237\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45999"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46237"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}