{"id":46233,"date":"2019-10-02T23:16:47","date_gmt":"2019-10-03T04:16:47","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/investment-scams-fraud\/"},"modified":"2020-09-23T21:53:27","modified_gmt":"2020-09-24T02:53:27","slug":"investment-scams-fraud","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/other-practice-areas\/investor-claims\/investment-scams-fraud\/","title":{"rendered":"Investment Scams &#038; Fraud"},"content":{"rendered":"<h1>Are You The Victim Of An Investment Scam?<\/h1>\n<p>Misconduct by financial advisers and stockbrokers can go beyond ordinary negligence and rise to the level of intentional misconduct or fraud.<\/p>\n<p>Below are six examples of common investment adviser or stockbroker scams.<\/p>\n<h2>7 Common Types Of Investment Fraud<\/h2>\n<p>Stockbrokers and investment advisers are legally required to place the interests of their clients before the interests of themselves or their firms. Securities fraud is a gross violation of this duty as a direct result of the broker purposefully placing his or her own needs or the needs of his or her firm ahead of what is in the best interests of his or her clients. Securities fraud can range from theft by a single broker to widespread campaigns of deliberate misinformation.<\/p>\n<p>Types of investment or <a href=\"\/other-practice-areas\/investor-claims\/stockbroker-fraud\/\">stockbroker fraud<\/a> include:<\/p>\n<p><strong>1. Biased investment advice<\/strong> &mdash; A stockbroker may have a preference toward or against a specific company for various reasons, including the brokerage firm&#8217;s motivation to seek fees from certain issuers and advise clients according to that bias instead of actual research results.<\/p>\n<p><strong>2. Contradictory investment advice<\/strong> &mdash; A stockbroker may give contradictory advice to different clients and may purchase or sell securities in his or her own account before effecting these same transactions for customers.<\/p>\n<p><strong>3. Continuing a risk<\/strong> &mdash; A stockbroker may advise clients to hold securities based on speculation or uncertain future events when the risk is apparent and the potential gain is unlikely.<\/p>\n<p><strong>4. Conflict of interest<\/strong> &mdash; A stockbroker or brokerage firm that has outside ties to a business may sell that business&#8217;s stock, even if the investment opportunity is not the most lucrative for the client.<\/p>\n<p><strong>5. Theft<\/strong> &mdash; Stockbrokers who steal funds from their clients by persuading them to write checks payable directly to the broker usually are committing theft.<\/p>\n<p><strong>6. Toxic investments<\/strong> &mdash; Brokerage firms that push unsuitable, exotic and toxic investments to unsuspecting investors can be liable for securities fraud.<\/p>\n<p><strong>7. Unfounded advice<\/strong> &mdash; A stockbroker may persuade or discourage an investor toward or against a company, without the support of appropriate research, but instead based on unqualified or unfounded opinions of the stockbroker made without the benefit of due diligence.<\/p>\n<h2>Legal Representation To Review, Investigate And Aggressively Pursue Justice For You<\/h2>\n<p>Attorney Tim Van Eman in Columbus, Ohio, has the experience and resources to review, investigate and aggressively pursue your stockbroker or <a href=\"\/other-practice-areas\/investor-claims\/investment-scams-fraud\/\">investor fraud claim<\/a>.<\/p>\n<p>If you have questions about your investment, contact our office to find out how we can help. Tim offers free consultations. <a href=\"\/contact\/\">Send us an email<\/a> or call <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span> <\/strong>today to meet with an experienced Ohio lawyer.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are You The Victim Of An Investment Scam? Misconduct by financial advisers and stockbrokers can go beyond ordinary negligence and rise to the level of intentional misconduct or fraud. Below are six examples of common investment adviser or stockbroker scams. 7 Common Types Of Investment Fraud Stockbrokers and investment advisers are legally required to place the interests of their clients&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":45999,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46233"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46233"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46233\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45999"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46233"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}