{"id":46249,"date":"2019-10-02T23:17:25","date_gmt":"2019-10-03T04:17:25","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/sexual-abuse-in-nursing-homes\/"},"modified":"2020-09-23T21:44:14","modified_gmt":"2020-09-24T02:44:14","slug":"sexual-abuse-in-nursing-homes","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/medical-malpractice\/nursing-home-abuse-negligence\/sexual-abuse-in-nursing-homes\/","title":{"rendered":"Sexual Abuse In Nursing Homes"},"content":{"rendered":"<h1>Pursuing Justice For Victims Of Nursing Home Sexual Abuse<\/h1>\n<p>When you entrusted a loved one to the care of a nursing home, assisted living home or other long-term care facility, you rightfully expected that he or she would receive respectful care.<\/p>\n<p>You certainly did not anticipate that your loved one would be sexually assaulted by a caregiver, fellow resident or visitor in the facility.<\/p>\n<p>If this kind of attack has occurred, contact a lawyer right away &mdash; the sooner, the better.<\/p>\n<h2>A Legal Team That Will Do What It Takes To Uncover What Happened<\/h2>\n<p>Our attorneys at <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, are prepared to dig into the facts of the matter and develop a strategy for addressing concerns. Your family member may be able to recover significant monetary damages to cover medical treatment, psychological care and compensation for pain and suffering.<\/p>\n<p>When our Columbus, Ohio, law firm investigates a nursing home sexual abuse case, we may find evidence of <a href=\"\/medical-malpractice\/nursing-home-abuse-negligence\/\">negligence on the part of the facility<\/a> in addition to evidence of the perpetrator&#8217;s guilt. There may be a criminal case already underway against the accused.<\/p>\n<p>If we represent your loved one and your family, we may also discover patterns of:<\/p>\n<ul>\n<li>Negligent hiring practices at the facility<\/li>\n<li>Negligent supervision of caregivers<\/li>\n<li>Failure to conduct or review background checks<\/li>\n<li>Failure to investigate prior complaints<\/li>\n<\/ul>\n<p>A review of personnel records may indicate that other residents of the same facility had complained of inappropriate touching or other wrongful conduct. Your own family member may have complained &mdash; and supervisors may have dismissed those complaints.<\/p>\n<h2>An Experienced Team That Will Pursue Justice For Your Loved One<\/h2>\n<p>We understand that you may be in a state of shock after learning that your loved one was raped in a long-term care facility.<\/p>\n<p>Rest assured, with over 100 years of combined legal experience, we will pursue justice for your loved one and make sure to prevent any repeat occurrences in the same facility.<\/p>\n<h2>Contact Us To Learn More. Free Consults.<\/h2>\n<p>If you or a loved one suffered the indignity and pain of nursing home sexual abuse, we invite you to reach out to us. One of our lawyers at <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, will evaluate your case at no charge.<\/p>\n<p>Call <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span> <\/strong>today to schedule a free initial consultation. Or simply <a href=\"\/contact\/\">contact us online<\/a>.<\/p>\n<p>We collect attorneys&#8217; fees only if we recover compensation for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Pursuing Justice For Victims Of Nursing Home Sexual Abuse When you entrusted a loved one to the care of a nursing home, assisted living home or other long-term care facility, you rightfully expected that he or she would receive respectful care. You certainly did not anticipate that your loved one would be sexually assaulted by a caregiver, fellow resident or&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":46003,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46249"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46249"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46249\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46003"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46249"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}