{"id":46301,"date":"2019-10-02T23:19:03","date_gmt":"2019-10-03T04:19:03","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/truck-driver-fatigue\/"},"modified":"2020-09-23T21:14:00","modified_gmt":"2020-09-24T02:14:00","slug":"truck-driver-fatigue","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/auto-accident-injuries\/truck-accidents\/truck-driver-fatigue\/","title":{"rendered":"Truck Driver Fatigue"},"content":{"rendered":"<h1>Truck Driver Fatigue Puts Individuals At Great Risk<\/h1>\n<p>Truck driver fatigue resulting from driving too long without a rest break is a leading cause of tractor-trailer accidents. Tired drivers have slower reaction times than drivers who are properly rested. Drivers who fail to take required rest breaks are putting others at risk and are also breaking the law.<\/p>\n<h2>The Department Of Transportation Imposes Strict Rules On Truck Drivers<\/h2>\n<p>The DOT regulates how many hours a trucker can drive, how long the driver needs to rest and how drivers must document rest breaks in logbooks. When these rules are violated, both truck drivers and their employers may be liable.<\/p>\n<p>There are many DOT rules that apply to how long a truck driver may stay on the road. For example:<\/p>\n<ul>\n<li>Truckers may drive a maximum of 11 hours after 10 consecutive hours off duty<\/li>\n<li>Truck drivers are also required to undergo physicals to determine if they have health conditions that could cause them to fall asleep while driving<\/li>\n<\/ul>\n<h2>Representing Victims Of Truck Accidents Caused By Truck Driver Fatigue<\/h2>\n<p>At <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, we represent victims of truck accidents who are injured due to truck driver fatigue.<\/p>\n<p>If you or a loved one has been <a href=\"\/auto-accident-injuries\/truck-accidents\/\">injured by a tired driver,<\/a> we have over 100 years of combined legal experience helping individuals in your same situation.<\/p>\n<p>Our experienced Ohio personal injury lawyers have the resources to investigate the accident and review available evidence, such as the driver logbook, food and fuel receipts, the driver&#8217;s physical, and the truck GPS, to determine if the truck driver complied with the law.<\/p>\n<p>Whether a loved one suffered a disabling injury, such as a traumatic brain injury or spinal cord injury, or your loved one died in a <a href=\"\/auto-accident-injuries\/truck-accidents\/speeding-or-reckless-driving\/\">fatal tractor-trailer accident<\/a>, our law firm is here to hold the driver accountable and provide your family with the legal support and guidance you need.<\/p>\n<h2>Contact Us Today. Free Consultation. No Legal Fees Unless We Recover Compensation For You.<\/h2>\n<p>Contact our Columbus office <a href=\"\/contact\/\">online<\/a> or by calling <strong><span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span><\/strong> to set up a free consultation with one of our attorneys. Free consults. Contingency fee arrangements.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Truck Driver Fatigue Puts Individuals At Great Risk Truck driver fatigue resulting from driving too long without a rest break is a leading cause of tractor-trailer accidents. Tired drivers have slower reaction times than drivers who are properly rested. Drivers who fail to take required rest breaks are putting others at risk and are also breaking the law. The Department&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":46015,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46301"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46301"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46301\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46015"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46301"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}