{"id":46349,"date":"2019-10-02T23:20:43","date_gmt":"2019-10-03T04:20:43","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/important-steps-to-take-after-a-car-accident\/"},"modified":"2020-09-23T21:03:07","modified_gmt":"2020-09-24T02:03:07","slug":"important-steps-to-take-after-a-car-accident","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/auto-accident-injuries\/car-accidents\/important-steps-to-take-after-a-car-accident\/","title":{"rendered":"Important Steps To Take After A Car Accident"},"content":{"rendered":"<h1>What To Do After A Car Accident<\/h1>\n<p>No one ever expects to be involved in an auto accident, but with life&#8217;s many surprises, many of us suddenly find ourselves rear-ended by a distracted driver sitting at a stoplight or hit head on by a drunk driver.<\/p>\n<p>Below are several important steps we should all take note of to mitigate potential problems with an accident down the line.<\/p>\n<h2>Take These Important Steps After A Car Accident<\/h2>\n<ol>\n<li> <strong>Call the police. <\/strong>If you were taken to the emergency room, the police will likely contact you for a statement. Tell the police officer what happened. If you are able while still at the scene, get all other drivers&#8217; names, addresses, telephone numbers, license plate numbers and auto insurance information.<\/li>\n<li> <strong>Take photos. <\/strong>Take pictures of the vehicles and any <a href=\"\/auto-accident-injuries\/\">injuries.<\/a> Continue to take them periodically as bruises surface and after any surgery.<\/li>\n<li> <strong>Call an attorney. <\/strong>At Lamkin, Van Eman, Trimble &amp; Dougherty, we are available at <span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span>. You can also fill out our intake form. An appointment will be made for you to see an attorney. There is no fee for the initial consultation, and we get paid only if we obtain a recovery for you.<\/li>\n<li> <strong>Get medical care for your injuries as soon as possible.<\/strong>\n<ul>\n<li>Be sure to tell emergency room or other medical personnel about the accident, including when it happened and how it happened, and discuss every problem or injury you have.<\/li>\n<li>Have your medical bills paid by your health insurance or another medical care provider such as Medicare or Medicaid. You can discuss payment of your bills in more detail with your lawyer later.<\/li>\n<\/ul>\n<\/li>\n<li> <strong>Report the accident<\/strong> to your auto insurance company as soon as possible. If an insurance adjuster for the party at fault calls you, feel free to discuss your property damage claim, but advise the adjuster to speak to us regarding your injury claim. Be sure to get the adjuster&#8217;s contact information and the claim number.<\/li>\n<li> <strong>Continue to get medical care for your injuries.<\/strong> This is important, even if you feel better.<\/li>\n<li> <strong>Document all medical information.<\/strong> Be sure to keep a record of all the medical providers you see for your injuries and update your attorney periodically as to your condition. Feel free to make an appointment any time you wish for an in-person meeting with your lawyer.<\/li>\n<li> <strong>Keep track of your time off work.<\/strong> Try to get a doctor&#8217;s excuse, in writing, for any time off due to your injuries, and give a copy of each time-off slip to your lawyer.<\/li>\n<li> <strong>Keep a diary about your injuries.<\/strong> Detail in writing how your injuries affect you in your daily life at home, at work and during leisure activities. It&#8217;s also important to document the nature and extent of your pain, and the extent of your activity limitations or disability. Make entries in this diary as often as you like.<\/li>\n<\/ol>\n<h2>Contact Us About Your Accident Today<\/h2>\n<p>Got more questions? Send our Columbus attorneys <a href=\"\/contact\/\">an email<\/a>, or call our Columbus office to schedule a free consultation at <span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span>. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>What To Do After A Car Accident No one ever expects to be involved in an auto accident, but with life&#8217;s many surprises, many of us suddenly find ourselves rear-ended by a distracted driver sitting at a stoplight or hit head on by a drunk driver. Below are several important steps we should all take note of to mitigate potential&hellip;<\/p>\n","protected":false},"author":310,"featured_media":0,"parent":46019,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46349"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/310"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=46349"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46349\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46019"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=46349"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}