{"id":48738,"date":"2019-12-04T09:05:02","date_gmt":"2019-12-04T15:05:02","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/?page_id=48738"},"modified":"2021-03-31T10:12:17","modified_gmt":"2021-03-31T15:12:17","slug":"medical-malpractice-faq","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/medical-malpractice\/medical-malpractice-faq\/","title":{"rendered":"Medical Malpractice FAQ"},"content":{"rendered":"<h1>Answering Your Medical Malpractice Queries<\/h1>\n<p>If you believe you or a loved one was the victim of a careless or incompetent health care professional, it&#8217;s likely you have questions. The field of medical malpractice is incredibly complex. It can feel overwhelming to navigate, particularly if you are also coping with an injury caused by negligent care.<\/p>\n<p>The Ohio-based firm of <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>, is pleased to give you the answers to some of the most frequently asked questions regarding medical malpractice. If you do not see the answers that you need, please feel welcome to contact us and speak with a staff member.<\/p>\n<h2>What is medical malpractice?<\/h2>\n<p>Doctors, nurses and other medical professionals owe their patients a legal duty to provide care that is within recognized standards. If your provider&#8217;s care falls below the standard and you were injured as a result of their <a href=\"\/medical-malpractice\/\">medical negligence<\/a>, you could be entitled to compensation for the resulting damages such as further medical care, lost wages, and pain and suffering.<\/p>\n<h2>What are some examples of medical malpractice?<\/h2>\n<p>There is a wide variety of medical malpractice incidents. Some common examples include:<\/p>\n<ul>\n<li>Operating on the wrong body part<\/li>\n<li>Waiting too long to order a cesarean section<\/li>\n<li><a href=\"\/medical-malpractice\/birth-injuries\/\">Injuring an infant<\/a>, fetus or pregnant woman<\/li>\n<li>Failing to order a necessary test<\/li>\n<li>Prescribing the wrong medication<\/li>\n<li><a href=\"\/medical-malpractice\/misdiagnosis-or-failure-to-diagnose\/\">Misdiagnosing an ailment<\/a><\/li>\n<\/ul>\n<p>Any one of these actions can cause lifelong damage to your physical and emotional health.<\/p>\n<h2>What kinds of damages can I potentially collect?<\/h2>\n<p>Medical malpractice victims can seek compensation for the medical care they need to undo the damage the negligent doctor caused. They can also pursue damages for:<\/p>\n<ul>\n<li>Lost past and future wages tied to their injuries<\/li>\n<li>Pain and suffering<\/li>\n<li>Loss of enjoyment of life<\/li>\n<li>Loss of companionship<\/li>\n<\/ul>\n<p>These are only a few examples. Every case is different and may involve different damages.<\/p>\n<h2>If I file a malpractice lawsuit, will the case go to trial?<\/h2>\n<p>Though personal injury lawsuits tend to settle out of court, medical malpractice cases are more likely to go to trial. These cases often involve death and more severe injuries, and thus higher damage claims. Doctors and hospitals (and their insurance companies) may choose to gamble on a trial verdict rather than agree to a reasonable settlement.<\/p>\n<h2>Do I really need an attorney to represent me?<\/h2>\n<p>You stand a much better chance of recovering maximum compensation when you work with an attorney than you do on your own. Insurance companies and health care entities are backed by powerful lawyers. They do not want to pay the full amount owed to you. With an attorney like the ones at <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty<\/span>, you stand a fighting chance against these powerful corporations.<\/p>\n<h2>Need More Information About Medical Malpractice?<\/h2>\n<p>We are ready to fight for your right to fair and just compensation after a medical negligence incident. Call <span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span> or toll-free at <span class=\"nap-item nap-item--phone\"><a href=\"tel:\"><\/a><\/span> or <a href=\"\/contact\/\">send us an email<\/a> to schedule a free, confidential consultation with one of our attorneys. We are located in Columbus but take medical malpractice cases throughout Ohio.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Answering Your Medical Malpractice Queries If you believe you or a loved one was the victim of a careless or incompetent health care professional, it&#8217;s likely you have questions. The field of medical malpractice is incredibly complex. It can feel overwhelming to navigate, particularly if you are also coping with an injury caused by negligent care. The Ohio-based firm of ,&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"parent":45968,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/48738"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=48738"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/48738\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/45968"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=48738"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}