{"id":48733,"date":"2019-12-04T09:03:46","date_gmt":"2019-12-04T15:03:46","guid":{"rendered":"https:\/\/3309238-fork.findlaw4.flsitebuilder.com\/?page_id=48733"},"modified":"2021-03-31T10:09:42","modified_gmt":"2021-03-31T15:09:42","slug":"car-accidents-faq","status":"publish","type":"page","link":"https:\/\/www.injurymedmal.com\/auto-accident-injuries\/car-accidents\/car-accidents-faq\/","title":{"rendered":"Car Accidents FAQ"},"content":{"rendered":"<h1>What To Know About Car Accidents<\/h1>\n<p>If you were badly injured in a car accident, you probably are wondering what your rights are regarding compensation for your hospital bills, lost wages, pain and suffering, and other damages.<\/p>\n<p>Fortunately, we can help you. The following is an overview of the most common questions we receive at <span class=\"nap-item nap-item--name\">Lamkin, Van Eman, Trimble & Dougherty, LLC<\/span>. If you have more questions after reading, we encourage you to contact us and schedule a free consultation.<\/p>\n<h2>What should I do after an accident?<\/h2>\n<p>You might feel confused after a car crash. However, there are some <a href=\"\/auto-accident-injuries\/car-accidents\/important-steps-to-take-after-a-car-accident\/\">steps you should follow<\/a>:<\/p>\n<ol>\n<li>Seek medical attention immediately, even if you do not see any injuries.<\/li>\n<li>Contact the police to have them file a report.<\/li>\n<li>Get the contact information of the other driver and any witnesses.<\/li>\n<li>Take photos of the accident scene.<\/li>\n<li>Contact an attorney who can work with insurers for you.<\/li>\n<\/ol>\n<p>If you can follow these steps, your personal injury claim may go much more smoothly.<\/p>\n<h2>What can I collect damages for?<\/h2>\n<p>It&#8217;s not unusual for <a href=\"\/auto-accident-injuries\/car-accidents\/\">car crash<\/a> victims to need extensive medical care such as surgery, regular doctor&#8217;s visits and physical rehabilitation. Meanwhile, you could be forced to stop working for a long period of time, costing you a great deal of income. You can get compensation for costs like these. In addition, you may be able to recoup compensation for less easily calculated damages such as the pain and suffering you have experienced since the crash.<\/p>\n<h2>I might have been partly to blame for the accident. Can I still seek compensation?<\/h2>\n<p>Maybe. Ohio law states that a personal injury plaintiff can be up to 50% responsible for the accident and still be entitled to damages at trial. However, if the jury determines the plaintiff was responsible by a certain percentage, it must deduct that percentage from its verdict. For example, if a jury finds that the defendant was 75% liable and the plaintiff was 25% liable and that the plaintiff suffered $1,000,000 in damages, the plaintiff would receive $750,000.<\/p>\n<h2>Will my case go to trial?<\/h2>\n<p>The vast majority of personal injury lawsuits settle out of court, so a trial is unlikely. At the same time, when negotiations do not yield fair compensation, a trial can be necessary. If there&#8217;s a trial, your attorney will help you prepare for court.<\/p>\n<h2>What should I say to the other side’s insurance company?<\/h2>\n<p>You have no obligation to say anything to them. Let your lawyer handle communications with the insurance adjuster and the insurance company&#8217;s attorneys.<\/p>\n<h2>More Questions? Talk With An Experienced Lawyer Today.<\/h2>\n<p>These are probably only a few of the answers you need. Reach out to us and we can speak with you in more detail. Call <span class=\"nap-item nap-item--phone\"><a href=\"tel:+1-614-360-2706\">614-360-2706<\/a><\/span> or toll-free at <span class=\"nap-item nap-item--phone\"><a href=\"tel:\"><\/a><\/span> to <a href=\"\/contact\/\">schedule a free consultation<\/a> at our Columbus office. We practice law throughout Ohio.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What To Know About Car Accidents If you were badly injured in a car accident, you probably are wondering what your rights are regarding compensation for your hospital bills, lost wages, pain and suffering, and other damages. Fortunately, we can help you. The following is an overview of the most common questions we receive at . If you have more questions&hellip;<\/p>\n","protected":false},"author":113,"featured_media":0,"parent":46019,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/48733"}],"collection":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/users\/113"}],"replies":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/comments?post=48733"}],"version-history":[{"count":0,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/48733\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/pages\/46019"}],"wp:attachment":[{"href":"https:\/\/www.injurymedmal.com\/wp-json\/wp\/v2\/media?parent=48733"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}